{
  "requested_name": "Asuna Yuuki",
  "resolved_title": "Asuna Yuuki",
  "url": "https://hero.fandom.com/en/wiki/Asuna_Yuuki",
  "summary": "✓",
  "full_text": "Asuna Yuuki\n✓\n Click To Help Remilia!\nRemilia Scarlet foresees more to this article's fate, and any and all information on it may be outdated.Help improve this article by checking and updating its info wherever necessary.And now time resumes!\nHeroine Overview\nGallery\n“\nI'd rather stay myself until the very end than sit and rot away at an inn, back in the first town. Even if I get killed by a monster, I don't want to lose to this game... to this world... no matter what.\n„\n~ Asuna\nAsuna Yuuki is the deuteragonist of the Sword Art Online franchise. \nShe is Kirito's girlfriend/wife, the former second-in-command of the \"Knights of the Blood Oath\" guild in Sword Art Online, and the daughter of the former CEO of RECTO Progress Inc. who decided to retire shortly because of the crimes of her father's former employee as well Asuna's ex-fiance Nobuyuki Sugou was defeated by Kirito and arrested by the police after she was freed from the virtual world.\nShe is voiced by Haruka Tomatsu in the original Japanese version and Cherami Leigh in the English dub. The latter of whom also voiced Lucy Heartfilia in Fairy Tail, Ilia Amitola in RWBY, Minako Aino/Sailor Venus in Sailor Moon, Chloe Cerise in Pokémon Journeys, Sarada Uchiha in Boruto: Naruto Next Generations, Patricia \"Patty\" Thompson in Soul Eater, and Elizabeth Midford in Black Butler.\nAppearance\n\nReality/Sword Art Online Avatar\nSword Art Online AppearanceALfheim Online Appearance1/2\nShe has long orange-brownish chestnut hair and hazel eyes. In the early levels of SAO, she wears a dark red leather tunic, a lightweight copper breastplate and leather pants with boots up to the knees as well as a hooded cape. After joining the \"Knights of the Blood\", she wears a red and white uniform that all KoB members wear and wields a rapier made by Lisbeth, called the \"Lambent Light\".\nALfheim Online Avatar\nHer original avatar in ALfheim, was as Fairy Queen, Titania. She wore a white outfit, with a white long skirt, tube top showing her belly, along with a red ribbon that goes around the top part of her top that comes together to make a bow. She goes barefoot, and wears a white strip around her ankles.\nAfter being rescued by Kirito and returning to the game, she creates a new avatar, which is an Undine. She has light blue hair with an appearance that otherwise slightly differs from her SAO avatar. Her class is a healer, later known as «Berserk Healer» due to the fact that she enjoys fighting in the front line with her rapier occasionally, despite her role as a healer. Her Undine avatar is from her main account that was transferred from SAO. She also made a new account and trained a new character from scratch: the Sylph \"Erika\". The reason she created a new character was very simple: Sometimes she wanted to change her appearance as well. Erika specialized in melee and had most of its ability points devoted to dagger skills, so it was more suited for duels, Asuna was also half healer.\nPersonality\nAsuna originally didn't care about dying in the game, before meeting Kirito. That meeting drastically changed Asuna's personality and outlook on life. She soon takes most things Kirito says to heart and looks to him for help, using him as somewhat of a lifeline. She acts as a tsundere towards him for most of Volume 1, even when married.\nAsuna is a kind and helpful young woman, who is similar to Kirito, can not abandon another person in trouble even at the risk of her own life. She takes the game very seriously and is very focused on clearing it, before Kirito tells her to enjoy SAO some. Asuna is also somewhat proud and is not afraid to get physical with those that challenge her authority or skills. She even challenged Kirito to a duel after an argument over how to handle a Floor Boss. She isn't afraid to act out on her own and will take matters in her own hands from time to time when its needed.\nAsuna, once again similar to Kirito, is someone who can be controlled by her emotions many times. This is best shown in moments with Kirito where she jumped in front of an attack meant for him by Heathcliff and appeared to be killed. She also can't handle the deaths of others well and will lose control, attacking The Gleam Eyes after seeing the Liberation Army players get slaughtered without much if any thinking a head.\nIn ALO, after being saved by Kirito, Asuna's personality hasn't changed much except she's not as proud as she was in SAO. Her personality begins to develop further after meeting Yuuki. Seeing how, despite knowing she will die, Yui can still move forward, Asuna takes after her and resolves after her new friend's death to keep moving forward. She is also seems either dense to the fact that other girls having feelings for Kirito, or she knows that Kirito is only in love with her, and so it doesn't bother her.\nBiography\nAsuna picked up Sword Art after watching her brother setup the game for himself. Before Since he had a business trip at launch day created an account in her own name and logged in the game to try out VRMMORPG.\nTheme\nTo be added\nTrivia\nAsuna placed second in the Top 10 Female Characters in the Kono Light Novel ga Sugoi! 2012 and 2013 awards. She placed sixth back in 2011.\nAsuna is one of the two known players using their real name as an In Game Name (IGN), the other being Yuuki.\nIncluded in the first Blu-ray/DVD package, is a character song CD sang by Asuna (Tomatsu Haruka), titled \"Independent Destiny\". This is the 1st Character Song available for this series.\nIn the original \"web-novel\", Asuna did not hesitate to kill Kuradeel, when he began to beg for his life, and in-fact stabbed through him. This was changed in the Light Novel, Anime and Manga, so that it was Kirito who killed him, after Kuradeel attacks Asuna for her hesitation.\nThe Anime depicts Asuna and Kirito having met at the Meeting in «Tolbana», rather than in the dungeons, where Kirito informs Asuna about the meeting. Given this, the battle was on the very next day after the meeting, instead of 2 days after. This means that Kirito never showed Asuna his house, nor offered her the bath, as in the Light Novel.\nIn the anime, after the boss battle on the 1st floor, Asuna runs up to Kirito while he is still climbing the stairs, but in the LN, she actually caught up to him while he was sitting idly on the second floor.\nThe design of her KoB uniform in SAO was actually chosen by other members, who kept it a secret from her until it was ready. When she first saw her KoB uniform, she rejected it, saying that she couldn't wear something like it. But after Daizen told her with tears in his eyes that the price of even a single set of the uniform was colossal, she reluctantly agreed to wear it.\nAsuna gets freaked out by astral-type monsters and had used numerous excuses to avoid clearing Labyrinths on horror-theme Aincrad floors.\nThe light novel reveals that Asuna is weak to tickling, as seen when Kirito beats her by tickling her bare feet.\nAsuna is similar to Lucy Heartfilia. Both come from a rich family and have issues with one of their parents (Asuna with her mother and Lucy with her father), both are very kind in spite of their upbringings and both share the the same English voice actress (Cherami Leigh). Coincidentally, one of Asuna's online names in ALO is Titania, Queen of the Fairies, the nickname of Erza Scarlet, one of Lucy's friends and teammates.\nHer English Voice Actress, Cherami Leigh, also voiced Biyomon, Yokomon and Maki Himekawa in Digimon Adventure tri., Sarada Uchiha, Kurotsuchi and Anko Mitarashi in Boruto, Patty Thompson in Soul Eater, Natsumi Hinata in Sgt Frog, Lucy Heartfilia and Lucy Ashley in Fairy Tail, Elizabeth Midford in Black Butler, Himawari Kunogi in xxxHolic, Trixx in Miraculous: Tales of Ladybug and Cat Noir, Komaru Naegi in Danganronpa, Minako Aino/Sailor Venus in Sailor Moon, Miyo Sasaki in A Whisker Away, Caeda in Fire Emblem: Heroes, Makoto Niijima in Persona 5, Biyomon and Homeostasis in Digimon Adventure, Shana in Shakugan no Shana, Eucliwood Hellscythe in Is This A Zombie?, Ulala in Space Channel 5: Kinda Funky News Flash!, Chloe Cerise in Pokémon Journeys, Ilia Amitola in RWBY, Yoshika Miyafuji in Strike Witches, Michiru Kagemori in BNA: Brand New Animal, Crystal in Pokémon Adventures, Ayano Kannagi in Kaze no Stigma, Kazari Uiharu in A Certain Scientific Railgun, Kudelia Aina Bernstein in Mobile Suit Gundam: Iron-Blooded Orphans, Mutsuki in Kantai Collection, Suzuha Amane in Steins;Gate, Mika Shimotsuki in Psycho-Pass, AE3803 in Cells at Work!, Syrma in Mugen Souls Z, and Plutia in Hyperdimension Neptunia.\nExternal Links\nAsuna Yuuki on the Pure Good Wiki\nAsuna Yuuki on the Sword Art Online Wiki\nNavigation\n Heroes\nMain Heroes\nKirito |\nAsuna\nAllies\nKlein |\nPhilia |\nSilica |\nPina |\nLisbeth |\nYui |\nAgil |\nLeafa |\nSinon |\nRecon |\nSachi\nMother's Rosario Arc\nYuuki Konno †|\nSleeping Knights\n(Siune |\nJun |\nTecchi |\nTalken |\nNori)\nOriginal Scale\nYuna\nAlicization Arc\nEugeo †|\nAlice Zuberg |\nTiese Shtolienen | \nRonye Arabel |\nCardinal †|\nIntegrity Knights\n(Bercouli |\nFanatio |\nDeusolbert |\nScheta |\nDakira |\nRenly |\nEldrie Woolsburg)"
}