{
  "requested_name": "C.C.",
  "resolved_title": "C.C.",
  "url": "https://codegeass.fandom.com/en/wiki/C.C.",
  "summary": "C.C. (シーツー Shītsū), pronounced \"C2\", is one of the main characters of Code Geass: Lelouch of the Rebellion. She was the leader of the Geass Order before disappearing due to the murder of Marianne and the leader of the Order of the Black Knights until she returned Lelouch's memories. She was also the one who gave Geass to Leila Malcal and Lelouch.",
  "full_text": "C.C.\nC.C. (シーツー Shītsū), pronounced \"C2\", is one of the main characters of Code Geass: Lelouch of the Rebellion. She was the leader of the Geass Order before disappearing due to the murder of Marianne and the leader of the Order of the Black Knights until she returned Lelouch's memories. She was also the one who gave Geass to Leila Malcal and Lelouch.\nHer Japanese voice actress is Yukana while she is voiced by Kate Higgins in the English dub. C.C. is not her real name; she involuntarily reveals her real name to Lelouch in her sleep, but it is muted so the viewers cannot hear it.\nIn the 29th Anime Grand Prix, she was awarded 3rd place. She was chosen as the most popular female character of 2007 and 2008 at Animage magazine's annual Anime Grand Prix. \nAppearance\nC.C. is a slender, fair skinned girl with long, almost waist-length light green hair and golden eyes. She is of average height, being slightly shorter than Kallen. She has a scar under her left breast that resembles a Geass sigil.\nC.C.'s outfits are both plentiful and varied. She is seen wearing a wide assortment of different clothes, often dependent on the situation or the time period. She often wears Lelouch's own clothes, including his Zero costume whenever Lelouch required a decoy.\n \nIn the first season, C.C. primarily wears the outfit she initially appears in - a white straitjacket used to restrain her during her time as a test subject for the Britannian Empire, prior to the beginning of the series. These suits contain many means of restraint, including various straps and zippers, and a high collar capable of gagging the wearer. Not set to fully bind the wearer, the suits have rather long sleeves that flare outwards closer to the cuffs. A number of these straitjackets are seen in the Geass research laboratories. According to the Audio Drama, the reason for C.C.'s common use of the suit is because she feels she is not free. She is seen wearing it through most of the first season and the end of the second season.\n \nC.C.'s predominant outfit in the second season is her Black Knights uniform, which is wildly different from those of the other Black Knights. Rather than the usual Black Knights jacket, C.C. wears a sleeveless black uniform with a high collar, gold trim, and a silver Black Knights symbol on the chest. The lower end of the uniform splits off into four long pieces that nearly extend to the floor. A long, adorned red sash is also worn around the waist. C.C. also wears long black gloves with gold trim kept on with red bands on the upper arms as well as long white and gold high-heeled boots. Underneath her uniform C.C. wears a cropped sleeveless white turtle-neck and white boyshorts. She is often seen wearing only these undergarments.\n \nShe has on some episodes worn the Ashford Academy uniform and has her hair tied in twin-tails. This is done to slightly blend in with the student body so she can move around more freely, to pass messages to Lelouch or just to simply find more pizza.\nPersonality\nThroughout most of the series, C.C. expresses little in the way of emotion or affection, behaving apathetically towards most. She's quickly shown to be stubborn, selfish, and headstrong, as well as possessing high standards, which Lelouch takes note of and teases her about from time to time. Ironically, she claims to hate stubbornness, despite being quite stubborn herself. Though, it appears she notes these qualities to be essential to her sense of self, saying \"That is what makes me C.C.\" in reference to them. She's shown to be pragmatic, focused on fulfilling her \"contract\" with Lelouch, which also serves to show her selfish side. Early on, she was willing to shoot Lelouch to hold him back from meeting Cornelia's challenge to him. In the second season, she suggested that Lelouch use Geass on Nunnally to bring her over to his side. She's also shown to be isolated, preferring to act alone to solve personal matters and being quite snarky and dismissive towards most people. C.C. can also be very secretive, to the point of being on par with Lelouch, albeit much less coordinated than the latter.\nAlthough, despite her icy demeanor, C.C. appears to be something of a philosopher. In multiple conversations with Lelouch, she muses about human nature and conflict, seeing human history as a long line of struggle, this belief being deepened by her life experiences. C.C., despite not living by it, sees the idea of \"survival of the fittest\", which Britannia lives by, as a simple enough way of life to follow. Over time, she's revealed to hold a strong belief in the idea that life requires purpose and focus in order to be called life. She comes to understand Lelouch's desire to find purpose in life and his connection to Nunnally as his reason for living. In the Japanese version, she calls Nunnally her brother's \"raison d'etre\", French for \"reason for existence\". However, at the same time, due to her tumultuous life, C.C. has grown highly cynical about the nature of life itself. She came to see death as the definitive proof of life itself, as it shows that life can come to an end. She believes that without death, life cannot be called \"life\", but rather, it is merely experience, an accumulation of memories and actions. Additionally, she sees the events of accumulation to be \"worthless illusions\".\nNonetheless, C.C. also possesses some positive thoughts on life as well. One recurring topic she comes to discuss with Lelouch is the nature of love. In her childhood, her greatest desire was to find genuine love and kindness from others, which served to produced her original Geass power. Though, she has grown cautious about the idea of love due to her experiences. She sees love without limit to not be love at all, and distances herself from others in order to avoid feeling pain as all those who had genuinely loved her in the past had faded from her life. When Mao appears in the first season, just before she executes him, C.C. confesses to him how, even though she was using him, she'd genuinely developed love for him. Concurrently, C.C. is also shown to, in rare cases, show sympathy towards others she relates to. She sympathizes with Lelouch's insistence on pursuing purpose in life, Mao's desire for love and acceptance, and Suzaku's desire for death, as all of these are traits she shares.\nMore notably, C.C. does express genuine kindness towards others, in rare cases. She mostly does so when in the presence of Lelouch. She allows Lelouch to confide in her and actively listens to his thoughts and concerns. She shows something of a more playful side towards him, teasing him multiple times about his flaws with Lelouch responding in kind. She's also shown to be somewhat more positive around Nunnally and Kaguya, seeing both girls as being genuinely kind individuals. She was also openly shocked upon learning Nunnally survived the first F.L.E.I.J.A. attack. On a more serious level, she shows open respect to those who meet her high standards, namely Kallen, acknowledging her strength and her convictions, and Suzaku, after the two of them choose to join forces with Lelouch. In Suzaku's case, she appears to show some deference to him after they form an alliance, telling him in private \"We do things as you like\", and accepting when he calls himself and her respectively Lelouch's \"sword\" and \"shield\". C.C. also demonstrates a potentially strong sense of loyalty as well, being one of the few people to remain by Lelouch's side throughout the entire series. This loyalty appears to stem not just out of their contract, but also genuine respect towards him.\nWhen she lost her memories, she regresses to how she was hundreds of years ago, fearful and open. During this time, C.C. is shown to be, in a sort of twisted sense, comforting and kind. She actively tries to comfort Lelouch, whom she saw as her \"master\", when he's feeling distressed, and shows no kind of anger of disdain towards others. She also seems to understand the idea of pain and heartache, revealing that, when she was young and ever felt sad or cold, she would deliberately injure herself as a coping mechanism, in order to distract herself from the pain she feels inside. She feels that external pain is always better than internal pain. However, when she regains her memories, her personality reverts back. When this occurs, while in C’s World, C.C. seems to reveal a growing sense of morality as well. She comes to see the Ragnarök Connection as a presumptuous plan, and rejects Charles and Marianne along with Lelouch after realizing that the two royals were ultimately selfish and only loved themselves. Even more importantly, deep in her heart, C.C. is shown to be capable of remorse and regret for her actions. She admits to Lelouch about feeling conflicted with using Mao, a very young and disadvantaged child, as a pawn. When Suzaku called Lelouch C.C.'s \"accomplice\", C.C. seemed to briefly question this for the first time, showing that her feelings were changing. Before the series' final battle, she also asked Lelouch if he hated her, due to how her giving him Geass affected his life, showing how she had developed remorse for involving him in her tangled life.\nFurthermore, it is implied that at the end of R2 C.C. has fallen in love with Lelouch. Kallen suspected this to be the case and questioned her on it, which made C.C. unusually flustered. Backing this up is that C.C. never made Lelouch take her immortality per their contract and she was worried that she altered his fate. By the end of the season 2, due to her experiences with Lelouch and those around him, C.C.'s outlook on life significantly improved. She appears to have grown more positive and hopeful about the state of humanity and the world, supporting Lelouch in completing the Zero Requiem and his attempts to improve the world. The most important thing is that it seems that C.C. has overcome her desire to die and regained her will to live, possibly due to the promise that Lelouch made her (Lelouch promised to make her smile by fulfilling her true wish). \nAfter C.C.'s true wish finally comes true when Lelouch fulfills the promise he made, it can be seen that C.C. has opted for a happier, more optimistic and mocking attitude. \nCharacter Outline\nC.C. is immortal, healing from any kind of wound (implied to include beheading) with enough time. She also doesn't age. Apart from her immortality, C.C. has the ability to bestow people with the power of Geass, which manifests differently in each person but generally carries the ability to affect the minds of those it is used on in some way. A Geass sigil appears on her forehead whenever she manifests this power, and she has a similar scar on her left breast. Her powers caught the interest of Britannia, who imprisoned her for experimentation purposes.\nIn the first season finale, C.C. triggers a trap set by V.V., causing herself and Lelouch to be submerged in a shock image sequence similar to the one she used on Suzaku. Through this, Lelouch sees memories of her past, including repeated \"deaths\". One shows C.C., who was a nurse at that time, attempting to escape from a World War I-esque battlefield, only to be shot in the forehead. Further memories show her being persecuted as a witch and suffering various forms of torture and/or execution throughout history and various time periods, including burning at the stake, guillotining, and the iron maiden. This would suggest a minimum lifespan of at least five centuries. In a special feature included in the series' fifth DVD, she and Lelouch discuss Washington's Rebellion, a failed version of the American Revolution, during which she speaks of participants such as George Washington and Benjamin Franklin as if she had been close friends with both. In the past, she appears to have observed Suzaku and Lelouch when they were both children, having even interacted with Lelouch at one point, though he doesn't remember their meeting.\nHer individual experiences have led C.C. to become a detached and lonely individual, with little care for even those she has entered into contracts with. She tells Lelouch that she has been alive so long that she can no longer remember who loves her and who hates her. Due to her nature and history, she has been lonely as long as she can remember. Lelouch replies, \"You're not alone. We are partners. If you are a witch, then I am a demon.\" Lelouch is possibly the first person that has ever truly cared for her and it appears that she reciprocates at least some of these feelings, as she unexpectedly kisses him after their memories are shared. This is also seen in the second season, as she kindly teases him more often. However, she claims that she has been selfish, keeping Lelouch alive just so that she could be able to die. In episode 23 of the second season, Suzaku asks her to be Lelouch's shield, defending him from his enemies while Suzaku strikes down those enemies as Lelouch's sword.\nC.C. is willful almost to a fault, usually doing whatever she wants regardless of whether or not it inconveniences others, particularly with Lelouch. In episode 5, she purposely makes use of her contract to make it sound like it was an engagement in front of Nunnally and in one Sound Episode, she said to Nunnally that both she and Lelouch are 'busy' making Nunnally misunderstand.\nWhen left alone, she has sometimes spoken to a previously unknown person through means unknown, which, in episode 23, was revealed to be Marianne, Lelouch's \"deceased\" mother, although in episode 19 it appears that she is talking to V.V. as well. According to the DVD Magazine 02, she is talking to more than one person when she seems to be talking to herself.\n \nC.C. also has a somewhat obsessive penchant for pizza, especially Pizza Hut's Cheese-kun (which sponsors Code Geass in Japan); she constantly orders pizzas to Lelouch's house using his credit card, much to his chagrin. This is often used for comedic effect. Her love for pizza is so strong that she is willing to risk herself being captured, twice nearly exposing herself to get a piece of a giant pizza being made by the Student Council (which is ruined both times); both Lelouch and Kallen sometimes refer her as \"Pizza Girl\". In addition to this, she is an avid collector of Cheese-kun related merchandise and is often seen hugging a Cheese-kun plush doll.\nCharacter History\n\nFirst Season\n \nC.C. makes her first appearance at the beginning of the first episode of the series, watching a ten-year-old Lelouch and a ten-year-old Suzaku observing the Britannian Military as they enter Japan.\nC.C. is introduced when Nagata opens the capsule that supposedly contains poison. Suzaku quickly puts his own gas mask on Lelouch's face, but to their surprise, a restrained green-haired woman, C.C., emerges out of the capsule. Before they can get answers, Suzaku's superiors come and tell him not to question his briefing, and to shoot the \"terrorist\", Lelouch. When he refuses, he is promptly shot in the back. Lelouch and C.C. take the opportunity to escape. Just as they seem to have evaded detection, Lelouch's phone rings, giving him away. As they're about to kill him, C.C. jumps in front and is shot in the forehead. A desperate Lelouch now thinks of his impending death. He is grabbed by the hand by C.C., who proposes a contract that would allow him to live and endow him with Geass, the power of kings. She then supposedly dies.\nShe unexpectedly reappears in the fifth episode, casually folding origami with Nunnally. From this point on she passively oversees Lelouch's missions as Zero, wanting to keep him alive so he can fulfill his contract.\nUnknown to Lelouch, Cornelia sets a trap for Zero at the Saitama Ghetto by simulating the conditions in Shinjuku Ghetto. Despite C.C.'s warnings, Lelouch takes the bait and goes to the aid of the Saitama resistance. In order to save Lelouch, C.C. dons his Zero costume and distracts the Britannian Army, allowing him to escape. Lelouch blames his defeat on the undisciplined rebels and tells her that he will resolve to build something far better than a mere resistance unit, first an army, then \"people,\" and finally a nation.\nC.C. was called to Clovisland by Mao, at first she was stopped by Lelouch. She tells him that she will go back to Mao. Lelouch asks if she is betraying him, which C.C. responds that she was never his friend, just a collaborator. He continues saying that she knows too much about him. He commands C.C. to stay by his side and not leave by using his Geass power but it fails due to C.C.'s immortality and code. She promises him that she will not reveal anything about his identity and tells Lelouch that when she's gone, all his obstacles will disappear too.\nNot wanting to let her leave, Lelouch goes to Clovisland and uses a recording to distract and make Mao fired up when he hears that C.C. is Lelouch's partner. Lelouch uses his Geass power on the police to shoot Mao, allowing Lelouch to rescue her. After she is out of harm's way he then makes a contract with C.C., promising he will grant both his own and C.C.'s wishes to fulfill the contract that Mao failed to. C.C. gladly accepts this through a handshake.\nWhen C.C.'s existence is revealed to the Black Knights, she gains considerable unofficial standing, as she is seen by other members to be one of Zero's closest advisers. However, her willful attitude and lack of an official posting annoy some veteran members and cause confusion as to her role within the Black Knights. At one point, Tamaki goes so far as to falsely accuse her of being Zero's mistress. When the Black Knights gain possession of the Knightmare Frame Gawain, she becomes its pilot while Lelouch operates the weapons.\n \nIn the season finale, she uses the Gawain to battle Jeremiah Gottwald's Siegfried so Lelouch can save his sister. She then kisses Lelouch to his surprise before bringing him to safety. After Lelouch is out of harm's way, she is seen dragging both Jeremiah and herself to the ocean floor to end the battle while narrating that the spark of Lelouch's actions was the core of human motivation: the desire for just a small amount of happiness. According to Yukana in a conference memo, C.C. was crushed by the water pressure, but managed to come to the surface; it is stated that it was too gruesome to show on TV.\nAkito the Exiled\nIn a flashback, it is shown that shortly after the assassinations of her parents Bradow and Claudia von Breisgau, Leila ran into the woods to escape, but falls through a frozen pond. She is rescued by someone who appears to be a nun wearing a white tunic and veil but is revealed to be C.C. Rather than enter a full contract with her, Lelia is given a fragment of Geass that would fade if she did not use it before adulthood.\nSecond Season\nAt the start of the second season, C.C. appears to be commanding the Black Knights. She along with Kallen, Urabe, and the remaining Black Knights initiate an operation to unlock Zero's memory that was sealed away by the Emperor of Britannia. Despite the Intelligence Agency having followed Lelouch in anticipation of that exact outcome, she is successful in restoring his memories through an unexpected kiss. She takes up her old position following this.\n \nShe is revealed to have formerly led the Geass Directorate, a secret organization that studies and produces Geass users. V.V. succeeded C.C. as the leader and relocated the headquarters to somewhere in the Chinese Federation. Lelouch leaves her to find its exact location down while he returns to Japan. After pinpointing the location of the Geass Directorate, Lelouch orders C.C. to lead the attack against it. She also reluctantly kills V.V.'s direct subordinates when they attempt to escape by bullet train in order to bury the existence of Geass.\n \nHer past is revealed to Lelouch after he is transported to the Sword of Akasha to face the Emperor. She also reveals that he would have become immortal had he been able to take her code, rendering her mortal and thus granting her wish, which is to die and spares him by offering her life to the Emperor. Lelouch refuses to let her die unhappy and rescues her, telling his father that he would not let him take her away from him. Afterwards, she regains the will to pursue the life she wishes, thus C.C. decided to bet her hopes on sealing away her own Code, losing her memories of Geass and reverts to her personality as it was before she came under the contract that ultimately bestowed immortality upon her.\n \nFollowing her memory loss, C.C. remains in Lelouch's quarters, believing him to be her master. When Lelouch's identity is revealed to the Black Knights and Rolo is forced to take him to safety, leaving C.C. behind. Marianne, possessing Anya Alstreim's body, locates C.C. and awakens her memories. The two then leave for Kamine Island, rescuing Suzaku along the way. Marianne enters the Sword of Akasha, while C.C. stays behind to speak with Suzaku. She reveals that Suzaku and herself are similar, as both have a death wish they cannot fulfill. Suzaku denies this and has C.C. take them to the Sword of Akasha, allowing the Emperor to begin Ragnarok. When Lelouch turns the tables and the collective unconsciousness of the human race destroys Charles and Marianne, C.C. is spared because she had long turned against their plan.\nShe is aware of Lelouch's plan after becoming the Emperor and is shocked to learn that Nunnally is alive. C.C. later comforts Lelouch when he is troubled about what to do about Nunnally. Later she is seen rendezvous with Lelouch, but their conversation is soon interrupted by Kallen. Kallen attacks the Avalon with the Guren almost successfully killing Lelouch before C.C. intervenes in her Lancelot. She engages in battle against Kallen who asks her if she loves Lelouch; she responds by saying that she does not know before Kallen quickly defeats her. She ejects to safety, surprised that she even cares about winning or losing. During Lelouch's planned assassination, she prays for him at a church, shedding a single tear while commenting on the price he's paying for using Geass on others.\nDuring the epilogue, C.C. is seen traveling the countryside in the back of a cart with Cheese-kun and the origami she and Nunnally made. She talks about how the Geass is supposed to bring loneliness, yet Lelouch proved this wrong. Knowing that Lelouch did not hate her for giving him the Geass, she is now able to show her true feelings, and with the realization of \"Zero Requiem\", her time with Lelouch, who was able to forgive and accept her, came to an end, but the memories created with him has, without doubt, saved her from eternal loneliness. The final shot is one of a pink paper crane, representing the wish for a gentle world, Zero Requiem, offering comfort to C.C while heading to an unknown location.\nDuring the remade epilogue from 2009 C.C. directly addresses the viewer, saying that she mourns Lelouch's death but that knowing he died with a smile because he achieved his goals with the Zero Requiem comforts her while heading to an unknown location.\nLelouch of the Re;surrection\nFurther on it is revealed that C.C. actually headed to Jeremiah's location to retrieve Lelouch's corpse that Jeremiah had previously recovered (Shirley in the movies' timeline) and discovered that Lelouch had somehow obtained an incomplete Code of Immortality. However, although his body had returned to life and Lelouch no longer aged, his mind had not been restored.\nAt this point C.C. becomes Lelouch's caretaker while she searches for a Thought Elevator to use to travel to C's world to complete Lelouch's resurrection. On her trip CC meets Kallen, Lloyd and Sayoko again, Kallen gets angry with C.C. when she discovers Lelouch's unfortunate state and that C.C. revived him just so that he would fulfill the promise that Lelouch made to her (Lelouch promised C.C. to make her smile by fulfilling his true wish) and discusses that C.C. was selfish by reviving Lelouch.\nC.C. finally manages to access C's World only to discover that the souls are frozen in place, with a dark orb containing the consciousnesses of Charles and Marianne, C.C. approaches the orb which causes the Collective Consciousness to attempt to destroy Lelouch. C.C. tries to rescue him, but she is expelled from C's world without realizing that she has successfully returned Lelouch's memories with the help of Shirley, Euphemia and Rolo (who, although dead, were still active in C's World).\nHaving returned to life Lelouch saves C.C., Lloyd and Sayoko using his Geass that he can still use despite having a Code (Code of Immortality) confirming that he is a \"Failed One\" (an almost immortal being that no longer ages but can still use his Geass), he also saves Suzaku who almost beat him to death for thinking that Lelouch had lied to him about being alive only to be stopped by C.C. telling him that she had revived him out of her own selfishness.\nAfter escaping from the Wailing Prison (the place where the Elevated Thought was located) Lelouch again assumes the mantle of Zero and reunites with Cornelia accompanied by some members of the Order of the Black Knights, Lelouch surprises them all by taking off the mask and begging for his help to rescue Nunnally. Furthermore, stating that she will no longer lie, as she has no need to now that the world is a better place, Cornelia agrees and gives full control of her forces to Lelouch.\nLelouch uses his limited forces and his Geass to rescue Nunnally, despite the odds of facing 12,000 troops guarding Gralbahd, while his strategy was impeccable and successful, it ultimately failed due to Shamna's Geass. With a complete failure, Lelouch almost froze with his wounded pride and almost gave up. Fortunately, CC makes Lelouch see reason by telling him how she, despite everything, never gave up on her goal of completing her resurrection and he is able to regain control of the situation.\nAfter recovering, Lelouch defeats Shamna and uses his artificial Thought Elevator with the help of C.C. to travel to the C's World to rescue Nunnally, while C.C. goes to talk to Shamna about her current situation and the fate that awaits her. She is later seen using the Gekkoei Sui to carry Lelouch and Nunnally's bodies to safety (where she meets up with most of her allies) where moments later Lelouch and Nunnally return from the C's World only to witness several Shamna Geass fragments falling across the world. After the mission's success, Lelouch tells Nunnally and Suzaku that he cannot stay despite their insistence and returns the role of Zero to his best friend.\nAfter recovering, Lelouch defeats Shamna and uses his artificial Thought Elevator with C.C.'s help to travel to the C's World to rescue Nunnally, while C.C. goes to talk to Shamna about her current situation and the fate that awaits her. Later she is seen using the Gekkoei Sui to take the bodies of Lelouch and Nunnally to the agreed location, where moments later Lelouch and Nunnally wake up after managing to return from the C world (in the timeline of the films Lelouch wakes up a few days later and CC asks for help to transport the bodies of Lelouch and Nunnally).\nAfter the main allies gather at the agreed location, fragments of Shamna's Geass are seen falling all over the world. Some time later, CC is seen trying to leave unnoticed while Lelouch tells Nunnally and Suzaku that he cannot stay despite their insistence and returns Zero's role to his best friend.\nLelouch stops C.C. from leaving without warning and tells her that he plans to join her on her journey. He consolidates his decision to stay with her by saying that he will change his name to L.L., an indirect marriage proposal and the two are seen holding hands leaving Zilkhstan, making it understood that Lelouch fulfilled the promise he made by making C.C.'s real wish come true. (which was having an eternal companion who truly loved her and who would always be with her). \nIn a later scene, we see C.C, and Lelouch (now going by L.L.) are seen wearing wedding dresses and with Lelouch giving a dialogue that makes us understand that they are still together and that they persecute Geass users around the world and eliminate them if they do not have the will to use Geass responsibly.\nRoze of the Recapture\nOn an island C.C. is seen asking L.L. why he gave Sakuya Sumeragi a Geass, speculating that it was either for fun or because she was Kaguya's relative. Lelouch admits that he isn't sure, before clarifying that he and C.C. exist outside the normal flow of the world and they shouldn't get involved going forward.\nAbilities\n\nCode of Immortality\n \nC.C. is an immortal \"witch\", neither suffering from age nor capable of being killed by conventional means. She has been shot fatally a number of times, been crushed by water pressure, burned at the stake, subjected to the guillotine, placed in an iron maiden, and stabbed by spears all of which she recovered from, but still suffers the pain. It is later revealed that her Immortality works like a biological back up system, where normally infinite body parts and sections are replaced via C's world and new replacement parts are continously created. However with C's world no longer having its god, the production of her back up-replacment body parts is no longer being continued. Leaving C.C. with what ever is left, hence she could now die permanently when she eventually runs out of replacements. However the sheer number of parts left over could possibly mean that this would take forever. \n \nC.C. has the ability to bestow people with the power of Geass, which manifests differently in each person but generally carries the ability to affect the minds of those it is used on in some way. The Geass sigil glows on her forehead whenever she manifests this power, and she has a similar scar on her left breast. This scar correlates with the wound she received when she was attacked by the nun that gave her the Code.\nHer Code allows her to detect people who are connected to Geass and people who are important to them. It allows her to detect the location of her own contractors, even at a distance, and confirm who possesses a Geass power and who does not, regardless of whom granted it to them. She could detect that Nunnally was on Kamine Island because she is the center of Lelouch's life.\n \nWhen in close proximity to another person, C.C can afflict them with a hallucinatory experience of chaotic and ominous images, pertaining in part to the memories of the target involved; the content varies with the afflicted. Physical contact, either directly or via a Knightmare Frame, may facilitate the process. Suzaku is shown images of his father (whom he murdered) as well as parts of C.C.'s memories, driving him into a panic. In another instance, Anya is shown images of Lelouch's childhood, causing her to freeze in wonder until contact was severed. It tends to activate involuntarily at various points, such as when Lelouch's Geass becomes permanently active. This effect is described as 'a merging of consciousness'.\nTelepathy\nC.C. can telepathically communicate with Marianne vi Britannia. Whether this is an ability resulting from C.C.'s Code, Marianne's Geass, or Marianne's state of un-death (and, as a result, being \"near\" the Collective Unconscious) is unknown.\nGeass (Formerly)\n \nBefore becoming immortal, C.C.'s Geass, as contracted with a nun during apparently medieval times, granted her the power \"to be loved,\" which allowed her to make anyone around her love her. She originally started with a Geass symbol in her left eye, but as she matured, she eventually developed another in her right, implying that she became unable to control it, causing everyone to love her. After C.C. had become bored by the tranced society around her, the nun who had bound the Geass contract to her revealed she had tricked C.C., severely injuring her. C.C.'s only option to survive was to accept the nun's Code and its immortality. Losing the Code, the nun became mortal again, allowing her to commit suicide, and, as part of the exchange, C.C. became immune to the effects of Geass while losing her own Geass. Her Geass sigil/mark is located on her forehead, glowing red when activated.\nOther Abilities\nC.C. is a capable leader, able to rescue Lelouch from Britannian traps, handle firearms with some proficiency and seems to be a skilled unarmed fighter as well. She is also an accomplished Knightmare pilot, able to pilot both standard Knightmare Frames as well as co-pilot the Gawain with Lelouch. When she is forced to pilot the Gawain alone against the Siegfried, she proves skilled enough to pin and trap the Siegfried despite the machine being more powerful and more maneuverable than the Gawain. In the second season, after Lelouch returns to the Black Knights, she receives an Akatsuki Command Model Zikisan, normally reversed for commanders of the Black Knights. For the Battle of Mt. Fuji, she receives a copy of the Lancelot called the Lancelot Frontier.\nRelationships\n\nDash\nHer feelings for Dash are quite hostile and may almost relate to Lelouch, but it is still unknown as Dash only looks like Lelouch and he knows a lot about her. But they do share some bits of respect for each other and rather strained and sympathetic feelings for each other.\nLelouch vi Britannia\nC.C. is Lelouch's second in command and his 'Accomplice', the young former prince being her latest contractor in her quest to achieve death. At first, C.C. does not have a very high opinion of Lelouch, seeing him as a \"self-righteous jerk\", as well as arrogant and stubborn. She also calls him a \"sore loser\" after the Saitama Ghetto Ambush, after he attempts to excuse himself for falling into Cornelia's trap. Though, at the same time, she teases that with his intellect, he should be able to set the battle conditions as he must, which could be interpreted as a back-handed way of encouraging him to improve so that he’ll have a better chance of surviving. She also takes plenty of opportunities to tease Lelouch on his flaws and insecurities, including his arrogance and worries regarding Nunnally, even saying he has a \"sister complex\".\nEven so, C.C. and Lelouch gradually develop a rock-solid, lasting bond with one another. Early on, despite her low opinion of him, C.C. quickly acknowledges and comes to respect Lelouch's intelligence and cunning. She also understands and sympathizes with Lelouch's desire to find purpose in life, due to desiring the same herself. Over time, C.C. becomes Lelouch's confident as well, allowing Lelouch to drop his masks around her, and becoming the only one Lelouch fully lets his guard down around. At the same time, C.C. is shown to be at her most comfortable and positive around Lelouch, as evidenced by her tendency to tease him and giving him genuine smiles. When she restored his memory at the start of the second season, she immediately smiled upon hearing a snarky remark from him, showing how she was happy to see him again.\nMore importantly, Lelouch is one of the few to show her kindness and that she is not alone, which helps her to rediscover her emotions and slowly become more positive. After the Battle of Narita, Lelouch sincerely thanks her for rescuing him in Saitama. At the same time, when he responds to her thoughts on snow, he claimed it was beautiful and that he didn't dislike it, indirectly telling her that he bore no ill will towards C.C. despite her attitude. Towards the end of the first season, when Nunnally was threatened, C.C. immediately warned Lelouch about it, understanding how she was Lelouch's reason for living. Lelouch demonstrated how he had grown to care about her by resolving to remain at her side, even after seeing her ghastly memories. Conversely, C.C. showed Lelouch genuine lasting loyalty, becoming one of the few people to remain by his side during the entire duration of the series. At first, this loyalty stemmed from her desire to fulfill their contract, but later became more genuine and respectful as the two bonded with one another. When she leaves him at the end of the first season, she gives him a kiss in gratitude, urging Lelouch to persevere over the obstacles of his past with Lelouch, in turn, urging C.C to survive.\nWhen Lelouch was first pulled into C's World, even though C.C. knew how Charles could now fulfill her desire for death, she still demonstrated loyalty towards Lelouch. She actively urged him to kill her and take her Code, saying that he'd be able to stop Charles for good if he does so, and in doing so, prove his reason for living. When Lelouch refuses, C.C. chooses to spare him by sending him away, calling him \"too soft-hearted\", acknowledging how he was truly a kind person, but felt that he could not fulfill her \"wish\". C.C. was subsequently shocked when Lelouch deduced her true \"wish\": to find genuine love and happiness, noting how she could've forced Lelouch to take her Code, like how C.C. had received her Code in the first place. Lelouch proclaimed that he would fulfill her true \"wish\" and show her happiness, even if that meant killing her in the end if she so desired it. Touched by Lelouch's feelings, C.C. rejected Charles and set Lelouch free, allowing him to pull her from C's World and back to Earth.\nAfter the Ragnarök Connection was stopped, it appeared that C.C. and Lelouch's relationship may have soured somewhat due to how Lelouch discovered the complete truth of her actions, as well as the rage he felt in putting an end to his parents' machinations. When she repeats his words about facing death with a smile, Lelouch looked toward her in disdain. When they returned home one month later, however, it seems that the two had reconciled during their absence in C's World. After Nunnally was revealed to be alive, C.C. said that she was impressed by how Lelouch kept his composure in front of her. She then, in a previously-unseen gentle manner, asked Lelouch if he had felt that he had done enough, acknowledging that he had handled himself and his difficulties quite well. When Lelouch tells her that their goal is incomplete, C.C. comforts him, being wholly understanding of his reasons for the Zero Requiem and resolving to remain his ally until the end.\nIn their final conversation, C.C. fully acknowledges Lelouch's concern for her well-being. She then asks him if he had actually come to hate her, citing how his life had changed so drastically due to her giving him the power of Geass. Lelouch then gently assures her that he doesn't hate her, further stating how all C.C. did was open the path to his destiny through Geass. Meanwhile, everything that followed was Lelouch's decision. Touched by his gratitude, C.C. admitted that in all her years, she had never met a man like Lelouch before. As Kallen attacks them and CC stops her, she tells Lelouch to fight and win, reminding him that Lelouch told her he would make her smile, and Lelouch promises to do exactly that. In the final episode of the season 2, at the climax of the Zero Requiem, she prays and cries for Lelouch, accepting that he will soon die. After the Zero Requiem, CC reflects on how he was wrong about thinking that Geass doomed its users to loneliness, thanking Lleouch for giving him back the will to live as he heads off to an unknown location.\nIn the future it is revealed that she was heading to meet Jeremiah (Shirley in the movies) to revive Lelouch as she could not bear to lose him and her intention was to revive Lelouch so that he would fulfill the promise he made to her (Lelouch promised to make her smile by fulfilling C.C.'s real wish). When C.C. finally managed to enter the C's World, she faced several human consciences with the sole purpose of reviving Lelouch, showing how important he was to her. Lelouch, who was in the C's World with no desire to return to life, meets C.C. again and, seeing the state demonstrating everything that happened to meet him, Lelouch decides to revive himself while shouting C.C. \nC.C. seeing that she finally managed to revive Lelouch is shocked and then smiles with tears as she shakes Lelouch's hand and during their confrontation against Shamna C.C. tells Lelouch how painful it was for her to see him incomplete and how she never gave up on bringing him back to life. After defeating Shamna Lelouch stops C.C. from leaving without warning and tells her that he plans to join her on her journey. He consolidates his decision to stay with her by saying that he will change his name to L.L., an indirect marriage proposal and the two are seen holding hands leaving Zilkhstan, making it understood that Lelouch fulfilled the promise he made by making C.C.'s real wish come true. (which was having an eternal companion who truly loved her and who would always be with her). In the manga Lelouch picks up C.C. with Gekkoei Sui instead who propose to her in the sky. In a later scene, we see C.C, and Lelouch (now going by L.L.) are seen wearing wedding dresses and with L.L. giving a dialogue that makes us understand that they are still together and that they persecute Geass users around the world and eliminate them if they do not have the will to use Geass responsibly.\nSuzaku Kururugi\nAt first, Suzaku and C.C. had few major encounters. At the end of the Battle of Narita, C.C. used her power to telepathically shock Suzaku's mind, causing him to remember about his father and subconscious death wish. It's implied that she had some respect for Suzaku's skill as a warrior, while noting his reckless nature at the same time. Following the Second Battle of Tokyo, C.C. and Suzaku finally met face-to-face at Kamine Island. Suzaku was one of the few people that C.C. showed genuine sympathy towards. She sympathized and related to his death wish and inability to die, having a death wish of her own and being incapable of death due to her immortality. Suzaku, due to her mental attack on him, called C.C. irresponsible, causing her to tease him by asking him if he enjoyed having others look into his thoughts.\nWhen C.C. revealed how she was using Lelouch, Suzaku asked if she had any regrets. C.C. immediately said that she didn’t, claiming that she had abandoned her humanity. Upon hearing this, Suzaku claimed that he and C.C. weren’t as alike as she thought before asking her to allow him into C’s World. Following the foiling of the Ragnarök Connection, over the course of a month in C's World and before their return to Earth, C.C. formed an alliance alongside Lelouch and Suzaku to complete the Zero Requiem. During the execution of the plan, C.C. appeared to show genuine respect and even some deference towards Suzaku due to their alliance. When Suzaku called himself and C.C. Lelouch's \"sword\" and \"shield\" respectively, C.C. seemed to accept this assessment, telling him \"We do things as you like.\" At the same time, C.C. appeared to briefly question herself when Suzaku called Lelouch her \"accomplice\".\nKallen Kōzuki\nDuring her time in acting as part of the Black Knights, due to her unofficial high status, C.C. came to spend a significant amount of time with Kallen. Following Kallen's discovery of Lelouch's identity as Zero, she became one of the few people that C.C. revealed her status as an \"immortal witch\" to. Due to their headstrong attitudes, as well as C.C.'s selfish and secretive nature, the two did not have an easy connection. While the two of them never seemed to establish a full-fledged friendship, they appeared to have genuine respect towards one another and were able to work well together as allies within the Black Knights. During the Battle over the Pacific, C.C. silently urged Kallen to survive and rescue Lelouch. C.C.'s playful side also emerged around Kallen as well, with the two of them giving light teases and snark to one another at times, similar to her time with Lelouch. Kallen even gave her the nickname \"Pizza Girl\", to tease the immortal over her love of pizza, which C.C. didn't seem to mind at all.\nOn a more serious level, C.C. openly shows respect towards Kallen's strength and ferocity in battle, as well as her focus on her convictions. During the Battle of Mt. Fuji, Kallen criticized C.C., claiming that she had no reason to fight. C.C. countered that she did, in the form of a promise to Lelouch. When C.C. admitted that she felt it was time for her to start truly living again, Kallen appeared to acknowledge this, claiming that she almost sounded \"human\" now. When C.C. is defeated by Kallen, she takes the time to congratulate her on her strength and victory. Kallen dismissed this, saying that it didn't matter to her before merely saying goodbye to her, implying that Kallen felt no real disdain towards C.C., even after things had gone so awry. As Kallen left her, C.C. gave a genuine smile, recognizing how Kallen had reawakened in her feelings of \"winning or losing\", implying that she felt genuine gratitude towards Kallen for this.\nAfter meeting again in Zilkhstan, their relationship was seen to have improved as they helped each other outwit their pursuers, but it got worse for a moment when Kallen became angry upon realizing that C.C. was responsible for Lelouch's sorry state by reviving him, and her anger increased when she discovered that C.C. revived him in order to make Lelouch fulfill the promise he made (Lelouch promised to make C.C. happy by fulfilling her true desire) to the point of threatening C.C. with a knife, calling her selfish, only to be stopped by an Lelouch (incomplete). But their relationship improved again when Kallen calmed down and apologized to C.C. for what she did.\nWhen they arrived at the Thought Elevator Kallen had already regained her trust in C.C. as she entrusted Lelouch (incomplete) knowing that she would finally complete her resurrection. And at the party before the battle Kallen showed her maturity by encouraging C.C. to tell her feelings to Lelouch knowing that being with Lelouch would make C.C. happy and when C.C. wanted to leave Kallen asked her if she could stay, something that C.C. denied. \nQuotes\n(To Lelouch vi Britannia) \"If I grant you power, could you go on? I propose a deal—in exchange for this power, you must agree to make my one wish come true. Accept this contract, and you accept its conditions. While living in a world of humans, you will live unlike any other: a different providence, a different time, a different life. The Power of the King will condemn you to a life of solitude. Are you prepared for this?\"\n(To Lelouch vi Britannia) \"I said that Geass was the Power of the King which would condemn you to a life of solitude. Heh. I think maybe that's not quite correct. Right, Lelouch?\"\n(To Lelouch vi Britannia) \"Lelouch, do you know why snow is white? Snow is white because it's forgotten what color it's supposed to be.\"\n(To herself) \"False tears bring pain to those around you. A false smile brings pain to oneself.\"\n(To Lelouch vi Britannia) \"My wish is to die.\"\n(To Leila Malcal) \"Do you want to live? If you had power, you could live? I'll make a deal with you. Accept this contract, and while you live in the world of humans, you will live, unlike any other human. A different providence, A different time, The power of king will isolate you. If you are prepared for it, then use that power. But you are still a child. I will give you time until you reach adulthood to make your choice. Once you use it, there's no turning back. But if you do not, it will cease to exist.\"\n\"From the entire beginning, I should have warned you. That the power of the king would isolate you. You will lose your friends, become different from your childhood friend, and you will be betrayed by your subordinates. Your parents will vanish from your sight, your siblings will disappear like dew. Yes, it's terribly burdensome. And pitiful. Now, your sole companion is solitude. There is nobody who will embrace you, who has been smeared in blood. Rocks have been pelted at you by many, and as retribution, you trampled over them. At that time, nobody noticed that the shriek that was secretly welling up inside your heart. Yes, it's pitiful. Seeing that visage, my wounds often throbbed. Now, I think you to be dear because you are miserable. As the pain kept stabbing your tender heart, why does this feeling of solitude gradually heal? The whole world is pelting rocks at you, showering you with insults. That is something the I have experienced from this world. Without realizing, you have shared me in my solitude. Without knowing, you shouldered my sins. It's as if you are poisonous amaryllis blooming from the ground. Only I know of its elegance.\" - Character Poem\n\"A young man dies. He had the power to change the world, to create a new order. The world feared him, hated him. But, I know he died with a smile on his face. Only those who have realized their dream will truly understand that feeling of utter contentment. So, this is not a tragedy. And whenever I feel sad or cry at night, I sing a song. A song of man's making. Zero Requiem!\" - C.C. during the remade epilogue from 2009\n\"There are times in life when you have to distance yourself from those you love, because you love them.\"\n\"In this world, evil can arise from the best of intentions. And there is good which can come from evil intentions.\"\n\"In their heart, everyone has faith that their victory exists. However, in the face of time and destiny, the act of faith is fruitless and fleeting at best.\"\nTrivia\nAmber from \"Darker Than Black\" resembles C.C., as both are mysterious girls who have an unknown connection to the main characters of their respective series (Hei and Lelouch).\nIn R2, C.C. added two horns on her Ashford Student disguise, which make her resemble Chachamaru Karakuri from the \"Mahou Sensei Negima\" series.\nC.C's English Voice Actor, Kate Higgins, did female leads in other series as well, including Sakura Haruno from \"Naruto\" and Saber from \"Fate/stay Night\".\nC.C.'s portrayal as the Cheshire Cat in \"Nunnally in Wonderland\" is likely to create an acronym pun on her name.\nIt's implied that C.C.'s favorite color is pink. In the second season, the Knightmares she receives are painted pink. After the Zero Requiem, she's shown to be holding onto a pink paper crane as a remembrance of Lelouch and the wish for a better world.\nC.C. is popularly assumed by fans to be biologically 16 years old.\nIn both timelines (anime and movies) CC has always had 2 wishes, one false and one true:\nHer false wish, which is to die. A wish that C.C. almost manages to fulfill when she is almost killed by Charles. A wish that C.C. abandons because she had regained her will to live when Lelouch promises to make her smile by fulfilling her true wish.\nHer true wish, which is to have someone who would truly love her and who will always be with her. A wish that C.C. had since her childhood and that she finally managed to fulfill by reviving Lelouch. Since when Lelouch revived he became an \"Failed One\" and after saving Nunnally Lelouch chose to leave everything behind and always be with C.C., a decision that Lelouch reaffirmed by saying that he would change his name to L.L. (an indirect marriage proposal).\nIn the R2 Picture Drama, Turn 22.05, C.C. is seen proficiently playing a pedal harp.\nCecile asks if C.C. loves Lelouch in the same picture drama. She doesn't give a straight answer, saying, \"if it was love, I probably wouldn't be here.\".\nReferences\n"
}