{
  "requested_name": "Erza Scarlet",
  "resolved_title": "Erza Scarlet",
  "url": "https://fairy-tail.fandom.com/en/wiki/Erza_Scarlet",
  "summary": "\"All I need is the power to be able to protect my comrades. So long as I can have the strength to do that, I don't care if I'm weaker than everyone in the world.\"",
  "full_text": "Erza Scarlet\n\"All I need is the power to be able to protect my comrades. So long as I can have the strength to do that, I don't care if I'm weaker than everyone in the world.\"\n— Erza Scarlet to Azuma in \"The Sirius Tree\"\nErza Scarlet (エルザ・スカーレット Eruza Sukāretto) is an S-Class Mage of the Fairy Tail Guild, wherein she is a member of Team Natsu. She also served as the guild's 7th Guild Master during Makarov's absence in X792.\nQuick Answers\nWhat is the story behind Erza Scarlet's artificial eye?\n\t\t\t\t\t\tAs a child, Erza Scarlet was enslaved and lost her right eye during a failed escape attempt from the Tower of Heaven. After joining Fairy Tail, she was taken to Porlyusica by Makarov, the guild master, who replaced her lost eye with an artificial one. The artificial eye prevented her from crying from it, but Erza was unbothered, claiming she had already shed half her tears.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Fandom\n\t\t\t\t\t\nCan you list the different armors that Erza Scarlet uses in Fairy Tail?\n\t\t\t\t\t\tErza Scarlet utilizes numerous armors such as Farewell Fairy Tail Armor, Flame Empress Armor, Heart Kreuz Armor, Heaven's Wheel Armor, Nakagami Armor, Piercing Armor, Purgatory Armor, Sea Empress Armor, Thousand Arms Armor, Samurai Armor, and Strawberry Armor among others.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Community\n\t\t\t\t\t\nWhat is the significance of Erza's sword in the Fairy Tail series?\n\t\t\t\t\t\tErza Scarlet's swords are integral to her combat strategy. A lot of her swords provides her unique combat abilities that can be used in multiple ways such as her Demon Blade Benizakura whicj channels her Magic Power for maximum offense. She also wields swords imbued with Fire Dragon Slayer and Ice Devil Slayer Magic.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Community\n\t\t\t\t\t\nWhat are some of the most iconic outfits worn by Erza Scarlet in Fairy Tail?\n\t\t\t\t\t\tErza Scarlet is recognized for her ability to change outfits using Requip Magic. Her most iconic outfits include the Clear Heart Clothing, the Armadura Fairy, her most powerful armor representing her Fairy Tail pride, and the custom-made Heart Kreuz Armor. Other notable armors are the Lightning Empress, Black Wing, Flame Empress, Giant, Adamantine, and Purgatory. \n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Community\n\t\t\t\t\t\n{\"@context\":\"https:\\/\\/schema.org\",\"@type\":\"FAQPage\",\"name\":\"Erza Scarlet\",\"mainEntity\":}\nAppearance\n \nErza is a young woman with long, scarlet hair and brown eyes. She lost her right eye as a child and now has an artificial one which was created by Porlyusica. She has a slender, voluptuous figure that Lucy Heartfilia described as \"amazing.\" Her most common attire consists of a custom-made armor by Heart Kreuz smiths, a blue skirt, black boots, and diamond shaped silver earrings. Her Fairy Tail stamp is blue and is located on the middle of her left upper arm. Erza's specialty in Requip Magic allows her to requip not only armors but different outfits as well, enabling her to change her attire at any given time.\nPersonality\n \nErza is a very strict person, often criticizing the bad behavior and habits of the other guild members, causing most of them to apologize, fearing that they might invoke her wrath. She is also very impatient, disliking people who don't answer her questions quickly enough. This, coupled with her own tragic childhood, caused many of her guildmates to avoid her due to her social awkwardness. However, she has a great sense of justice and pride in being a member of Fairy Tail.\nAccording to Lucy, in the letter she wrote for her mother, Erza is \"cool and beautiful, warm and full of passion\", while to Erza Knightwalker, Erza is strong, cool and a little scary but relied on by everyone, even so she can be really girly and liked sweet things and cute clothes. Jellal, when he had lost his memories, remembering nothing but the name \"Erza\", said her name was \"full of kindness, brightness and warmth\".\n \nErza describes herself as someone who was always crying, since she wasn't able to protect those dear to her. Several examples are when Rob tried to shield her from destruction, and when Jellal was captured because he saved her and was brainwashed by \"Zeref\". Also, Erza has stated that she feels uncomfortable and insecure when she's not wearing armor. However, when Erza encounters Ikaruga, she overcomes her fear and defeats her without her armor.\nDespite her reserved personality and mostly dressing in her conservative Heart Kreuz armor, Erza has been shown to have very little modesty and an unusual view on the concept in general. Many of her armors are skimpy, revealing and feminine, and when out of armor she has an affinity for sexy and revealing clothing. Finally, Erza seems to have no problem with men (or at least her male guildmates) seeing her naked. She felt no discomfort stating her desire to shower with Natsu and Gray or the fact that she used to shower with them when they were younger. When they were at the hot spring, when she learned that the boys may have been peeping on her and the other girls, she wanted to invite them to bathe with them, much to Wendy's shock and Lucy's strong objection. Lucy has also stated that Erza has a habit of climbing into her bed in their shared room during the Grand Magic Games.\nIt was shown that Erza can't hold her liquor. While drunk, she acts very aggressive towards others, as shown by her behavior towards her guildmates. She also seems to have a problem recognizing people when drunk.\nAs mentioned by Levy, Erza has a secret fondness for smut and erotic novels.\nMagic and Abilities\n \nRequip: The Knight (換装騎士Kansō Za Naito): Requip is a type of Spatial Magic and Erza's signature form of Magic, over which she possesses great mastery. It is a type of Magic that allows her to swap weapons, armor and clothes at will. Her particular form of Requip is called The Knight. She is noted for her ability to Requip extremely fast and is the only sword Mage known to be capable of Requipping weapons and armor while fighting, she is said to have over 100 different armors, something which made her and her immense strength well known throughout her place of residence, Magnolia Town, and throughout the entire Kingdom of Fiore, earning her the epithet \"Titania\". Erza can also project a holographic inventory screen where she can view and organize items in their pocket dimension, as well as add items without equipping it on herself.\nSword Magic (剣の魔法 Ken no Mahō): In addition to her signature Magic, Requip, Erza is also an extremely talented user of Sword Magic. As the name implies, this is a type of Magic that revolves around the use of swords. Through the use of this Magic, Erza is capable of using her swords to perform different magical attacks. This is usually done in combination with specific armors of hers, which makes her a very deadly combatant. It is also shown that she can also combine different armors with other swords from other armors to either block or attack using deadlier force and mixing different elements together.\nTelekinesis: Erza is also a skilled user of Telekinesis. The first time she used this Magic, however, was accidental. When she was a child in the Tower of Heaven she used this Magic to levitate discarded weapons from the ground and launch them at her enemies, something which she did inadvertently, due to the shock caused by Rob's death. Erza's most common use of Telekinesis comes with her Sword Magic, in which she can perform different attacks by controlling her swords remotely. (Unnamed)\nEnchant Magic (付加術 Fukajutsu): Erza is shown to be proficient enough to able to use a \"High Enchant\" (高位付加術 Hai Enchanto) level of enchantment onto her swords after being taught by Wendy.\nBasic Enchantments\nDragon Slayer Seal (滅竜印 Metsuryū In): Erza can manually activate the enchantment that Wendy had placed on her, simply by chanting \"Dragon Slayer Seal Release\". This temporarily grants her Dragon Slayer Magic as an attribute, giving her the effectiveness of a Dragon Slayer.\nHigh Enchantments\nMagic Enchantment: Erza learned this enchantment from Wendy to allow her to attach Natsu, Gray and Jellal's Magic on her swords. (Unnamed)\n \nMaster Swordsmanship Specialist: Erza possesses great mastery in swordsmanship and her skills in swordsmanship are of the highest caliber. Her offensive capabilities mainly come from her swordplay, which enables her to effectively utilize the weapons that her Requip provides, which includes swords, short swords, axes, lances and staffs (among others). Erza has shown great skill in utilizing the reverse-grip of swordsmanship as well as the normal grip. She is even capable of employing her swords effectively using her feet, by wielding their hilts between her hallux and second toe. Her swordsmanship is enough for her to slash through Aria's presumably intangible Airspaces, and to deflect hundreds of needles which were shot at her by Evergreen with relative ease. In addition, her sword slashes possess so much force behind them that they are able to slice through metal using only the air pressure from the swings.\nExpert Marksmanship: Erza possesses great marksmanship capabilities, as shown throwing the right number of kunai projectiles at a bamboo fence, striking everyone behind it despite not being visible to her. She's also shown some skill in archery, as seen when she impressively bested Eclipse Sagittarius, a master in archery, in their aiming match while riding on a mechanical steed.\nKeen Intellect: Erza has proven herself to be clever and to possess a thorough knowledge of the Magic world: she was able to figure out why the people of Galuna Island were changing into Demons (or thought they were) after only a brief period on the island, and could work out the mechanics behind Midnight’s Reflector Magic after being struck by it only few times, something which got her praise from Jellal Fernandes.\nExpert Hand-to-Hand Combatant: Despite favoring the use of her various weapons, Erza has proven herself to be a skilled hand-to-hand combatant. Despite her being bound to a wall, she was able to easily knock Shô unconscious with a single kick. She was also able to engage Erza Knightwalker in an unarmed fight after all of their weapons were shattered in their previous battle, attacking her counterpart with powerful punches and performing throws and takedowns to push her away. She is also able to mix hand-to-hand combat with her swordsmanship while in the midst of battle.\n \nEnhanced Strength: In stark contrast with her slim and womanly figure, Erza possesses a very large amount of physical strength, having been repeatedly shown capable of lifting and dragging around objects many times her own size and weight, most prominently due to her habit of carrying around vast amounts of luggage. She was also able to send Midnight flying against a wall, several meters away from both of them, with a flick of her wrist. In addition, her sword slashes possess so much force behind them that they are able to slice through metal using only the air pressure from the swings.\nImmense Endurance: Erza has been shown to possess a vast amount of physical endurance. After using up all of her Magic Power during her fight with Azuma by focusing it all in a single slash, she was still able to join the battle against Hades, Requipping different armors and performing combo attacks with her teammates. She was also able to fight and hold her own against a Mage of Jellal Fernandes' caliber after having fought and defeated Ikaruga, a very powerful Assassin from Death's Head Caucus. Erza tolerance for pain is pushed further when fighting Kyôka in her Etherious Form, especially after having her sensibility to pain increased that even a small breeze cause Erza severe agony, despite every part of her body hurting every time she makes contact, Erza managed to stand and punch the demon in spite of the damage inflicting on herself, scoffing it as anything worthy of \"true pain\". Even when most of her bones were broken by Irene's Dragon hand, Erza still pushed her one working arm to force herself up to stop the meteor Irene summoned. When facing Misaki, any hits Erza took in her dimension is amplified to excruciating results back in the main world, despite this she still gets up and proclaimed to fight her on her own.\n \nImmense Durability: Erza has also proven herself to have a vast amount of physical durability: with the aid of her Adamantine Armor, she was able to take the brunt of the Magical Convergent Cannon: Jupiter on herself, and then go on to easily defeat Aria, an S-Class Mage, and stand up against Jose Porla, the Phantom Lord Guild Master and a member of the Ten Wizard Saints, after receiving only a very brief amount of time for rest. While clad in her Heaven's Wheel Armor, she was capable of taking on the counter effect of 200 Lacrima orbs from Laxus' Thunder Palace even though the effect of one of the orbs is enough to endanger someone's life. and she was also able to survive the highly-damaging Terra Clamare twice, and still manage to continue to fight and defeat Azuma. When Ultear Milkovich used her Arc of Time to open up Erza's \"Second Origin\", Erza showed no signs of being bothered at all, unlike her teammates, including Gray Fullbuster, Natsu Dragneel, and Juvia Lockser, who couldn't walk and writhed around on the floor in pain. According to Gray it's probably due to Erza having her \"Second Origin\" from the start. In addition, during the third day of the Grand Magic Games of X791, Erza was able to fight and defeat 100 powerful monsters, including one which was said to be so powerful that even a Ten Wizard Saint might not be able to defeat it. Despite being heavily injured and bruised, she left the fight without showing any signs of fatigue, something which garnered her praise from hundreds of people, including quite a few powerful Mages. Erza was also able to withstand Minerva's extremely destructive Yagd Rigola spell with only slight damage. Erza took on several consecutive hits from Kyoka's whip talons all while her pain receptors heightened, yet withstood it long enough to close in direct strikes on the demon. She was also shown to be able to take on Laxus's multiple direct attacks, especially when smashed to the floor, shattering most of the ground, even strikes from his red lightning. When initially struck by Misaki's spatial blasts, while most of her outfit blew off, Erza's body remained unaffected, surprising the caster who intended to tear her body apart. Erza took on several direct hits from Misaki's blades made from space, being attacked from every direction while in Misaki's dimension, yet Erza retains enough strength to move forward to strike the Dragon Slayer.\nImmense Reflexes: Erza possesses extremely sharp reflexes, and a high degree agility and speed. Despite her being severely battle worn, she was able to dodge a blast from Jose Porla while balancing herself on one hand. She was also able to skillfully and acrobatically dodge a barrage of Darkness Magic Spells from Jellal Fernandes, and when he knocked her through the walls of the Tower of Heaven she launched herself off of a few small falling rocks back into the tower with ease. When Evergreen shot a few rays at her as a surprise attack, Erza easily dodged the rays with a side jump. Erza was also able to block the first few strikes from her Edolas counterpart's Silfarion which augmented her speed greatly, just before Erza switched to her Flight Armor to match her speed. Erza was also able to react swiftly against Suzaku's surprise attack and blocking it which is enough to surprise Suzaku himself.\nImmense Magic Power: As an S-Class Mage of the Fairy Tail Guild, Erza possesses a tremendous amount of Magic Power. Throughout many difficult battles Erza was able to Requip powerful armors in rapid succession without showing any signs of fatigue. She was also able to Requip her Heaven's Wheel Armor and over 200 swords after Requipping her Lightning Empress Armor without running out of Magic Power. When exerted, her Magic Power is red in color. Even after battling both Kagura and Minerva from day to evening, Erza still had enough power to release her 2nd Origin, allowing her to utilize all her remaining Magic power to wear her Nakagami Armor, an armament that drains a considerable amount of the user’s Magic with just a short use, making it difficult for anyone to wear in over a decade. The pressure from her Magic Power itself was enough to make Neinhart uneasy, fearing that she was somehow related to Irene Belserion, the strongest female of the Spriggan 12. Erza’s overall Magic power was able to destroy a gigantic meteor by releasing her energy via a swing of her sword.\nPrehensile Feet: Erza is shown to be versatile and dexterous with her feet, capable of wielding swords as she would with her hands. Erza has also casted and planted magic circles with her feet, taking inspiration from Swan’s footwork while battling her and evading her attacks.\nCloth Imprisonment: Erza can take a piece of long cloth and use it to wrap around a target and ensnare them practically instantly, restricting their movement.\nFormer Magic and Abilities\nYokai Form: While under the effects of Yoko's Demons' Parade, Erza is transformed into a Yokai called Spider Woman. While in this form, Erza gains spider web markings on her face and her stomach, her left eye and hands turns black while her lower body turns into a giant spider.\nSpirit Power (霊力 Reiryoku): While in this form, Erza gains access to this spiritual power while also being enhanced several times by Yoko.\nEquipment\nErza owns over 100 different types of armor, and over 200 different types of weapons.\nHeart Kreuz Armor (ハートクロス鎧 Hāto Kurosu Yoroi): Made by the popular fashion brand Heart Kreuz specifically for her, this is Erza's casual armor, which she is mostly seen wearing. This armor sports a breastplate now composed of a single piece of metal, decorated by curved lines and by a deformed version of Heart Kreuz's mark, with the cross' right arm extending to the right part of Erza's chest, and the added mark of Fairy Tail located under the cross itself, which is now lacking the brand's name.\n \nHeaven's Wheel Armor (天輪の鎧 Tenrin no Yoroi): Plated armor covers her chest, with a large metal flower over it, and she wears a large billowing skirt that has metal plating in the upper area. Her stomach and neck are uncovered, and she has large metal wings that appear to be made of individual blades, as well as a wing-like headpiece.\nFlight: While wearing this armor, Erza seemingly gains the ability to fly for short distances.\nSword Requipping: Erza is able to summon a large amount of swords (roughly more than 200), and launch weapons at her opponent(s) in a variety of different ways. The armor is meant to be used for facing multiple opponents.\nHeaven's Wheel Swords: This armor comes equipped with several identical one-handed Magic Swords, having winged feathered-liked handguards with blue embellishments along the blade. (Unnamed)\nBlumenblatt (天輪・繚乱の剣 Tenrin: Burūmenburatto): Erza will requip a mass amount of swords, and then charge at her opponent and slice him or her with two of her swords. Then she will fly past her enemy and send the swords she Requipped into the enemy at the same time.\nCircle Sword (天輪・循環の剣 Tenrin: Sākuru Sōdo): Erza requips swords and has them circle around her by utilizing the command, \"Dance, My Blades\". The swords then begin spinning rapidly around Erza and she sends them flying towards her opponent(s) in a disc formation at first and upon impact the swords separate and fly in different directions dealing great damage.\nTrinity Sword (天輪・三位の剣 Tenrin: Toriniti Sōdo): While in her Heaven's Wheel Armor, Erza slashes the opponent in a delta formation.\nPentagram Sword (天輪・五芒星の剣 Tenrin: Pentaguramu Sōdo): While using the Heaven's Wheel Armor, the user slashes the swords in the shape of a pentagram to attack the target.\n \nBlack Wing Armor (黒羽の鎧 Kureha no Yoroi): This armor is black with silver trimming that has silver crosses is several places. It has a revealing silver-edged breastplate and plates flanking her hips that reach down to her waist-guard. The waist-guard leaves the front of Erza’s body exposed, with her groin being covered by a dark imbuement. She has large plates guarding her legs. She has two wings that have black metal \"arms\" acting as the wings' leading structure, but the parts used to fly are composed of a membrane-like material. Erza's hair is tied in a ponytail. \nFlight: This armor seems to grant Erza the ability to fly around for short distances.\nIncreased Offense: This armor increases Erza's offensive capabilities, and she uses it in conjunction with any number of weapons to deal her enemy great damage.\nBlack Wing Sword: This armor comes equipped with a unique looking sword with an intricate black handle. (Unnamed)\nMoon Flash (黒羽・月閃 Kureha: Gessen): Erza rushes past her target, slashing them in a cross pattern.\nFlame Empress Armor (炎帝の鎧 Entei no Yoroi): This armor is dark red predominantly, but also sports orange and black parts, with the first ones being shaped like flames and the second resembling Dragon’s limbs. It’s basically made up of three different parts: the revealing breastplate with Dragon like wings attached to it, the orange gauntlets and the Dragon claw shaped greaves. Erza’s hair is tied into a pair of high, long pigtails.\nFlame Resistance: This armor lowers the destructive power of flame attacks by 50%.\nFlame Empress Sword: A large red and black sword with a flame like design matching the armor. (Unnamed)\nFire Magic (火の魔法 Hi no Mahō): This armor grants Erza the ability to shoot fire.\nSoaring Fire Blade (炎帝・昇炎斬 Entei: Shōenzan): Erza utilizes her equipped sword's flaming blade and quickly rises in an uppercut spiral fashion, attacking the target.\nGiant Armor (巨人の鎧 Kyojin no Yoroi): This is a large, furry, golden colored armor with that sports a large cross on the breastplate. The armor is completed by a headgear with the appearance of a pair of large metal ears. The armor works great in combination with the De-Malevo-Lance, a long and elaborated polearm sporting a cross just like the one on the armor.\nEnhanced Strength: This armor increases Erza's strength in the form of her throwing power. It was first used when Erza threw her spear at the \"moon\" above Galuna Island.\nDe-Malevo-Lance (破邪の槍 Haja no Yari): It is an extravagant spear said to be able to repel darkness.\n \nAdamantine Armor (金剛の鎧 Kongō no Yoroi): The Adamantine Armor is a large, blue and navy colored armor. The breastplate is composed of different plates joined together, with four, prominent tube-like ornaments on the front, right above her breasts, below the high armored collar. The shoulder pads are very large and sport prominent plates shaped like spikes, protruding from a far darker part which composes the base of the structure. The armor is completed by a helmet which covers the top and the sides of Erza’s face, leaving the back part of her head exposed, and sporting prominent spikes jutting outwards.\nImmense Defense: This armor is the ultimate, high-level defensive stance. While wearing it, Erza is able to withstand the Magic beam fired by Phantom Lord's magical Convergent Cannon: Jupiter. Despite her receiving injuries and the armor breaking into process, she still successfully protected the entire Fairy Tail Guild and all of its members.\nAdamantine Shield (金剛の盾 Kongō no Tate): This armor can be equipped with a shield for extra defensive measures.\nMagic Barrier (魔法障壁 Maho Shōheki): This armor grants Erza the ability to produce magical barriers to defend from attacks.\nAdamantine Barrier: While wearing this armor, Erza gains the ability to create a powerful magical barrier by combining her two shields together, which can even withstand spells such as the Jupiter Cannon. (Unnamed)\nFlight: While wearing this armor, Erza gains the ability to fly, although only for short distances.\nPurgatory Armor (煉獄の鎧 Rengoku no Yoroi): The Purgatory is a black armor that is covered in spikes. When using this armor, Erza’s hair becomes styled in very prominent spikes pointing outwards in every direction, with her right eye being covered by it and a devilish shadow obscuring the upper part of her face. This is one of Erza's most powerful armors, before her fight with Ikaruga she claimed that \"None had seen the armor and lived to tell the tale.\" Its true power is not seen, however, as it was destroyed almost instantly by Ikaruga.\nSpiked Mace: This armor is equipped with a large black mace that exceeds the length of her body, having 6 large spikes running down the edge.\n \nClear Heart Clothing (清心の衣 Seishin no Koromo): The Clear Heart Clothing is described by Erza as just normal clothes without any special properties. As her armors represented the walls around her heart, donning these clothes represented Erza opening her heart and breaking down the walls she'd built up to protect herself. While in this outfit, she discards defense, instead focusing primarily on offense.\nDemon Blade Benizakura (妖刀紅桜 Yōtō Benizakura): A sword wherein Erza focuses all her Magic Power into the blade for maximum offense.\nDragon-Slaying Blade: Belserion (滅竜剣 ベルセリオン Metsuryūken: Beruserion): Erza uses the Demon Blade Benizakura to create a magical blade that releases black lighting around it while also giving her an advantage against Dragons or Dragon Slayers.\nBenizakura Flash (紅桜一閃 Benizakura Issen): Erza uses the Demon Blade Benizakura by dashing towards her target and slashes them in a flash.\nFire Dragon's Flames (火竜の炎 Karyū no Honō): A sword enchanted by Erza with Fire Dragon Slayer Magic.\nIcefire Blade (氷炎剣 Hyōen Ken): While equipped with the Fire Dragon's Flames and the Ice Devil's Chill, Erza dashes towards her target and slashes them in a cross pattern.\nIce Devil's Chill (氷魔の冷気 Hyōma no Reiki): A sword enchanted by Erza with Ice Devil Slayer Magic.\nIcefire Blade (氷炎剣 Hyōen Ken): While equipped with the Fire Dragon's Flames and the Ice Devil's Chill, Erza dashes towards her target and slashes them in a cross pattern.\n \nLightning Empress Armor (雷帝の鎧 Raitei no Yoroi): This armor is golden and light bluish in color. The breastplate is decorated by golden trimmings, and has thin plates going up to surround Erza's neck. When using this armor, Erza’s head gets adorned by a band with two ribbons on it, and her hair gets styled in a long braid. Also, the armor’s weapon is a long spear, with a very large blade and a decorated circle resembling a shield attaching it to the shaft, which is adorned by a large ribbon. \nLighting Resistance: This is an armor that lowers the attack damage of all lightning attacks aimed at the wearer. It was enough to withstand an attack by Laxus Dreyar, a skilled user of Lightning Magic, without Erza receiving any injuries herself.\nLightning Empress Spear: This armor comes equipped with a decorative spear with a pincer-like blade. (Unnamed)\nLightning Magic (雷系各種魔法 Kaminari Kei Kakushu Mahō): This armor grants Erza the ability to attack her foes with lightning.\nLightning Beam: Erza fires a blue beam of lightning towards her opponent from the tip of the armor’s spear. Erza can also fire with several attacks at the same time from the Magic Seal formed on the spear’s tip. (Unnamed)\nLightning Barrier: Erza charges her spear with electricity creating a powerful lightning barrier that protects her from her foe's attacks. (Unnamed)\nFlight Armor (飛翔の鎧 Hishō no Yoroi): This armor has features very few armored parts. It is cheetah printed, and the outfit has a large collar around Erza’s neck and a tail hanging from the back of her shorts, both made of bushy fur, plus a pair of large cheetah’s ears adorning both sides of Erza’s head. When wearing this armor, Erza is equipped with a pair of short swords with elaborate hand-guards similar to a rapier's, shaped like rose's thorns.\nImmense Speed: This armor increases Erza's speed dramatically, to the point where she could match Erza Knightwalker's speed while the latter was using Silfarion. She was also able to keep up with Racer despite being under the effects of his Slow Magic.\nSonic Claw (飛翔・音速の爪 Hishō: Sonikku Kurō): Erza dashes towards her target at high speed and slashes them multiple times from every direction.\n \nRobe of Yūen (悠遠の衣 Yūen no Koromo): This armor is like a purple, revealing kimono. It consists of a short sleeveless tunic decorated by many flower motifs, with a revealing cleavage and revealing opening on the sides, exposing much of Erza’s chest, held closed by both a large, dark obi, which has a thin red rope tied around it and sports a wide closing ribbon on the back, and by a lighter, smaller white belt, which are both wrapped around a pink, flower-patterned cloth circling Erza’s waist on the back and the sides.\nElastic Properties: This armor has incredible elasticity, something which prevented Midnight’s Reflector Magic from securely binding Erza or strangling her using it.\nBisentō: This attire is armed with a polearm weapon, a type of halberd with a blade that has holes through it.\nMorning Star Armor (明星の鎧 Myōjō no Yoroi): This armor, which seems to be mainly composed of a leather-like material, sports many feather-shaped decorations, including the short cape, the pauldrons protruding from under it, and the cloth circling Erza’s waist, held up by a simple belt on the front. She dons a one piece suit revealing her legs, whose upper part is covered by fishnet leggings, and with high-heeled armored greaves with large knee guards covering her calves. Her arms are heavily armored as well. In this outfit, Erza’s hair is styled in tangled buns on top of her head, and she’s armed with a pair of simple swords with cross-shaped hand-guards, getting larger near the edges, and blades which seem to lack the standard cutting edges. \nPhoton Slicer (明星・光粒子の剣 Myōjō: Foton Suraisā): By pointing the twin swords towards her opponent, Erza is capable of releasing a large blast to them.\n \nArmadura Fairy (妖精の鎧 Arumadura Fearī): The strongest armor as declared by her counterpart Erza Knightwalker. This armor has the name of her guild to symbolize her pride of being a member of Fairy Tail. It’s a pink armor with a simple breastplate joined to the collar. The armor has many wing shaped decorations. \nFairy Blades (妖精剣 Yōsei Ken): The armor’s weapons of choice are a pair of identical swords, sporting large and decorated hand-guards reminiscent each of a pair of wings, and with the blades protruding near the hilts to house additional decorative motifs.\nFairy Burst (フェアリー・バースト Fearī Bāsuto): Erza charges her swords with energy and hits the target with a powerful lunge. This attack was strong enough to break Knightwalker's strongest spear, Ravelt, shattering an entire island in the process.\nFairy Blade: Meteor (妖精剣・流星 Yōsei Ken Nagareboshi): Erza uses this armor’s Fairy Blade enchanted with Heavenly Body Magic and delivers a large powerful, devastating slash at great speed comparable to that of Meteor.\nSea King Armor (海王の鎧 Kaiō no Yoroi): This armor is green in color with bluish parts. The breastplate, which barely covers Erza’s breast, leaving her belly and her back visible, somewhat resembles seaweed, and has some thin chains hanging from it over Erza’s exposed parts, with a pair siding her breasts and another the belly; a fifth chain is visible around her neck, which is guarded by the large collar. The armor is completed by a headgear, with a large metal part covering her forehead, bearing a whirl-shaped wave on it, and large fin-shaped protrusions siding her head. The armor comes equipped with a long sword which seems to be made of crystal, with many small crystals jutting out in every direction from the hand-guard. \nWater Resistance: According to Lisanna, this armor nullifies water attacks. It has been shown to be able to withstand Juvia's water attacks easily.\nWater Magic (水系各種魔法 Mizu Kei Kakushu Mahō): This armor allows Erza to charge her sword with water and release powerful whirlpools against her opponent.\nSea God's Blade Wave (海神・ブレイドウェイブ Kaijin Bureido Weibu): Erza uses her sword and slashes at an opponent, unleashing a wave of water upon them.\nSea King's Marine Moment (海王・臨海刹那 Kaiō Rinkai Setsuna): Erza uses her sword and slashes her opponent, in the process causing them to be struck by a powerful splash of water.\nCrystal Sword: A long sword with crystals protruding from the hand guard. The anime depicts it with a more aquatic theme, having fish-like fins on the hand guard with 3 protrusions shaping the blade. The sword itself exhibits the ability to cut through water spells and repel them. This sword can also perform water based slashes. (Unnamed)\nSea King Sword (海王の剣 Kaiō no Ken): This sword is composed entirely from water, the sword has aquatic properties in which it allows the user to slice through certain objects and material, such as sand, whereas a normal sword wouldn't have an effect on it.\nSeduction Armor (誘惑の鎧 Yūwaku no Yoroi): Erza’s most revealing armor, which is more like an extremely daring maid outfit. It’s composed of a long light apron, tied behind Erza's neck and back, worn over her bare chest, and thus revealing much of her breasts’ sides, paired with dark panties, exposing much of her buttocks, and long stockings, reaching up to the middle parts of her thighs. There are no shoes, and Erza's head is adorned by a maid hat. The only visible armored parts are the gauntlets, which extend up to the middle parts of Erza's biceps, where ribbons are tied around her arms, and sport heart-shaped elbow guards. The armor comes equipped with a simple sword which bears a writing on the blade, this being \"Come on Boy\". The armor's effects, if any, are unknown.\n \nNakagami Armor (天一神の鎧 Nakagami no Yoroi): A set of armor Erza had the ability to don once she released her Second Origin. The Nakagami Armor has not been worn for over ten years, as it consumes vast amounts of Magic Power to utilize. Anyone who is able to wear the armor will be able to dispel Magic and wield a peerless sword. The armor is composed of a short revealing robe that is tied together with an intricate ribbon at the waist. The armor features large pauldrons over each shoulder, bearing the image of a lion with an open mouth, and decorated greaves that match the motif of the armor. The entire set is complemented with a rhombus-shaped tiara and a large sash which loops above her head with the ends hanging out towards the ground with a bead on each end. The armor comes equipped with a large halberd possessing a circular hand-guard at its center.\nMagic Halberd: The armor comes equipped with a large halberd possessing a circular hand-guard at its center. (Unnamed)\nNakagami Starlight (中一神・星彩 Nakagami Seisai): A spell utilized in conjunction with her halberd to dismantle the opponent with swift, brute force.\nPiercing Armor: A set of armor Erza equipped into to pierce Kyôka through Cube. This set consists of a breastplate, waistguard, gauntlets and leg plates, which all feature a greenish-silver tint. Each pauldron dons the Fairy Tail emblem and her leg plates are designed decoratively. The armor is worn with black pants, brown elbow pads underneath the gauntlets and complemented with an olive belt that is tied above the waistguard. It is unknown if this armor has any additional abilities that are independent from the weapon. (Unnamed)\nPiercing: This armor comes equipped with a large, silver jousting lance that features well-decorated designs over its vamplate and has shown the capability to pierce and penetrate an opponent through a mass as large as a fortress. (Unnamed)\nAtaraxia Armor: This armor takes form of a beautiful gown, with a hem sprouting from it, being tied with a belt of some sort. The upper part of the dress includes shoulderless sleeves and a flower petal on the user's left hand, while the foot wearings are a pair of knee-high heel boots. In addition to all of this, the armor consists of swords being used for various purposes, albeit primarily as wings, adding to the peculiarity.\nBlade Wings: The outfit comes equipped with wings, apparently made of swords, that can act as a shield. Moreover, any of the aforementioned swords can be also easily summoned and used for offensive purposes. According to Erza, these swords cuts so swiftly and smoothly that it’s undetectable even from a distance. (Unnamed)\n \nRed-Black Twin Blades (紅黒の双刃 Kōkon no Sōjin): This armor is equipped with bunny ears, a two-toned dress, armored shin, arm, and legs caps, and lastly heels. (Unnamed)\nRed-Black Twin Blades (紅黒の双刃 Kōkon no Sōjin): These two blades have checkerboard designs upon them, while it has the ability to be combined into one blade for added effect and power.\nTwin Blades Warrior Slash (双刃無双斬 Sōjin Musōzan): Erza combines the Red-Black Twin Blades into one sword to deliver a extreme slashing blow.\nWind God Armor (風神の鎧 Fūjin no Yoroi): This armor takes the form of a tribal-type robe that covers the wearer's upper body in a waist coat-like garb. The neckline is topped with fur along with a dark streak underneath said fur, with short hanging sleeves that end with a triangular pattern along the hem. A fur lined sash that sits beneath the wearer's bust and above the bust keeps the garb tied up and the ends of the coat fanned out by the wearer's thighs. Along the user's forearms are white bandages strapped around them from the wrist to below the elbow. The lower portion of the armor consists of a pair of dark pants and light, shin high boots where the tongue is flanked by the main body of the boot flaring out slightly. The armor is completed with a pair of wings that sit either side of the wearer's head and with the wearer's hair tied into a low ponytail.\nWind God Sword (風神の剣 Fūjin no Ken): The armor is combined with an ornately styled broadsword that gives Erza the ability to control the wind.\nWind Magic: This armor equips Erza with the Wind God Sword, allowing her to manipulate wind strong enough to blow away the inordinate amount of sand conjured by Ajeel Raml.\n \nThousand Arms Armor (千手の鎧 Senju no Yoroi): The armor features an oriental Buddhist theme, with four extra arms each donning a sword, with features and designs from the waist down that resemble the Nakagami Armor.\nFour Artificial Arms: This armor grants Erza the ability to control four additional artificial arms, giving her the ability to fight with a total of six arms and wield six swords at the same time. Each artificial arm is connected to an SE-plug (Self-Energy plug) (ＳＥプラグ Esu-Ī Puragu), a small, device that wraps around the user's wrist, converting their Magic Power into fuel and can be moved separately. Due to the additional arms, this armor ends up being quite heavy. Erza also revealed that this armor was just an equipment used for the Harvest Festival parade.\nEvil Spirit Exorcism (千手・悪霊退散 Senju: Akuryō Taisan): While in her Thousand Arms Armor, Erza slashes her six swords with the help of her four artificial arms at her target.\nDouble-bladed Spear Armor: This armor consists of a fully armored torso along with pauldrons, a cape, a pair of gaunlets, a headband and a pair of boots (Unnamed)\nDouble-bladed Spear: This armor comes equipped with a double-bladed spear with two long sharp pointed ends and is held in the middle.\nCelestial Armor: This armor takes the form of a revealing blue garb with a golden chain collar around the neck area, along diamond earrings and matching colored hair accessories. On her legs are two large diamond patches while around her arms are cape-like garments to complete her armor's design while not providing any footwear. (Unnamed)\nHeavenly Body Magic (天体魔法 Tentai Mahō): While wearing this armor, Erza gains the ability to generate and manipulates the energy of stars and uses it against her enemy.\nGrand Chariot (七星剣 Guran Shario): Erza conjures seven humongous magic circle that shoots down magical energy and can also physically damage her target with it, even in the midst of being in close quarters combat.\nSamurai Armor: Erza owns a typical Japanese Samurai Armor, with a black helmet with the Fairy Tail Guildmark one it. She used the said armor in her fight with Eclipse Sagittarius. (Unnamed)\nKatana: This armor comes equipped with a katana sword, with a black diamond shaped guard and silver colored handle.\nStrawberry Armor: This armor takes the form of a giant strawberry fruit that Erza can wear, having holes to place her arms and legs through as well as her face to see.\nSweet Strawberry Scent: While wearing this armor, Erza gains the ability to attract or lead an entire herd of forest Vulcans towards her.\nStrawberry Sword: This armor also comes equipped with a similar themed sword, having a strawberry shaped guard.\nBunny Armor: This suit takes the form of a full body rabbit suit, most of which is white with red stripes on the arms and legs along with a beige chest. On the top of the head there are rabbit ears that are pink in the inside, along with a face on the top with two eyes, a mouth and nose. (Unnamed)\n \nFarewell Fairy Tail Armor: It's breastplate is fairly plain, with the waist-guard attached to it being similar to the one in Erza’s second Heart Kreuz Armor, composed of simply two hanging plates, paired with a ruffled cloth sprouting from under it over some chainmail; all of which surmount a long skirt, reaching down to Erza’s knees and covering the rather featureless greaves. The gauntlets, covering the entirety of her arms, are similarly unadorned, with only her pauldrons, composed of overlapping plates, having some decorations over the upper plates, taking the form of wings. On the other hand, the long spear which comes with the armor sports intricate decorations on the shaft and the massive head, together with a flag bearing Fairy Tail’s symbol, plus what looks like a laurel wreath, tied to it by two slim ribbons. The anime design of this armor differs from the manga. Erza was seen donning this armor in order to bid farewell to her friends from the Tower of Heaven before their departure. (Unnamed)\n \nHoly Hammer: Erza receives this ancient weapon from Jean-Luc Neville, who discovered it during the archaeological investigation that unearthed part of the Infinity Clock. The hammer is longer than Erza is tall with a long black handle in a zigzag shape. The head consists of a series of gray cylindrical sections, the frontal one being larger than the rest, with light brown plating on its front. On the front of the hammerhead is the emblem of the Zentopia Church on a white circular background. Said to keep evil at bay, the hammer protects its wielder from the effects of Real Nightmare and can dispel the effects from others. When used against Cobra, it leaves wounds of light on the arm it struck. It is also capable of breaking the chains of the Infinity Castle with ease. During the Pandemonium event, it was shown to be useful for defense as well.\nArtificial Eye: While enslaved as a child to build the Tower of Heaven, Erza lost her right eye during a punishment for an escape attempt. After she joined Fairy Tail, Makarov took her to see Porlyusica, who created an artificial eye for her. Due to the eye's artificial nature, Erza couldn't cry out of it and it is unaffected by Illusion Magic or Stone Eyes Magic. After the events on the Tower of Heaven, Erza was, however, shown to cry out from her artificial eye as well.\nKunais: Erza possesses several Kunais that she uses as throwing daggers at her targets.\nBow and Arrows: Erza possesses variety of ordinary bows and arrows in her arsenal to fire at long ranged targets.\nMechanical Steed: Erza possesses a synthetic horse that she used in her horseback showdown against Eclipse Sagittarius.\nEarring Communications Lacrima: During an infiltration mission on Stella, Erza and some of her teammates wore a pair of earpieces that would allow them to speak with each other via audio communication with those who have the same accessory. The item appears as an earring with a blue Lacrima dangling from a small chain.\nMiniature Communication Lacrima (小型通信魔水晶 Kogata Tsūshin Rakurima): Erza used this device to communicate with Gray who was in an undercover mission.\nCompass: Erza owns an ordinary compass to help her with directions when needed.\nFormer Equipment\nSacred Arrow: Makarov Dreyar gave Erza this ancient magical weapon in order to defeat the Phoenix. The arrow has a triangular arrowhead, consisting of a pointed shaft with three fins behind it, which glows blue and two white fletchings at the end of its shaft. In the past, Kalard forged this weapon in order to destroy the Magic protecting the Phoenix Stone. As such, it is imbibed with powerful Dispel.\nArtificial Keys:\nCelestial Spirit Banishment Key: Banishes the Archer, Sagittarius. (Unnamed)\nTrivia\nErza's likes include weapons and armor. Her dislikes include evil.\n \nErza’s moniker “Titania” is an effeminate name that refers to daughter of Titans from Ovid's Metamorphoses in Greek mythology. The name was then taken by William Shakespeare for the Queen of the Fairies in his play A Midsummer Night’s Dream.\nIn the original version, Mashima gave her a more \"wild\" look. She had a spear, instead of a sword, and accompanying her was an unnamed bird. Mashima said he had wanted to create a female character whom Natsu could be afraid of.\nAccording to Hiro Mashima, after Erza's character introduction almost everything regarding her was made along with flow of the story, or recently made up. Examples he provided was that he didn't decide her Magic, relationship with Natsu or Jellal when he first created her.\nOriginally, the entire events of Fairy Tail up until the time Erza began having dreams of her past as a slave were meant to be the actual present, with the grown up Erza and all her friends being a dream of the future, rather than Erza having dreams of the past. This concept was eventually discarded, but was loosely based around the old Chinese story \"Dream of a Butterfly.\" Remnants of the discarded idea can be seen when butterflies appear in Erza's dream in the chapter of the same name: Chapter 75.\nDuring a Q&A in Volume 9, a reader asked who the lead female character in Fairy Tail is. Erza immediately considered herself as such, but Hiro Mashima said people can draw their own conclusions.\nIn the Omake Welcome to Fairy Hills, Levy reveals to Lucy that Erza likes to read novels that are a bit inappropriate or racy.\nDuring a reporter's interview, Erza said that her favorite foods are strawberry cake and soufflé.\nWhile the popular belief is that Erza's suitcases are filled with backup armors and weapons, they are actually filled with food and ingredients.\nShe was named after Mashima's short story character \"Eru\". Incidentally, the short story's name is \"Fairy Tale\".\nIn the manga, Erza updates her Heart Kreuz Armor after the Tower of Heaven arc, but in the anime, she wears the updated design from the beginning.\nErza is the winner of the Miss Fairy Tail Contest, a reader poll and story event that took place during The Battle of Fairy Tail arc.\nAttack Power\n5/5\nDefensive Power\n5/5\nSpeed\n5/5\nIntelligence\n4/5\nSwordsmanship\n5/5\nIn Volume 32's extra content, Mashima provided the battle statistics for 31 of the 40 X791 contestants in the Grand Magic Games. The stats, however, were provided not from Mashima's point-of-view as the author but from the view point of Sorcerer Magazine reporter Jason. Which explains why some stats are missing and why others may be inaccurate. According to Jason from the Sorcerer Magazine, during her participation in the Grand Magic Games of X791, Erza's stats are:\nQuotes\n(To Fairy Tail members) \"I've heard you've been causing trouble again. Even if Master forgives you, I won't.\"\n(To Jose Porla) \"My companions make my heart strong. If I'm fighting for those I love, I care not what happens to this body.\"\n(To Shô) \"If I don't wear my armor, I won't feel secure.\"\n(To herself) \"We don't die for our friends, we live for our friends\"\n(To Jellal Fernandes) \"I won't allow it! I won't allow you to die like this! You've committed crimes! You must remember everything! Don't think you can be at ease without knowing anything! Don't expect to be forgiven by the people who you've hurt! Live and struggle!\"\n(To Midnight) \"As long as you laugh at people's suffering, your goal will always out of reach. If you never want to be defeated, you must first learn your own weakness, and always be kind\"\n(To Jellal Fernandes) \"I wonder for how long... How long will I remain anchored at this harbor known as battle?\"\n(To Wendy) \"It is always sad to part with those whom you love but your companions will help you bear that sadness.\"\n(To Erza Knightwalker) \"Listen, Erza!! You've got the same evil and weakness in you that I have, so you must also have the same heart, which is capable of loving others! Listen for the voices of all living things with all your heart! They’re calling out with their true voices! You are not alone!\n(To Panther Lily) \"But what's important isn't the Magic, it's the heart of the wielder who uses it.\"\n(To Azuma) \"All I need is the power to be able to protect my comrades. So long as I can have the strength to do that, I don't care if I'm weaker than everyone in the world.\"\n(To herself) \"It's not that I was protecting everyone...I was the one always being protected.\"\n(To Jellal Fernandes) \"If you're going to say that you don't remember anything, I'll strike my sword on your heart and make you remember!\"\n(To Jellal Fernandes) \"Being alive...is a sign of strength!\"\n(To Cobra) \"Cobra ... You said that you are strong because you lost everything, doesn't it? But this isn't true strength! People become stronger when they have something to protect! If you have a true friend, that friend will support you! But you only think about yourself! Do you think you could actually hear the voice of this friend?! Don't you feel shame when you think of your friend?! Feelings by friends do not drag you down.\"\n(To Team Sabertooth) \"I don't care if you're the strongest or the top guild in Fiore, but I will tell you this. You've made enemies of the worst possible guild to piss off.\"\n(To Kagura Mikazuchi) \"This life was entrusted to me by Simon... by grandpa Rob... and my comrades... Relinquishing my life so easily would be a slap in the face to all of them.\"\n(To Moulin Rouge) \"We live with pride in our guild's name. This seal we've carved into ourselves isn't merely decoration. It's the proof of our bonds as a family. Binding our fates together we put our lives on the line. Anyone that steps on that holy vow... Be they evil or good, I will cut them down.\"\n(To Juvia Lockser) \"It's just one day... If lives were lost today... then today, lives were born. How important each and every day is... depends on how important you feel it is to you. Right?\"\n(To Kyôka) \"No matter what you try to steal from me... the light that lights my path cannot be stolen by anyone. Even if I cannot see, even if I cannot hear, there is a light within me. The path I have walked alongside my friends will light my tomorrow. I have nothing to fear!\" \n(To Team Natsu and Mest Gryder) \"The Master put his life on the line to buy time. That time was his gift to us! I shall not waste that gift! We will rebuild the guild hall, begin taking jobs once again, and fully revive Fairy Tail. I wish to see smiles on everyone's faces again. Those are my thought as the seven guildmaster. However... my thoughts as an individual member of the guild are different. We must rescue the Master!!!! Therefore, we will take action —just those of us gathered here!!!\"\nBattles & Events\nBattles\nEvents\nTower of Heaven Slaves vs. Tower of Heaven's Guards & Magic Troops\nErza Scarlet & Lucy Heartfilia vs. Eisenwald Guild Members\nErza Scarlet, Natsu Dragneel & Gray Fullbuster vs. Lullaby\nTeam Natsu vs. Village Monsters\nErza Scarlet vs. Natsu Dragneel\nErza Scarlet, Lucy Heartfilia & Happy vs. Deliora Survivors\nFairy Tail vs. Phantom Lord\nErza Scarlet vs. Aria\nErza Scarlet, Gray Fullbuster & Elfman Strauss vs. Jose Porla\nTeam Natsu vs. Team Jellal\nErza Scarlet & Shô vs. Ikaruga\nErza Scarlet vs. Jellal Fernandes\nErza Scarlet vs. Evergreen\nErza Scarlet & Natsu Dragneel vs. Laxus Dreyar\nAllied Forces vs. Oración Seis\nErza Scarlet vs. Midnight\nErza Scarlet vs. Lizardman\nErza Scarlet & Lucy Heartfilia vs. Daphne's Lizardmen\nErza Scarlet vs. Daphne's Lizardmen\nFairy Tail vs. Daphne's Lizardmen & Dragonoid\nNatsu Dragneel, Erza Scarlet & Gray Fullbuster vs. Blizzardvern\nErza Scarlet vs. Erza Knightwalker\nErza Scarlet vs. Erza Knightwalker: Rematch\nJuvia Lockser & Lisanna Strauss vs. Erza Scarlet\nErza Scarlet & Juvia Lockser vs. Meredy\nErza Scarlet vs. Azuma\nNatsu Dragneel, Lucy Heartfilia, Gray Fullbuster, Erza Scarlet, Wendy Marvell & Laxus Dreyar vs. Hades\nTeam Tenrou vs. Acnologia\nMakarov Dreyar, Erza Scarlet & Mirajane Strauss vs. Twilight Ogre\nErza Scarlet & Natsu Dragneel vs. Velveno\nTeam Natsu vs. Bandits\nGildarts Clive & Erza Scarlet vs. Byro Cracy\nTeam Natsu & Wendy Marvell vs. Dan Straight & Samuel\nErza Scarlet vs. Jiggle Butt Gang\nErza Scarlet vs. Jiggle Jugs Gang\nFairy Tail & Lyon Vastia vs. Byro Cracy\nFairy Tail, Lyon Vastia, Byro Cracy & Dan Straight vs. Reborn Oración Seis\nErza Scarlet, Evergreen & Max Alors vs. Cobra\nErza Scarlet vs. Cobra\nTeam Fairy Tail A vs. Grand Magic Games Participants\nErza Scarlet vs. Kagura Mikazuchi vs. Minerva Orland\nErza Scarlet vs. Kagura Mikazuchi\nErza Scarlet vs. Minerva Orland\nFairy Tail vs. Atlas Flame\nErza Scarlet & Jellal Fernandes vs. Motherglare's Miniature Dragons\nErza Scarlet vs. Minerva Orland: Rematch\nTeam Natsu & Gajeel Redfox vs. Celestial Spirit King (Eclipse)\nErza Scarlet & Mirajane Strauss vs. Tartaros Henchmen\nErza Scarlet vs. Kyôka\nErza Scarlet vs. Neo Minerva\nErza Scarlet vs. Kyôka: Rematch\nErza Scarlet vs. Jerome\nTeam Natsu & Makarov Dreyar vs. Ajeel Raml\nErza Scarlet vs. Ajeel Raml\nErza Scarlet, Kagura Mikazuchi & Jellal Fernandes vs. Neinhart\nErza Scarlet & Wendy Marvell vs. Irene Belserion\nTeam Natsu & Mercphobia vs. Kiria, Madmole & Skullion Raider\nErza Scarlet vs. Kiria\nTeam Natsu vs. Whiteout Mercphobia\nErza Scarlet vs. Whiteout Jellal Fernandes\nErza Scarlet vs. Whiteout Laxus Dreyar\nErza Scarlet & Wendy Marvell vs. Yoko\nTeam Natsu & Aquarius vs. Yoko\nErza Scarlet & Natsu Dragneel vs. Suzaku\nTeam Natsu vs. Alta Face\nTower of Heaven Slave Revolt\nErza Scarlet Joins Fairy Tail\nErza and Gray Join Team Natsu\nEisenwald Takes Oshibana Town's Station Hostage\nLullaby's Awakening\nGuild Master's Meeting Building is Destroyed\nThe Arrest & Trial of Erza Scarlet\nTitania Descends: Erza Joins the Fray\nThe Demon's Awakening: Deliora's Release\nMystery Revealed: Completion of the S-Class Mission\nBlast of Jupiter\nLights, Camera, Action! Team Natsu in a Play!\nJellal Fernandes' Arrest\nDance Ball at Balsamico Castle\nSky Labyrinth\nX791 Grand Magic Games Inauguration\nErza and Millianna Reunite\nPandemonium\nFun in Ryuzetsu Land!!\nTeams Fairy Tail A & B Unite\nGrand Magic Game\nThe Great Banquet\nStop Liberum!\nSaving the Spirit King\nMakarov Rescue Operation\nReferences\n↑ Fairy Tail Manga: Chapter 14, Page 13\n↑ 2.0 2.1 Fairy Tail Manga: Chapter 30, Cover\n↑ Fairy Tail Manga: Chapter 430, Pages 2-4\n↑ Fairy Tail Manga: Chapter 10, Page 11\n↑ Fairy Tail Manga: Chapter 438, Page 17\n↑ Fairy Tail Manga: Chapter 80, Pages 13-14\n↑ Fairy Tail Manga: Chapter 100, Pages 2-4\n↑ Fairy Tail Manga: Chapter 22, Page 20\n↑ Fairy Tail Anime: Episode 6\n↑ Fairy Tail Manga: Volume 22\n↑ Fairy Tail Manga: Chapter 10, Pages 12-15\n↑ Fairy Tail Manga; Chapter 89, Page 10\n↑ Fairy Tail Manga: Chapter 46, Page 5\n↑ Fairy Tail Manga: Chapter 178, Page 8\n↑ Fairy Tail Manga: Chapter 146, Pages 18-19\n↑ 16.0 16.1 16.2 Fairy Tail Manga: Chapter 91, Pages 15-20\n↑ Fairy Tail Manga: Chapter 77, Page 17\n↑ Fairy Tail Manga: Chapter 75, Page 14\n↑ Fairy Tail Manga: Chapter 131, Page 4\n↑ Fairy Tail Manga: Chapter 47, Page 12\n↑ Fairy Tail Manga: Chapter 261, Pages 19-20\n↑ Fairy Tail Manga: Chapter 281: Page 18\n↑ Fairy Tail Anime: OVA, Fairies' Training Camp\n↑ Fairy Tail Anime: OVA, Welcome to Fairy Hills!!\n↑ Fairy Tail Manga, Chapter 14, Pages 9-13\n↑ 26.0 26.1 26.2 Fairy Tail Movie: Priestess of the Phoenix\n↑ 27.0 27.1 27.2 27.3 Fairy Tail Manga: Chapter 14, Pages 11-12\n↑ Fairy Tail Manga: Chapter 81, Pages 17-19\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 44, Page 14\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 43, Pages 19-20\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 18, Pages 9-11\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 44, Page 16\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 105, Page 16\n↑ 34.0 34.1 Fairy Tail Manga: Chapter 112, Pages 14-15\n↑ Fairy Tail Manga: Chapter 58, Page 17\n↑ Fairy Tail Manga: Chapter 112, Pages 12-13\n↑ 37.0 37.1 Fairy Tail Manga, Chapter 112, Page 8\n↑ Fairy Tail Manga: Chapter 261, Pages 19-20\n↑ 39.0 39.1 39.2 Fairy Tail Anime: Episode 213\n↑ Fairy Tail Manga: Chapter 45, Pages 11-15\n↑ Fairy Tail Manga, Chapter 155, Pages 6-9\n↑ Fairy Tail Manga: Chapter 78, Page 18\n↑ Fairy Tail Manga: Chapter 192, Pages 11-14\n↑ 44.0 44.1 Fairy Tail Anime: Episode 38\n↑ Fairy Tail Manga: Chapter 10, Pages 10-11\n↑ Fairy Tail Manga: Chapter 11, Page 5\n↑ Fairy Tail Manga: Chapter 155, Pages 4-5\n↑ Fairy Tail Manga: Chapter 236, Pages 14-15\n↑ Fairy Tail Manga: Chapter 243, Pages 8-10\n↑ Fairy Tail Manga: Chapter 91, Pages 2-13\n↑ Fairy Tail Manga: Chapter 92, Pages 2-6\n↑ Fairy Tail Manga: Chapter 403, Pages 2-20\n↑ Fairy Tail Manga: Chapter 518, Pages 11-20\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 104, Pages 9-16\n↑ Fairy Tail Manga: Chapter 52, Pages 6-7\n↑ Fairy Tail Manga: Chapter 58, Pages 18-20\n↑ Fairy Tail Manga: Chapter 64, Pages 5-11\n↑ Fairy Tail Manga: Chapter 122, Pages 13-18\n↑ Fairy Tail Manga: Chapter 235, Pages 5-20\n↑ Fairy Tail Manga: Chapter 264, Page 16\n↑ Fairy Tail Manga: Chapter 265, Page 4\n↑ Fairy Tail Manga: Chapter 284, Page 10\n↑ Fairy Tail Manga: Chapter 284, Pages 16-19\n↑ Fairy Tail Manga: Chapter 312, Pages 13-15\n↑ Fairy Tail Manga: Chapter 404, Pages 8-13\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 44, Pages 6-11\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 99, Pages 17-18\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 105, Pages 4-20\n↑ Fairy Tail Manga: Chapter 64, Page 9\n↑ Fairy Tail Manga: Chapter 93, Page 2\n↑ Fairy Tail Manga: Chapter 93, Page 3\n↑ Fairy Tail Manga: Chapter 112, Page 4\n↑ 73.0 73.1 Fairy Tail Manga: Chapter 180, Pages 8-9\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 80, Pages 12-14\n↑ Fairy Tail Anime: Episode 99\n↑ Fairy Tail Manga: Chapter 321, Pages 14-15\n↑ Fairy Tail Manga: Chapter 322, Page 6\n↑ Fairy Tail Manga: Chapter 482, Page 19\n↑ Fairy Tail Manga: Chapter 519, Pages 2-4\n↑ Fairy Tail Anime: Episode 315\n↑ 81.0 81.1 81.2 81.3 81.4 Fairy Tail Movie: Dragon Cry\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 39, Pages 13-14\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 76, Page 14\n↑ Fairy Tail 100 Years Quest: Chapter 74, Page 17\n↑ 85.0 85.1 Fairy Tail Manga: Volume 9, Q&A\n↑ 86.0 86.1 Fairy Tail Manga: Chapter 104, Pages 4-8\n↑ Fairy Tail Manga: Chapter 14, Pages 10-11\n↑ Fairy Tail Manga: Chapter 91, Page 4\n↑ Fairy Tail Anime: Episode 26\n↑ Fairy Tail Manga: Chapter 58, Page 18\n↑ Fairy Tail Manga: Chapter 236, Page 8\n↑ Fairy Tail Manga: Chapter 192, Page 6\n↑ Fairy Tail Manga: Chapter 248, Page 14\n↑ Fairy Tail Manga: Chapter 60, Page 9\n↑ 95.0 95.1 Fairy Tail Manga: Chapter 243, Page 8\n↑ Fairy Tail Anime: Episode 26\n↑ 97.0 97.1 97.2 Fairy Tail Manga: Chapter 22, Page 13\n↑ 98.0 98.1 Fairy Tail Anime: Episode 10\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 16, Page 10\n↑ Fairy Tail Manga: Chapter 45, Page 3\n↑ Fairy Tail Manga; Chapter 45, Pages 4-10\n↑ Fairy Tail Manga: Chapter 45, Page 3\n↑ Fairy Tail Manga: Chapter 52, Pages 4-7\n↑ 104.0 104.1 104.2 104.3 Fairy Tail Anime: Episode 23\n↑ Fairy Tail Manga: Chapter 91, Pages 11-12\n↑ Fairy Tail Manga: Chapter 236, Pages 13-14\n↑ Fairy Tail 100 Years Quest Chapter 15: Pages 12-13\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 88, Page 9\n↑ 109.0 109.1 Fairy Tail: 100 Years Quest Manga: Chapter 44, Page 15\n↑ 110.0 110.1 Fairy Tail: 100 Years Quest Manga: Chapter 44, Pages 15-16\n↑ Fairy Tail Manga: Chapter 121, Pages 13-14\n↑ 112.0 112.1 112.2 112.3 Fairy Tail Anime: Episode 46\n↑ Fairy Tail Anime: Episode 73\n↑ Fairy Tail Anime: Episode 86\n↑ Fairy Tail Manga: Chapter 134, Page 15\n↑ Fairy Tail Manga: Chapter 314, Page 8\n↑ Fairy Tail Manga: Chapter 154, Pages 25-26\n↑ Fairy Tail Manga: Chapter 155, Page 9\n↑ Fairy Tail Manga: Chapter 155, Page 23\n↑ Fairy Tail Manga: Chapter 192, Page 7\n↑ Fairy Tail Manga: Chapter 193, Page 8\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 105, Pages 16-18\n↑ Fairy Tail Manga: Chapter 205, Page 2\n↑ Fairy Tail Manga: Chapter 205, Page 5\n↑ Fairy Tail: 100 Years Quest Manga Chapter 190, Pages 14-15\n↑ Fairy Tail: 100 Years Quest Manga Chapter 191, Page 14\n↑ Fairy Tail Manga: Chapter 205, Page 2\n↑ Fairy Tail Anime: Episode 99\n↑ Fairy Tail Manga: Chapter 458, Page 3\n↑ Fairy Tail Manga: Chapter 236, Page 13\n↑ 131.0 131.1 Fairy Tail Manga: Chapter 322, Pages 5-7\n↑ Fairy Tail Manga: Chapter 322, Page 8\n↑ Fairy Tail Manga: Chapter 372, Page 16-17\n↑ Fairy Tail Manga: Volume 44, Inner Sleeve\n↑ Fairy Tail Manga: Chapter 372, Page 17\n↑ Fairy Tail Manga: Chapter 431, Pages 12-14\n↑ Fairy Tail Manga: Chapter 431, Page 15\n↑ Fairy Tail Manga: Chapter 431, Page 12-19\n↑ Fairy Tail Manga: Chapter 515, Page 20\n↑ Fairy Tail Manga: Chapter 516, Pages 17-18\n↑ Fairy Tail Manga: Chapter 516, Pages 17-18\n↑ 142.0 142.1 Fairy Tail Manga: Chapter 457, Page 19\n↑ Fairy Tail Manga: Chapter 458, Page 5\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 79, Page 11\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 79, Pages 11-14\n↑ Fairy Tail Manga: Chapter 13, Page 6\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 79, Pages 12-14\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 183, Pages 6-8\n↑ Fairy Tail: 100 Years Quest Manga Chapter 182, Page 15\n↑ Fairy Tail: 100 Years Quest Manga: Chapter 183, Page 8\n↑ 151.0 151.1 Fairy Tail Anime: Episode 212\n↑ 152.0 152.1 152.2 Fairy Tail Anime: Episode 219\n↑ Fairy Tail Anime: Episode 75\n↑ Fairy Tail Manga: Chapter 102, Pages 8-14\n↑ Fairy Tail: Episode 145\n↑ Fairy Tail Anime: Episode 146\n↑ 157.0 157.1 Fairy Tail Anime: Episode 149\n↑ Fairy Tail: Episode 150\n↑ Fairy Tail: Episode 167\n↑ Fairy Tail Manga: Chapter 100, Pages 1-6\n↑ Fairy Tail Manga: Chapter 112, Page 11\n↑ Fairy Tail Manga: Chapter 100, Page 28\n↑ Fairy Tail Manga: Chapter 261, Page 19\n↑ Fairy Tail Manga: Chapter 430, page 3\n↑ Fairy Tail Manga: Chapter 429, Pages 15-18\n↑ Fairy Tail Manga: Chapter 266, Page 14\n↑ Fairy Tail Anime: Episode 208\n↑ Fairy Tail Manga: Volume 5 Bonus, Super Supplement\n↑ Fairy Tail Manga: Volume 60 Afterword\n↑ Fairy Tail Manga: Volume 10 Afterword\n↑ Fairy Tail Manga: Omake, Welcome to Fairy Hill!, Page 18\n↑ Fairy Tail Manga: Chapter 104, Page 9\n↑ Fairy Tail Manga: Volume 22, Q&A\n↑ Fairy Tail Manga: Volume 2, Page 190\n↑ Fairy Tail Manga: Chapter 129, Cover Page\n↑ Fairy Tail Manga: Chapter 129, Page 7\n↑ Fairy Tail Special: Grand Magic Games Guidebook\n↑ Fairy Tail Manga: Chapter 10, Page 13\n↑ Fairy Tail Manga: Chapter 60, Page 10\n↑ Fairy Tail Manga: Chapter 77, Page 16\n↑ Fairy Tail Manga: Chapter 100, Pages 28-29\n↑ Fairy Tail Manga: Chapter 147, Pages 3-4\n↑ Fairy Tail Manga: Chapter 155, Page 20\n↑ Fairy Tail Manga: Chapter 193, Pages 16-17\n↑ Fairy Tail Manga: Chapter 200, Page 7\n↑ Fairy Tail Manga: Chapter 235, Page 10\n↑ Fairy Tail Manga: Chapter 237, Pages 14-16\n↑ Fairy Tail Manga: Chapter 146, Page 6\n↑ Fairy Tail Manga: Chapter 264, Page 8\n↑ Fairy Tail Manga: Chapter 292, Page 11\n↑ Fairy Tail Manga: Chapter 315, Pages 5-6\n↑ Fairy Tail Omake: She's Erza!!, Pages 18-19\n↑ Fairy Tail Omake: 413 Days, Pages 17-18\n↑ Fairy Tail Manga: Chapter 403, Pages 17-19\n↑ Fairy Tail Manga: Chapter 440, Pages 7-8\nTitles\nGuild Master of Fairy Tail\nPreceded by\nYears\nSucceeded by\n← Makarov Dreyar\nX792\nMakarov Dreyar →\nNavigation\n"
}