{
  "requested_name": "Holo",
  "resolved_title": "Holo",
  "url": "https://spice-and-wolf.fandom.com/en/wiki/Holo",
  "summary": "Holo (ホロ, Horo) is the deuteragonist of Spice and Wolf. She is a nonhuman, a wolf spirit that lives in the wheat. Originally from Yoitsu, Holo traveled south eventually arriving at Pasloe where she settled down as the village's wheat goddess. After centuries of watching over Pasloe, she escaped from the field she had been living in by inhabiting the wheat on a merchant's cart. She joined the merchant, Kraft Lawrence, on his travels thereafter. ",
  "full_text": "Holo\nHolo (ホロ, Horo) is the deuteragonist of Spice and Wolf. She is a nonhuman, a wolf spirit that lives in the wheat. Originally from Yoitsu, Holo traveled south eventually arriving at Pasloe where she settled down as the village's wheat goddess. After centuries of watching over Pasloe, she escaped from the field she had been living in by inhabiting the wheat on a merchant's cart. She joined the merchant, Kraft Lawrence, on his travels thereafter. \nWhen they decided to settle down, they picked Nyohhira where they opened the Spice and Wolf bathhouse before marrying. Holo operates the bathhouse alongside Lawrence. After their daughter, Myuri, sneakily joined Tote Col on his travels, Holo and Lawrence began traveling again.\nAppearance\nHolo can take on two different forms: one of a giant wolf—her true form—and the other of a human woman.\nHer wolf form is slightly larger than an elephant, with wheat-brown fur covering the upper half of her body while the rest is off-white. Her eyes are red with yellow sclera, giving her a fierce and majestic appearance.\nIn her human form, Holo appears as a slender, light-skinned woman with striking red eyes and long, flowing light brown hair that reaches her waist. She possesses a pair of wolf ears atop her head and a long, thick wolf tail with a white tip, both matching the fur of her wolf form. She has a graceful and well-proportioned figure, which, combined with her confident demeanor, adds to her undeniable charm. Because her beast-like features could attract unwanted attention from the Church, she tends to cover her ears with hoods or hats and hides her tail beneath long, flowing skirts or hooded cloaks.\nThe outfit she initially wore consisted of a purple shirt with a black fur-lined vest, a black skirt, black and white pants, and a long beige hooded robe, lined with black bear fur.\nAfter these clothes were destroyed, Holo purchased a pink shirt with purple trim, black pants with matching cuff trim, a red silk sash, a light blue anklet on her right ankle, two high-quality hooded robes, and cow leather traveling shoes. Later, she acquired a headscarf made of white rabbit fur trimmed in dark red and a black-collared short cape fastened with a walnut button and matching trim.\nSoon after meeting Lawrence, she began wearing a red drawstring pouch attached to a brown leather cord around her neck.\nIn Spice and Wolf VR and VR2, she is seen wearing a long white and cream dress with brown leather shoes, and her hair is braided.\nHolo in her wolf form in the 2008 version.Holo in her wolf form in the 2024 version.\nPersonality\nHolo is smart and confident, though the latter is mostly seen around Lawrence. She is considered to be flirtatious and manipulative towards him, while often mocking his thinking and negotiating skills to the point of annoying him. However, she seems to have a really deep fear of being alone, and having grown fond of Lawrence as her company, she nurtures a strong affection for him, although Lawrence doesn't noticed it until Season 2. She is also seen to feel uneasy about showing him her wolf form, but will do so in order to protect him, even if it means putting her life at risk. She is usually good-humored and talkative. She speaks in a formal manner that might be expected of people during her younger centuries, and rarely, if ever, uses contractions. \nHolo has a love for alcohol, often drinking when having the chance to do so and usually getting drunk because of it, though is still somewhat able to sustain her wit. She is also somewhat of a glutton. She often convinces Lawrence, usually using her feminine charm, to buy her food, which is usually in large quantities and, at times, expensive. A perfect example of this was when she bought over 80 apples, her favorite food, with Lawrence's money without him knowing about it. She also appreciates how different human food is compared to foraging in the forest, especially how cooking changes it.\nHolo does experience jealousy toward other girls who talk to Lawrence, as she considers herself his lover during Season 2. One instance of this was shown during her and Lawrence's meeting Nora Arendt. Holo was against hiring Nora as a bodyguard not only because they didn't really need one, but also for the fact that Nora and Lawrence became close very quickly, which caused her to start seeing Nora as her main rival even though Lawrence doesn't consider Nora a love interest. Shepherds being a natural enemy of wolves also factored in to Holo's initial dislike of Nora. Holo is a very proud \"wolf\" but does understand that she does not know everything; an example of this is when Lawrence explains how people get sick via the four humors and that the only way to heal her fever was drinking sydra.\nIn the game, Holo still maintains her mischievous and playful behavior, but now she's more attentive, careful and more strict with Myuri, who always makes messes, but she also constantly displays a loving and caring side to Lawrence, playing with him (even he constantly plays with her) and also reacting lovingly to his flirting advances, something Myuri makes them both get embarrassed.\nHistory\nHolo is a nonhuman that was bound by a promise to the town of Pasloe for several centuries, ensuring a bountiful harvest of wheat for the residents. As the villagers became more self-reliant with time, however, Holo was neglected. Feeling unneeded and that she had kept her promise long enough, she skipped town with a traveling merchant named Lawrence, by 'jumping' from the villagers' wheat to Lawrence's wheat in his wagon. She longs to return to Yoitsu, her snowy homeland and makes a contract with Lawrence to accompany her there.\nPlot\n\nRelationships\n\nKraft Lawrence\nHolo met Lawrence when she stowed away in his card by transporting herself into the wheat in his cart, at first Lawrence was afraid of her as she revealed her true form to him, however Lawrence allowed Holo to travel with him and had her pose as his wife to avoid any suspicion, this brought a smile to Holo and she would tease him about it. Their bond grew over their travels each expressing their loneliness to one another and that they both hate waking up alone. Holo and Lawrence eventually married, opened a bathhouse together and had a daughter named Myuri. \nNorah Arendt\n\nMyuri\nHolo loves her daughter and always reads her stories \nFermi Amati\nHolo met Amati when she and Lawrence arrived win Kumerson, Holo wished to try the local fish and Amati was able to procure her some. Holo's opinion of Amati plummeted when He challenged Lawrence for ownership of her, Holo was angered by this as she was a person and not a pet or object that could be bought, she also hated how Amati treated the man she loved so she worked behind the scenes with Dian Rubens and ruined Amati. Holo also hated that Amati was going to force her to marry him as he forged a marriage certificate without asking her if she felt the same \nDian Rubens\nHolo sort her help in procuring Pyrite to destroy Amati and ensure that she got to stay with Lawrence \nAbilities\nHolo is a wolf nonhuman and because of this, she has several abilities.\nTransformation: Holo has the power to transform instantly into a massive wolf. In this form, she can move at high speeds, much faster than any other known land-bound creature, due to her large size accompanying the appropriate musculature and stride. She also uses her huge jaws in order to defend herself and Lawrence. To activate this form, she must either consume wheat or fresh blood. She can also transform only part of herself, such as one limb, but this takes several moments and puts a strain on her. Clearly, she is not used to doing so and it requires quite a bit of concentration.\nHeightened sense of smell: This ability can be used both in her wolf and human form. Like most canines, wolves have an excellent sense of smell and can pick up a particular scent from distances far greater than humans. This allows Holo to be able to detect dangers such as wolves and other people much quicker than Lawrence.\nEternal youth: Holo has lived for many centuries and is not visibly aged past 15 years old (at least in her human form). She credits her wisdom from the experiences her long life has given her. However, she is not immortal; she explains that if the wheat she dwells in is destroyed, she would disappear.\nEnhanced hearing: Being a wolf, Holo has great hearing. She is able to hear tiny sounds much farther away than humans, or from the other side of solid walls and floors. Her ears are so sensitive that she can hear the subtle differences in the purity of coins by shaking them together. Holo's ears also have the ability to determine if a person is telling a lie or not. However, she admits it's not 100% accurate.\nIntense howl: While she can howl perfectly well in human form, Holo can muster an extremely loud and powerful howl after taking a very deep breath. In an enclosed space, it can crack and disturb stonework. It was used in the underground tunnels of Pazzio to scare off a pack of tracking dogs. However, doing so is like intense, prolonged screaming that hurts the vocal cords, causing coughing and a sore throat.\nAccelerated crop growth: Holo can cause nearby crops such as wheat or rye to grow and wither faster if needed almost instantly. However, since the crops need a great amount of nutrients from the ground that can only be replenished naturally, doing so puts great stress on the soil. Holo understands this cycle well, and when she first arrived in Pasloe, had warned that poor harvests were naturally inevitable for the fields to recover from several years of bountiful harvests.\nGallery\nMain article: Holo/Gallery\nQuotes\nAll quotes are from the English dub of the anime adaptation.\n“A trip is the most fun before one sets out on it. With dogs, the bark and not the bite is more frightening and women are almost always prettier when they are shrouded in mystery. I can never be as pretty as you imagine and I would never do something like that to you. Would it not be better to imagine?” (to Zheren, Season 1, Episode 2)\n\"Stupid potato!\" (Season 1, Episode 2)\n“When a person lies, what is important is not the lie itself. No, it is their reason. Their why.” (to Lawrence, Season 1, Episode 2)\n“If you only get upset when you are tricked, you will not go very far.” (to Lawrence, Season 1, Episode 3)\n“All men are jealous idiots. And women are stupid too, to feel happy about it. It's true, there are idiots everywhere!” (to Lawrence, Season 1, Episode 3)\n\"I do not want to wake from my dream and discover that I am all alone. I am tired of being alone! I do not want to be cold! I do not want to be lonely!\" (to Lawrence, Season 1, Episode 4)\n“Loneliness is a disease that can lead to death. They might as well be the same thing.” (to Lawrence, Season 1, Episode 4)\n“I am pretty, so human males have been known to fall for me. So it would be wise to remember I am too strong for a human. I am a wolf you know. I did warn them, 'Touch me and I will tear your thing off!' And can you believe, not one of them did.” (to Lawrence, Season 1, Episode 5)\n“I need to have a drink, and I need one soon!” (to Lawrence Season 1, Episode 6)\n“I want you to please understand the scales of my heart will always be swaying back and fourth. But there is something you should know. I will never lean to one side or the other due to the weight of gold coins.” (to Witz, Season 1, Episode 6)\n“Males burned with jealousy are too sweet to eat!” (to Lawrence, Season 1, Episode 6)\n“I know it's difficult to look past my brilliant tail, brain and looks, but I also have excellent ears and eyes.” (to Lawrence, Season 1, Episode 7)\n“When you are experienced you can become overly confident and such confidence can prove fatal. I thought you learned this lesson from Chloe.” (to Lawrence, Season 1, Episode 7)\n“Stop pouting! You learned something valuable. Remember the lesson, not the disappointment.” (to Lawrence, Season 1, Episode 7)\n“It appears that human males do not mind having several females around.” (to Lawrence, Season 1, Episode 8)\n“Remember when I spoke of men being kind to women? Men should be measured by their kindness. However I am not your charity, and I have a tendency to consider things from only my perspective. A blink of an eye in my world is a lifetime in yours. A year or two is understandably precious to you. I forgot. I do not wish to waste your time.” Season 2 episode 1\n“I believe I am drunk. I will put myself to bed before I say anything else I regret.” Season 2 episode 1\n“Good grief! I believe you to be much cuter when you are panicking.” Season 2 episode 3\n“Even if you have answers, you cannot always tell them to others. It is the way of the world.” Season 2 episode 3\n“I am delicate, do not step on my feet!” Season 2 episode 3\n“Pain makes one wise!' Season 2 episode 6\n“For your information I am quite aware that you have been put through extraordinary distress after extraordinary distress since we began traveling together. However, do hope you'll remember that none of the trouble we experienced was my fault! The first for example, well I guess that was partially my fault.” Season 2 Eisode 7\n“You are desperate for me to tease you. I still believe you to be adorable.” Season 2 episode 7\n“Even when wolf packs are having a violent war over territory, the forest looks as calm as it always does from a distance.” Season 2 episode 8\n“I am helping you because I believe in you with all my heart.” Season 2 episode 10\n“Men are onions. Many layers and all of them make you cry.” Season 2 episode 10\n“I have no fear of watching you grow old while I remain young. I'll even watch you on your death bed. I am no stranger to death. But your heart is like that of an innocent child. It has always accepted everything about me, without hesitation. Because of that, I am very afraid.\" Season 2 episode 11\n“There is no better time to part, than when we wish for it never to end.” Season 2 episode 11\n“Once you taste poison, you might as well finish the meal. If it comes to that you would make as fine a dish as any.” Season 2 episode 11\n“I am going to drink so much that I vomit before I even start to feel drunk.” Season 2 episode 11\nTrivia\nThere was confusion on whether or not her name is spelled Horo or Holo, due to the known difficulty of discerning the letters L and R in Japanese. Yen Press has said that they were instructed by the Japanese licensor that her name was indeed Holo, and Funimation has also used Holo in the English dub of the anime. In Episode 4 of Season 2, Holo's signature is shown as \"Holo.\" Despite that author Isuna Hasekura himself stated that both Holo and Horo are correct forms of her name, and their usage differs in few languages.\nHolo snores in her sleep. However, she denies it every time it is brought up.\nShe appears in episode 01 of the anime, Durarara!! as a cardboard cut out that Mikado Ryuugamine accidentally bumps into upon arriving in Ikebukuro.\nShe also appears later in episode 20 as a figurine holding a yellow flag inside a manga shop. She is then shown fighting Taiga Aisaka from Toradora during the explanation of the origins of the Yellow Scarves.\nShe briefly appears in the eighth episode of Eromanga Sensei as Yamada Elf gives a speech about defeating Dengeki Bunko, the publisher of the Spice and Wolf and Eromanga Sensei light novels. She is shown with a menacing grin and glowing red eyes while holding gold coins in between her fingers.\nReferences\n↑ Spice and Wolf, Vol. 1, p.24\n↑ Volume 2. Retrieved July 29, 2021."
}