{
  "requested_name": "Maki Zenin",
  "resolved_title": "Maki Zenin",
  "url": "https://jujutsu-kaisen.fandom.com/en/wiki/Maki_Zenin",
  "summary": "Maki Zenin (禪院真希, Zen'in Maki?) is a major supporting character in Jujutsu Kaisen and one of the main protagonists of its prequel, Jujutsu Kaisen 0: Jujutsu High. She is currently a second-year at Tokyo Jujutsu High. Daughter of Ogi Zenin and the elder twin sister of Mai Zenin, Maki was born in the Zenin Clan. ",
  "full_text": "Maki Zenin\nMaki Zenin (禪院真希, Zen'in Maki?) is a major supporting character in Jujutsu Kaisen and one of the main protagonists of its prequel, Jujutsu Kaisen 0: Jujutsu High. She is currently a second-year at Tokyo Jujutsu High. Daughter of Ogi Zenin and the elder twin sister of Mai Zenin, Maki was born in the Zenin Clan. \nBorn a non-sorcerer in one of the Big Three Sorcerer Families, Maki was constantly mistreated and felt compelled to expel herself from the Zenin clan. She aspires to be a great jujutsu sorcerer to spite her family, working closely with her friends Panda and Toge Inumaki, while also serving as a role model to the first-year students.\nQuick Answers\nWhat is Maki Zenin's role in Jujutsu Kaisen?\n\t\t\t\t\t\tMaki Zenin, a significant character in Jujutsu Kaisen, also features as a main protagonist in the prequel, Jujutsu Kaisen 0: Jujutsu High. She studies in the second year at Tokyo Jujutsu High. Despite being born into the Zenin Clan, one of the Big Three Sorcerer Families, she has less cursed energy than a non-sorcerer and faced mistreatment, leading to her departure from the clan. She is the elder twin of Mai Zenin.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Community\n\t\t\t\t\t\nWho are Maki Zenin's family members in the Zenin Clan?\n\t\t\t\t\t\tMaki Zenin, a former member of the Zenin Clan and student at Tokyo Jujutsu High School, has several family members within the clan. These include her father, Ogi Zenin, an unnamed mother, her twin sister, Mai Zenin, cousins Naoya Zenin and Toji Fushiguro, Uncle Naobito Zenin, and second nephew, Megumi Fushiguro.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Community\n\t\t\t\t\t\nWhy did Maki Zenin leave the Zenin Clan?\n\t\t\t\t\t\tMaki Zenin departed the Zenin Clan due to their oppressive behavior, including hindering her advancement due to her low cursed energy and forcing her twin, Mai, into sorcery. She joined Tokyo Jujutsu High to enhance her abilities, despite the clan's efforts to thwart her. Her ambition to lead the clan intensified after Mai's death, resulting in Maki retaliating against the Zenin Clan.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Fandom\n\t\t\t\t\t\nWhat is Maki Zenin's relationship with her twin sister, Mai?\n\t\t\t\t\t\tMaki Zenin, despite promising to never leave her twin sister Mai, pursued her own ambitions, leading to their separation. This forced Mai to become a sorcerer against her will, causing resentment towards Maki. Mai's attempts to defeat Maki with her cursed technique were unsuccessful due to Maki's superior skills, intensifying the sibling rivalry.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Fandom\n\t\t\t\t\t\nWhat is Maki Zenin's goal after leaving her family's clan?\n\t\t\t\t\t\tMaki Zenin, after her self-expulsion from the Zenin clan, aims to become an accomplished jujutsu sorcerer and the head of her former family. Despite her inability to see cursed spirits, she hones her skills and serves as a mentor to first-year students. Her ambition is met with resistance from the Zenin clan, who attempt to hinder her advancement in the sorcerer ranks.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Fandom\n\t\t\t\t\t\n{\"@context\":\"https:\\/\\/schema.org\",\"@type\":\"FAQPage\",\"name\":\"Maki Zenin\",\"mainEntity\":}\nAppearance\nMaki is a young woman above average height with an athletic build. She has small golden eyes and long black hair (dark green in the anime) normally tied into a short ponytail. She had fringes of hair over her forehead with smaller strands framing her cheeks and used to sport different pairs of glasses that allowed her to see curses. \nWhile still a member of the Zenin clan, Maki wore a traditional outfit, a white yukata, and a black hakama. Maki's original Jujutsu High student uniform consisted of the traditional long sleeve jacket with a pencil skirt. As a first-year student, she wore thick, long tan socks and black shoes with her uniform. As a second-year Maki wore a different pair of glasses and sported black leggings instead of socks.\nWhile training for the Goodwill Event, Maki wore a purple tracksuit a black jersey with tan shorts over her leggings. While training Yuta Okkotsu, Maki wore the same top with darker shorts. Her casual clothes consisted of a cyan hoodie over a white shirt with pink horizontal stripes, white shorts over black leggings, and white boots.\nMaki as a first-year student at Tokyo Jujutsu High.Maki as a first-year student at Tokyo Jujutsu High (manga).Maki's initial appearance as a second-year.Maki's initial appearance as a second-year (manga).\nPost Shibuya\nMaki was severely burned by Jogo's flames during the Shibuya Incident. This has left a great deal of her body covered in scars from the severe burns, running all the way up and down both her arms and the sides of her face. Her hair now only reaches just past her ears, which may be a result of her cutting it, or it may have been partially or entirely burned off. And overtime from training while she recovered from her injuries developed a more robust physique than before. \nMaki decided to alter her uniform to keep her arms mostly uncovered. She wore a sleeveless, turtle-neck, black shirt underneath a large cape attached by two Jujutsu High pins on each side. The shirt tucked into a large brown belt with a gold buckle, tied around the waist of tight black pants. The glasses she paired with this outfit were circular but Maki's right eye was covered in bandages from the burns.\nDuring her conflict with the Zenin Family, Maki lost her right eye altogether and now has a scar where it was sliced by her father's katana. She ditched the cape but sports mostly the same outfit, with the same sleeveless shirt paired with the same pants, belt, and shoes. By the time she entered the Culling Game, Maki reclaimed her cape and had her right eye completely healed.\nMaki's appearance immediately following the Shibuya Incident (gray).Maki's appearance during her conflict with the Zenin clan.Maki's current appearance.Maki's current appearance (gray).\nPersonality\n \nMaki is a very headstrong and straightforward person who tries to drive herself forward without needing anyone else's help. She is extremely strong-willed, capable, and motivated to escape the standards that have been set for her by people who are supposed to be her family. \nIn a sorcerer clan, strong cursed techniques are everything, but Maki couldn't even see curses. Women in sorcerer clans have to stand out even more, leading Maki to be constantly severely mistreated and abused by the Zenin clan. Despite feeling cursed by her own blood, Maki motivates herself to become a strong sorcerer regardless of what her family thinks. She wants to break apart the foundation of their way of their life and reject it completely. \n \nMaki can come off as rather cold at times, even to her classmates. She is the leader type but Maki is very tough on others and tends to be impatient and hot-tempered. Maki doesn't seem to respect Satoru Gojo as a person due to his very goofy attitude. Even as her teacher and senior, Maki often refers to him as a moron. She was initially very mean to Yuta because of his shy attitude and openly told him he had no business attending Jujutsu High as a cursed human.\nWhile working on a mission together, Maki and Yuta learned to understand one another and she realized they weren't so different. She asked Yuta why he enrolled in the school and he told her that he wanted it to be acceptable for him to live. Maki told him that's what Jujutsu High is all about and encouraged him to use his curse to save people.\n \nMaki trained Yuta harshly because she wants to see him get stronger and fight beside her. Something she would later impart on to Megumi and Nobara as their senpai. She's taught them all highly advanced situational awareness and how to properly wield a variety of weapons, even if they had to get beaten up a lot in the process.\nMaki has repressed many of her emotions to maintain her trademark tough exterior. She hasn't expressed romantic interest in anyone and Panda enjoyed teasing her about this as first-years. When it came to Yuta, this embarrassed Maki enough to lash out at Panda in a temper.\n \nFollowing their first encounter with Suguru Geto, Maki and Yuta talked about why Geto referred to her as the \"failure of the Zenin clan\". Maki initially played it off as if being born a non-sorcerer gave her a perfect excuse to leave because she hated the clan for a variety of other reasons. When Yuta inquired as to why Maki chooses to be a sorcerer and Maki said it's because she's got a bad personality and wants to be a grade 1 sorcerer to spite the Zenin clan. \nYuta admires Maki's strength and revealed he wants to be like her, strong and resilient. Yuta awkwardly offered to help her stick it to the Zenin clan but called him an idiot and said it was something she needed to do alone. She had spent so long rejecting the need to feel accepted that she became flustered that Yuta kindly recognized her strength. Maki left the conversation to gain her composure and then reminded herself that she should not go feeling like she's finally been recognized.\n \nAs a second-year student, Maki carries an aura of leadership and guides her juniors appropriately. She gravitates toward Megumi Fushiguro because he's also an ex-member of the Zenin clan and they get along well. She's comfortable with teasing him even if it's harsh and this can make her come off as a \"cold-hearted demon\" at times. When she found Megumi sulking with Nobara Kugisaki, she jokingly asked them if they had just attended a funeral. However, this was ironically after their classmate, Yuji Itadori's death. This made Maki feel really guilty and as usual, she lashed out at Panda in a rage for not informing her sooner. Even after the accident, Maki was still unsure if taking it easy on the first-year students would've even been a kindness.\nMaki is someone with a chip on her shoulder and is always determined to prove herself. For the Kyoto Goodwill Event, she needed strong teammates to help showcase her abilities on a public stage where she couldn't be denied. She encouraged Megumi and Nobara to get stronger for their fallen ally and figured it was the perfect opportunity to put her juniors in their place.\n \nMaki doesn't appear to be concerned with the moral aspects of being a sorcerer and is more focused on personal goals. While training, Megumi asked Maki what kind of people she wanted to save as a sorcerer but she doesn't think about that kind of stuff. This clearly annoyed Megumi which in turn angered Maki. She decided to compromise and told Megumi they could talk about it if he improved his skills in hand-to-hand combat enough to challenge her.\nAs a child, Maki promised her twin sister Mai that she would stay with her forever. However, as Maki grew older she realized she couldn't live under the thumb of the oppressive family while Mai was content with doing so. Leaving Mai behind led the only person Maki cared about in the clan to resent her as well. Mai was punished for Maki leaving by getting pressured into becoming a sorcerer even though she wanted to live a normal life. She grew to hate Maki by the time they were both in Jujutsu High.\n \nMai treated Maki as if she was worthless because she lacked significant cursed energy. This is the same type of ridicule most of the Zenin clan threw at Maki all her life, so it didn't appear to bother Maki all that much. In the stance where Mai and Nobara got in a fight, Maki told her twin that they were both worthless because Mai isn't that talented herself, only able to charge weapons with cursed energy. \nThis revelation surprised Nobara, who asked the same question Yuta did, why would Maki want to become a sorcerer. Maki simply told her that she wanted to prove her family wrong by becoming a great sorcerer. Nobara expressed her profound respect but Maki didn't make a big deal out of it. During the planning phase of the Goodwill Event, Maki overheard Nobara telling Yuji about her circumstances and how they have to win to prove the Zenin clan wrong. At the time, it annoyed her, but only because Maki doesn't want the others to worry about her. Recalling her classmate's acknowledgment of her ability, later on, made Maki smile.\n \nMaki didn't actively try to repair her relationship with Mai and engaged in their sibling rivalry to a degree. After defeating Mai, Maki is asked to explain why she didn't stay at the bottom and fall down the hole with her sister. This saddened Maki, who replied that she would've hated herself and apologized to Mai for leaving. Maki walked away without a clear resolution and continued the event, leaving their relationship still fractured.\nIn spite of their troubled past, Maki was able to operate cordially on missions with other members of the Zenin clan. She shared a squad with the head of the clan during the Shibuya Incident. Naobito Zenin was acting very lazy in Shibuya so Maki took over the leadership role to help guide Nobara and Akari Nitta. She would tell them to ignore him whenever he would ask for anything off mission.\n \nMaki and Naobito eventually split off and met up with Kento Nanami, and were quick to stir up tension with each other. Naobito mentioned that he wouldn't mind if Satoru stay sealed and Maki told him to leave Shibuya if he wasn't going to be any help. Naobito argued that Maki should be the one to leave and Nanami agreed that the fighting in Shibuya had escalated to a degree far too dangerous for her. She ignored this and claimed she'd be more help than a drunk like Naobito, causing Nanami to become more annoyed with him for drinking on the job. However, this was before Maki ever saw Naobito's capabilities as a sorcerer. She and Nanami were taken back by Naobito's speed and Maki even begrudgingly admitted that Naobito saved her life against Dagon. This was humiliating for Maki but she continued to fight in sync alongside Naobito and Nanami in an attempt to exorcise the cursed spirit.\n \nMaki doesn't take well to taunts and is quick to insult anyone back regardless of who they are. Inside his domain, Dagon called Maki the weakest there. After surviving a hard hit that surely injured her, Maki responded by boldly taunting Dagon and confronting the special grade directly again. Maki told the \"octopus\" that if he's going to call her weak, then he should've killed in her with that one hit. Maki was also annoyed with herself for not taking Playful Cloud out earlier in preparation for tougher battles instead of waiting for permission. She was happy to see Megumi when he invaded the domain and gave her Playful Cloud. She smiled and her way of expressing gratitude to her junior was calling Megumi a cocky brat.\n \nMaki was severely scarred and injured as a result of the fighting in Shibuya, but she's not the type to ever make a big deal out of it. Yuta reunited with her after some time and expressed his concern but Maki claimed she was fine. When Yuki acknowledged what happened and commended Maki's toughness, Maki simply replied that it was not like she was going for it.\nEven in a team of unlikely allies compiled to combat the Culling Game, Maki's leadership skills helped everyone keep in line with their roles for rescuing Tsumiki Fushiguro. She was the one who suggested that Yuji and Megumi recruit Hakari despite his bad attitude because their group is shorthanded and needs all the help they can get.\n \nWhen the opportunity presented itself for Maki to push for head of the clan, she couldn't bring herself to do so. With Naobito's death, Megumi became head of the Zenin clan due to a special clause. Megumi didn't want to accept the position but Maki implored him to do it. She tried to convince him of all the luxuries that came with being clan, but typical Megumi refused and asked her to do it instead. Irritated, Maki told him no one would accept her and started yelling, listing off all the reasons Megumi would make a decent head before adding barely at the end. Megumi refused still and argued acceptance wouldn't matter but Maki wasn't just good enough to them, but good enough for herself either. Maki believed she still wasn't able to make the clan somewhere Mai could feel she belonged.\nMaki's complicated relationship with her family was on full display when she returned to the Zenin clan to collect cursed tools. Despite having the clan head's permission, Maki was still constantly harassed on her way there. She ignored both Naoya and her mother's harsh words and pressed on to the vault. Maki's own father conspired against her, attempting to execute Megumi along with the twins. Maki fought against him bravely and tried to save Mai, but was defeated and gravely injured, leaving Maki to be the one saved by Mai. \n \nMaki was forced to say goodbye to her sister too soon, marking a massive change in her personality. Inside a dream-like space, Mai explained that she was going to sacrifice herself while distancing herself from Maki. During that conversation, Maki listened to Mai's explanation but she was constantly trying to close that distance. She didn't want to let go of Mai, before they ever truly got a chance to reconcile, but was forced to accept this was the end. In exchange for Mai giving everything to ensure Maki reached her potential, Maki promised to destroy everything. Maki was devastated by her sister's death but had no time to mourn and had to carry out Mai's request immediately, killing their father in cold blood. Immediately after, Maki was ready to continue and looked to the last thing her sister left for her, a sword. With a cold and remorseless disposition, Maki looked to the sword and told Mai \"lets get started.\".\n \nMaki ruthlessly annihilated the entire Zenin clan without any expression of emotion. She slaughtered every member of the Hei and the Kukuri unit present that day without a hint of remorse. The only words she exchanged with anyone were with Naoya when he asked if she had a human heart. This was after she decapitated Jinichi and tossed his severed head into a pond. Her reply was simply: \"No... it was taken from me.\". He also tried to call Maki an imposter during their fight but Maki interrupted him by smashing his face with a punch. Then she taunted him by asking him if he could repeat that statement.\nIn the midst of her ruthless tirade, Maki still wanted to believe there was good left in her family. Before killing her own mother, Maki attempted to see if her mom was trying to warn her about Ogi's trap back when she harassed Maki upon her return. However, Maki was assuming the best of her mother and appeared disappointed when she didn't get a fortunate answer. Maki's own mother fell way to her vengeful wrath and even after that, Maki left Mai's body with Momo Nishimiya and killed off the rest of the clan members who weren't present that day.\n \nAt this point, Maki had grown exponentially since enrolling at Jujutsu High and Noritoshi could tell that she changed at a glance. However, she grew content being more like her peers, and was unable to maximize her potential. She lacked the perception same Hagane Daido possessed and struggled to understand what she was missing to make her like Toji Fushiguro. While normally relaxed and focused, Maki became tense and frustrated. Maki was self-aware enough to recognize that she was overthinking and accepted Rokujushi Miyo's offer to sumo wrestle in order to blow off some steam. Maki never truly had anyone she could sincerely recognize as a teacher because she views Satoru and Atsuya as idiots. She never rejected the idea of having a teacher due to pride, it just never crossed her mind to rely on anyone else to grow stronger. Maki put her trust in Miyo and explained what was holding her back. Through sumo wrestling, Miyo taught Maki how to free her mind and perceive everything around her without the pressures of the world on her shoulders. With that newfound freedom of the mind, Maki smiled and proudly declared that she was at her best.\n \nMaki's enlightened mental state allowed her to bring out her full fighting potential. She regained her calm and focused demeanor along with a newfound sense of freedom and confidence in herself. She realized it wasn't enough to be like everyone else and needed to focus on what she could do specifically, things only she and Toji could achieve. Maki was completely nonchalant during the latter stages of her fight with Naoya's cursed spirit form as he became the increasingly frustrated one. Maki didn't bother acknowledging Naoya's antics a single time and effortlessly took him down. In one last conversation with her sister, Maki is able to confirm that she's broken anything that shackled her, just as Mai intended.\nDespite everything Maki has been through, she remains loyal and kind to her friends. Although she and Noritoshi weren't close before their time in Sakurajima together, Maki could relate to him due to their complicated familial relationships. Maki told Noritoshi to talk with his mother before assuming she doesn't want him. After learning Naoya was killed by her mother, Maki admits maybe she was wrong about her and never got a good answer as to what a mother is. She implored Noritoshi to find out for himself and not to make the same mistake she did.\nAbilities and Powers\n\nOverview\n \nOverall Skill Level: Maki's grade 4 ranking is not at all reflective of her actual skill level. She was born a non-sorcerer but she has always had tremendous physical abilities, gifted through heavenly restriction in exchange for her severely low cursed energy. By mastering the use of weapons and studying curses at Jujutsu High, she has become a jujutsu sorcerer nonetheless. \nGojo and Mei Mei both casually agreed that as a second-year student, there was no good reason Maki wasn't ranked at least grade 2. Maki's tension with the Zenin clan caused them to stall their promotion even though she can exorcise a grade 2 cursed spirit with ease.\n \nMaki's close peers all recognize how powerful she is, Yuji Itadori could tell just by looking that she has an aura of strength. Even so, she's still often underestimated by her opponents. She wields quality cursed tools with proficiency and her heavenly restricted physical prowess is second only to Yuji's superhuman abilities.\n \nIn the 2018 Goodwill Event, Maki made short work of both Kasumi Miwa and Mai one after the other. Kasumi realized Mai was dead wrong about calling Maki a weakling and believed she'd exorcise a grade 2 curse with ease. In a fight between weapons users, Maki effortlessly overpowered Miwa and took her katana from her. Mai did her best to use tricks to overcome her sister, but she was also forced to recognize that Maki's physical abilities far surpassed her own. Against Hanami, the special grade cursed spirit that invaded the event, Maki was able to hold her own with Megumi's help and bought enough time for reinforcements to arrive.\nMaki also proved herself an asset in the harrowing battles of Shibuya despite Naobito and Nanami telling her to turn back. She was a step slower than the seasoned grade 1 sorcerers at the start of the fight with Dagon and Naobito rescued her at one point, but Maki continued to improve throughout the battle. Inside Dagon's domain, Maki survived his early onslaught and even launched an effective counterattack against the special grade with Megumi's aid.\n \nFighting against her father, Maki was able to overwhelm her opponent in a sword duel, but Ogi ultimately cut her down using jujutsu. As Mai explained, Maki was never able to reach her full potential because what little cursed energy she had was only holding her back. Twins are treated as the same person in jujutsu and Mai was the one born with the innate cursed technique. In exchange for sacrificing her life and taking all the cursed energy between them with her, Mai was able to free Maki from cursed energy and grant her a body of steel.\n \nMaki's heavenly restricted body was immensely improved, to the point where her strength is comparable to Toji Fushiguro. She effortlessly killed her father in an instant and then went on to annihilate all of the clan's strongest fighters. Maki slaughtered every member of the Kukuru Unit when they had her completely surrounded. Then the Hei immediately ambushed her with all their cursed techniques only for Maki to destroy all of them with a single cursed tool.\n \nEven Naoya, who inherited Naobito's cursed technique and refused to accept Maki could be Toji's successor in strength, was bested by her new power. Maki has surpassed Naobito, who once saved her. She has showcased the ability to eliminate one of the Big Three Sorcerer Clans and she can't be tracked now that she has no cursed energy at all.\nMaki gained a body of steel but mental shackles held her back from maximizing her potential until she changed her mindset. While she was strong enough to eliminate the Zenin clan, she struggled against Naoya when she fought him as a vengeful curse in Sakurajima. She couldn't close the gap in abilities between herself and Toji because she had become content being like her peers and didn't allow herself to thrive in areas only she could excel at. After some guidance from Rokujushi Miyo, Maki freed her mind and realized she could perceive inorganic matter. This advanced perception allows her to see how her opponent will move due to the subtle changes in temperature and air density. She can even take hold of these scattered surfaces to move in mid-air at extreme speeds. She was also completely immune to Naoya's domain expansion and effortlessly killed him. Twelve years after his death, a war god equal to Toji Zenin has been fully realized in Maki.\nFully awakened, Maki was able to stand up to a fifteen-finger Sukuna while fighting alongside Yuji. Sukuna was in an unpolished state and Maki held her own against him in hand-to-hand combat, even shaking off a direct hit from him.\nPhysical Prowess\n \nMaster Weapons Specialist: Maki is touted as the best cursed tool user at Tokyo Jujutsu High. Able to wield a wide assortment of different weapons, Maki has mastered all sorts of armed combat styles. She appears to prefer using polearms and spears in battle but is fully capable of switching between multiple weapons in the course of a single fight. \n \nMaki's proficiency with weapons is also shown in her ability to teach others to use them. She helped give Yuta a strong base for close combat by training him to use a katana. He became a decent sparring partner after three months and he eventually blossomed into a talented swordsman. Maki is also responsible for teaching Megumi how to fight in close quarters. He was extremely lacking at the beginning of his first year at Jujutsu High but she has shown him how valuable close-quarters combat is. She helped him realize he could keep weapons in his shadow and motivated him to learn how to fight with a variety of different types of weapons.\nIn the Goodwill Event, Kasumi was surprised that Maki could wield a wide polearm in the middle of a forest where their duel was surrounded by trees. Maki broke the handle of her own spear and used it as a projectile to close the distance. Using aikido disarming to take an opponent's weapon, Maki stole Kasumi's sword from her.\n \nMaki used the katana to attack Hanami and although the blade shattered on the first strike, Maki was able to quickly adapt and switch to the three-section staff, Playful Cloud, to fight. Megumi noted that Playful Cloud was difficult for him to use Maki was able to utilize it to fight on par with special grade cursed spirits. She and Megumi swapped weapons a few times against Hanami to take the curse by surprise and were able to do so comfortably.\n \nMaster Hand-to-Hand Combatant: Maki is well trained in several forms of close-quarters combat and generally uses hand-to-hand in tandem with her weaponry. While her hands are generally occupied fighting with weapons, Maki likes to throw kicks at the same time. While fighting Mai, Maki sliced apart her foothold with a katana then delivered a devastating kick to her sister's body that tossed her through the air. \nUnlike Yuji, Maki generally didn't get to showcase her martial arts skills because she requires cursed tools to be a sorcerer. Maki did, however, use hand-to-hand combat to best many members of the Zenin clan with her improved body of steel. Chojuro and Nobuaki were both killed with Maki's bare hands and she defeated Naoya with a single punch after parrying many of his early high-speed attacks. After unlocking her full potential, Maki even overpowered Sukuna in a few exchanges during their fight. \n \nHigh Tactical Intellect: Maki was raised in one of the major sorcerer clans so she has a solid grasp on the important aspects of the jujutsu world. While generally looking to overpower her opponents with her physical skills, Maki is also a highly intelligent fighter. She has proven leadership skills and gives effective orders within her squad to work together as a unit. As the de-facto leader of the Tokyo Team in the Goodwill Event, Maki came up with the strategy to counter Aoi Todo's one-track mind and brute strength. She and Megumi were also quick to figure out the Kyoto Team's formation was targeting an assassination on Yuji. In Shibuya, it was her plan for Nobara and Akari to leave the barrier and rescue Ijichi.\nAgainst her father, Maki formulated a good plan to win a sword exchange with Ogi. She feigned a single-strike duel and then followed up with more attacks that broke Ogi's katana. She defeated Naoya by constantly analyzing his cursed technique and looking for the secret to his speed, which she was eventually able to figure out.\n \nImmense Strength: Maki has always possessed extraordinarily high levels of strength for a human. She knocked out Aoi Todo with a baseball to the face and broke a wooden polearm over her thigh, something no normal person is physically capable of. As a testament to her heavenly gifted strength, Playful Cloud is a cursed tool that relies solely on its user's power. She was able to use it to damage two powerful special grade cursed spirits on her own.\nAs with all of her physical abilities, Maki's strength grew tremendously after her cursed energy was completely taken away. It is more than enough to fight back against cursed techniques. Maki easily broke free from the stone hands attack that Chojuro hit her with and broke free from Ranta's paralysis using brute strength and willpower. Compounded with the speed Naoya was approaching her at, the brute strength in Maki's left hand crippled the right side of her opponent's face to end their fight.\n \nImmense Agility & Reflexes: Maki has incredible speed to match her strength and moves well enough in a fight for her agility to be acknowledged by Hanami. She makes sharp moves, and stays highly mobile in a fight with great precision. Against Mai's revolver, Maki effortlessly dodged and weaved through her sister's barrage of bullets. Not only did she slice a bullet in half with a katana, Maki even moved fast enough to catch a speeding bullet just a few centimeters from her face using incredibly astute reflexes.\nAfter escaping from cursed energy, Maki's body could move and react fast enough to compete with Naoya's Projection Sorcery, which allowed him to break subsonic speed. She killed Chojuro and Nobuaki before either of them even knew what happened. In their last moments, both noted how Maki's speed had grown so much she had become unrecognizable. Once fully realized, Maki's speed has reached inconceivable levels for a human being. Naoya, a curse that can move three times the speed of sound, was unable to catch her.\n \nImmense Endurance: Although she never had an effective resistance to curses, Maki has always been tough. Her inborn physical toughness saved her life when she was burned point blank by Jogo's cursed technique. No amount of curse tolerance saved Naobito from similar injuries.\nWhile Maki was very durable, she was eventually sliced open and incapacitated by her father. Maki's improved body of steel healed her injuries and came with highly improved durability that overpowered the Zenin clan's cursed techniques with pure physical prowess. Maki suffered a direct hit from Chojuro's giant stone hands smashing together, something Nobuaki believed should've completely immobilized her, and broke out of the stone just a few moments later.\nCursed Energy\n \nZero Cursed Energy: Maki originally possessed very low levels of cursed energy, even less than the average non-sorcerer. She couldn't see curses without glasses imbued with cursed energy, the most basic requirement to be considered a sorcerer. This was despite Maki being born into a powerful sorcerer clan, due to being born a twin, which is inauspicious for sorcerers. Treated as one person in jujutsu, Mai had the cursed technique and most of the cursed energy between the twins. With Mai's sacrifice, she took all the cursed energy between them, making Maki the second known person to have escaped cursed energy completely after Toji Fushiguro.\nLike Toji, Maki is completely undetectable without cursed energy and barriers treat her like a building. As a result, most domains have no effect on Maki and cannot confine her unless the caster uses an actual structure as the barrier's exterior or she consents. She also can't be targeted by a domain's sure-hit attack due to her lack of cursed energy.\nHeavenly Restriction\nHeavenly Restriction\nIn exchange for her lack of cursed energy, Maki has always possessed exceptional physical prowess. While not as superhuman as Yuji Itadori, she possessed peak human capabilities comparable to sorcerers who constantly train in cursed energy reinforcement. Maki's strength allowed her to work effectively as a sorcerer by wielding cursed tools despite not having enough cursed energy to be technically considered one.\nThe minor amount of cursed energy Maki possessed was holding back her Heavenly Restriction. In exchange for escaping from cursed energy completely, Maki was granted a \"body of steel\" with capabilities even beyond that of Yuji. Her prowess is now comparable to Toji's, especially after learning to use her body's capabilities to the fullest. Not only does she possess superhuman strength and speed, but Maki can see inorganic matter and grab hold of normally imperceivable changes in air density and temperature.\nEquipment\nCursed Tools\nAs a first-year student, Maki's signature weapon was a red naginata cursed tool with gold ends and a red cloth. She used it to exorcise several cursed spirits, but it was broken in her fight with Suguru Geto.\nMaki's low cursed energy makes her unable to see curses or jujutsu naturally. Her glasses are actually a cursed tool that grants her these abilities. She was not particularly fond of the first pair and they were broken in her fight with Suguru Geto. She later replaced her original glasses and used a new pair until they were also broken in Shibuya. After the incident, Maki replaced her glasses once again. This pair was similar to the first, more round in shape. However, she broke this pair as well during her confrontation with her father.\nDuring the Goodwill Event, Maki wielded a long naginata polearm with a black cursed tool blade decorated with fur in-between the handle and the spearhead with gold rings on the opposite end.\nMaki disarmed Kasumi and took her katana during the Goodwill Event. She later broke the blade during her fight with Hanami after trying to slash his hard shell.\nMaki kept her arsenal within Megumi's shadow, allowing them to share a pool of weapons. Among those weapons was Megumi's black sword. The duo momentarily traded weapons to throw off Hanami.\nPlayful Cloud (游雲, Yū-un?): A special grade cursed tool retrieved from Suguru Geto. It is a three-section staff that is described as pure power, relying entirely on the user's physical strength.\nDragon-Bone (竜骨, Ryūkotsu?) is Juzo Kumiya's masterpiece. It can accumulate force and cursed energy as well as eject it out of the back of the blade in accordance with the user's will. During a meeting with Master Tengen, Maki asked for the location of Juzo's workshop. At some point, she went there and retrieved Dragon-Bone. She was first forced to use it in a duel with her own father.\nThe sword Mai left behind for Maki is an exact replica of the Split Soul Katana (釈魂刀, Shakukontō?). It is Maki's last connection to her sister and it possesses the ability to bypass any physical resistance to cut right at the soul of any target.\nConventional Weaponry\nFor training, Maki uses a metal polearm to practice her spearman skills. She also allowed Megumi to practice using in order to increase his weapon dexterity.\nBattles & Events\nCursed Child Arc\nYuta Okkotsu & Maki Zenin vs. Cursed Spirits\nMaki Zenin, Toge Inumaki & Panda vs. Suguru Geto\nKyoto Goodwill Event Arc\nKyoto Sister-School Goodwill Event\nSpirit Bash Race\nMaki Zenin vs. Kasumi Miwa\nMaki Zenin vs. Mai Zenin\nBaseball Game\nMegumi Fushiguro & Maki Zenin vs. Hanami\nShibuya Incident Arc\nThe Shibuya Incident\nJujutsu Sorcerers vs. Dagon\nPerfect Preparation Arc\nMaki Zenin vs. Ogi Zenin\nMaki Zenin vs. The Kukuru Unit\nMaki Zenin vs. The Hei\nMaki Zenin vs. Naoya Zenin\nCulling Game Arc\nThe Culling Game\nMaki Zenin & Noritoshi Kamo vs. Naoya Zenin\nMaki Zenin, Hagane Daido & Rokujushi Miyo vs. Naoya Zenin\nYuji Itadori, Maki Zenin & Hana Kurusu vs. Sukuna\nShinjuku Showdown Arc\nJujutsu Sorcerers vs. Sukuna\nTrivia\nMaki's surname contains the kanji for \"meditation\" (禪, zen?) and \"institution\" (禪, in?), and her first name contains \"real, genuine\" (真, ma?) and \"hope\" (希, ki?).\nMaki's rankings in the Popularity Polls are as follows:\nMaki ranked 12th in the first Popularity Poll with 4,245 votes.\nMaki ranked 12th in the second Popularity Poll with 2,038 votes.\nMaki ranked 9th in the third Popularity Poll with 2,056 votes.\nMaki ranked 13th in the fourth Popularity Poll with 1,625 votes.\nMaki loves junk food.\nMaki's hair is straighter than Mai Zenin's hair.\nIn the English dub, both Maki and Kasumi Miwa are portrayed by Allegra Clark.\nAccording to Jujutsu Kaisen Official Fanbook:\nEnrollment method: Family lineage.\nHer specialty is crushing empty cans.\nFavorite dish: Junk food.\nLeast Favorite dish: Vegetarian food.\nCause of stress: Zenin family procedure.\nReferences\n↑ 1.0 1.1 1.2 Jujutsu Kaisen Official Fanbook: (p. 22-23).\n↑ 2.0 2.1 2.2 Jujutsu Kaisen Manga: Vol. 5, Profile\n↑ \nJujutsu Kaisen Official Fanbook: (p. 112-113).\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 42 (p. 9) and Episode 17.\n \n↑ \nJujutsu Kaisen Manga: Chapter 0-1 (p. 2-3).\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 10 (p. 8) and Episode 5.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 12 (p. 11) and Episode 6.\n \n↑ \nJujutsu Kaisen Anime: Jujutsu Kaisen 0 - The Movie.\n \n↑ \nJujutsu Kaisen Manga: Chapter 144 (p. 8).\n \n↑ \nJujutsu Kaisen Manga: Chapter 150 (p. 1).\n \n↑ \nJujutsu Kaisen Manga: Chapter 190 (p. 15).\n \n↑ \nJujutsu Kaisen Manga: Chapter 0-1 (p. 11-15).\n \n↑ \nJujutsu Kaisen Manga: Chapter 0-1 (p. 40-42).\n \n↑ \nJujutsu Kaisen Manga: Chapter 0-1 (pp. 4-6, 8-10).\n \n↑ \nJujutsu Kaisen Manga: Chapter 0-2 (pp. 12).\n \n↑ \nJujutsu Kaisen Manga: Chapter 0-3 (p. 25-28).\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 10 (p. 8-10) and Episode 5.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 10 (p. 12-15) and Episode 5.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 12 (p. 8-11) and Episode 6.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 42 (pp. 9-11, 19) and Episode 17.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 18 (pp. 2, 7-9) and Episode 8.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 42 (p. 3) and Episode 17.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 42 (p. 16-19) and Episode 17.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 99 (p. 2-3) and Episode 36.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 106 (p. 8-9) and Episode 38.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 107 (p. 14) and Episode 38.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 108 (pp. 13-15, 18-19) and Episode 38.\n \n↑ \nJujutsu Kaisen Manga: Chapter 144 (p. 9).\n \n↑ \nJujutsu Kaisen Manga: Chapter 146 (p. 10-13).\n \n↑ \nJujutsu Kaisen Manga: Chapter 148 (p. 4-6).\n \n↑ \nJujutsu Kaisen Manga: Chapter 149 (pp. 9-13, 18-19).\n \n↑ \nJujutsu Kaisen Manga: Chapter 150 (p. 22-23).\n \n↑ \nJujutsu Kaisen Manga: Chapter 151 (p. 193).\n \n↑ \nJujutsu Kaisen Manga: Chapter 152 (pp. 1-3, 9).\n \n↑ \nJujutsu Kaisen Manga: Chapter 190 (p. 16).\n \n↑ \nJujutsu Kaisen Manga: Chapter 195 (p. 18-19).\n \n↑ \nJujutsu Kaisen Manga: Chapter 196 (p. 4).\n \n↑ \nJujutsu Kaisen Manga: Chapter 196 (p. 14-19).\n \n↑ \nJujutsu Kaisen Manga: Chapter 197 (pp. 10-11, 17).\n \n↑ \nJujutsu Kaisen Manga: Chapter 198 (p. 12-13).\n \n↑ \nJujutsu Kaisen Manga: Chapter 199 (p. 1-2).\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 40 (p. 10-11) and Episode 17.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 40 (pp. 1-2, 9) and Episode 17.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 42 (p. 15) and Episode 17.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 47 (pp. 2-3, 10, 17-19) and Episode 19.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 107 (p. 14-15) and Episode 38.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 109 (p. 2-4) and Episode 38.\n \n↑ \nJujutsu Kaisen Manga: Chapter 148 (p. 16-19).\n \n↑ \nJujutsu Kaisen Manga: Chapter 149 (p. 19).\n \n↑ \nJujutsu Kaisen Manga: Chapter 150 (p. 10-22).\n \n↑ \nJujutsu Kaisen Manga: Chapter 151 (p. 18-19).\n \n↑ \nJujutsu Kaisen Manga: Chapter 152 (p. 9).\n \n↑ \nJujutsu Kaisen Manga: Chapter 197 (p. 10-13).\n \n↑ \nJujutsu Kaisen Manga: Chapter 198 (p. 10-19).\n \n↑ \nJujutsu Kaisen Manga: Chapter 215 (p. 6-14).\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 10 (p. 10) and Episode 5.\n \n↑ \nJujutsu Kaisen Manga: Chapter 0-2 (p. 9-11).\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 12 (p. 10) and Episode 6.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 13 (p. 6-8) and Episode 6.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 40 (pp. 3, 8-9) and Episode 17.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 47 (p. 7-10) and Episode 19.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 34 (p. 9-10) and Episode 15.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 36 (p. 2-3) and Episode 15.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 99 (p. 2-3) and Episode 36.\n \n↑ \nJujutsu Kaisen Manga: Chapter 148 (pp. 13, 16).\n \n↑ \nJujutsu Kaisen Manga: Chapter 151 (pp. 3, 7, 11, 18).\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 47 (p. 2-3) and Episode 19.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 109 (p. 3-4) and Episode 38.\n \n↑ \nJujutsu Kaisen Manga: Chapter 150 (pp. 16, 20).\n \n↑ \nJujutsu Kaisen Manga: Chapter 151 (p. 19).\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 47 (p. 16-17) and Episode 19.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 42 (pp. 4-5, 13-14) and Episode 17.\n \n↑ \nJujutsu Kaisen Manga: Chapter 151 (p. 14-19).\n \n↑ \nJujutsu Kaisen Manga: Chapter 150 (p. 18).\n \n↑ \nJujutsu Kaisen Manga: Chapter 197 (p. 5-13).\n \n↑ \nJujutsu Kaisen Manga: Chapter 144 (p. 9).\n \n↑ \nJujutsu Kaisen Manga: Chapter 150 (p. 15-17).\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 18 (p. 8) and Episode 8.\n \n↑ \nJujutsu Kaisen Manga: Chapter 149 (pp. 8-12, 16).\n \n↑ \nJujutsu Kaisen Manga: Chapter 198 (pp. 8, 10-11, 15, 17).\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 42 (p. 15) and Episode 17.\n \n↑ \nJujutsu Kaisen Manga: Chapter 149 (p. 4-19).\n \n↑ \nJujutsu Kaisen Manga: Chapter 150 (p. 20-22).\n \n↑ \nJujutsu Kaisen Manga: Chapter 197 (p. 11-13).\n \n↑ \nJujutsu Kaisen Official Fanbook: (p. 170).\n \n↑ \nJujutsu Kaisen Manga: Chapter 0-3 (p. 26).\n \n↑ \nJujutsu Kaisen Manga: Chapter 148 (p. 13).\n \n↑ \nJujutsu Kaisen Manga: Chapter 149 (p. 12-13).\n \n↑ \nJujutsu Kaisen Manga: Chapter 198 (p. 13).\n \nNavigation\n Characters\nTokyo Jujutsu High\nFaculty\nAkari Nitta • Atsuya Kusakabe • Kiyotaka Ijichi • Masamichi Yaga • Satoru Gojo • Shoko Ieiri\nStudents\nKinji Hakari • Kirara Hoshi • Maki Zenin • Megumi Fushiguro • Nobara Kugisaki • Panda • Toge Inumaki • Yu Haibara • Yuji Itadori • Yuta Okkotsu\nKyoto Jujutsu High\nFaculty\nUtahime Iori • Yoshinobu Gakuganji\nStudents\nArata Nitta • Aoi Todo • Kasumi Miwa • Kokichi Muta • Mai Zenin • Momo Nishimiya • Noritoshi Kamo\nJujutsu Sorcerers\nProfessional Sorcerers\nKento Nanami • Mei Mei • Takuma Ino • Tengen • Yuki Tsukumo\nZenin Clan\nChojuro Zenin • Jinichi Zenin • Naobito Zenin • Naoya Zenin • Nobuaki Zenin • Ogi Zenin • Ranta Zenin\nKamo Clan\nNoritoshi Kamo • Shino\nCulling Games Players\nAngel • Charles Bernard • Chizuru Hari • Dhruv Lakdawalla • Fumihiko Takaba • Haba • Hagane Daido • Hajime Kashimo • Hana Kurusu • Hanyu • Hiromi Higuruma • Iori Hazenoki • Reggie Star • Remi • Rin Amai • Rokujushi Miyo • Ryu Ishigori • Takako Uro • Yorozu\nNon-Combatants\nKaori Itadori • Misato Kuroi • Riko Amanai • Ui Ui\nFukuoka Branch Campus\nKaito Yuki • Kensuke Nagino • Saki Rindo\nCurse Users\nSuguru Geto's Group\nLarue • Manami Suda • Miguel Oduol • Mimiko Hasaba • Nanako Hasaba • Suguru Geto • Toshihisa Negi\nKenjaku's Group\nHaruta Shigemo • Jiro Awasaka • Juzo Kumiya • Kenjaku • Niji Ebina • Ogami • Ogami's grandson • Sukuna • Uraume\nQ\nBayer • Kokun\nNon-Curse Users\nShigeru Sonoda • Shiu Kong • Toji Fushiguro\nCursed Spirits\nMahito's Group\nDagon • Hanami • Jogo • Mahito\nVengeful Spirits\nKuchisake-Onna • Michizane Sugawara • Rika Orimoto • Tamamo-no-Mae Incarnate\nDeath Paintings\nChoso • Eso • Kechizu\nOther Curses\nAkuro-o Otake • Finger Bearer • Fly Heads • Ganesha • Ko-Guy • Kurourushi • Rainbow Dragon • Rika • Smallpox Deity\nNon-Sorcerers\nSugisawa Third High School\nSetsuko Sasaki • Takagi • Takeshi Iguchi\nSatozakura High School\nJunpei Yoshino • Shota Ito • Sotomura\nSaitama Urami East Junior High\nFujinuma • Taichi Kanada • Takeda • Tsumiki Fushiguro\nCivilians\nFurudate • Fumi • Jin Itadori • Keita Oe • Nagi Yoshino • Saori • Tadashi Okazaki • Takada-chan • Wasuke Itadori • Yuko Ozawa\nU.S. Government\nCyrus Veil • Garry K. Johnson"
}