{
  "requested_name": "Mitsuri Kanroji",
  "resolved_title": "Mitsuri Kanroji",
  "url": "https://kimetsu-no-yaiba.fandom.com/en/wiki/Mitsuri_Kanroji",
  "summary": "“",
  "full_text": "Mitsuri Kanroji\n“\nIs it okay for a girl to be this strong? I still worry that someone may ask that, as though I'm not human. In my fear, I was suppressing my strength. But not anymore. Leave this to me. I will protect everyone.\n”\n \n— Mitsuri Kanroji to herself in Get it together, Moron\nMitsuri Kanroji (甘露寺 蜜璃, Kanroji Mitsuri?) is a major supporting character of Demon Slayer: Kimetsu no Yaiba. She is a Demon Slayer of the Demon Slayer Corps and the Love Hashira (恋柱, Koi Bashira?) of the Taisho era.\nAppearance\nMitsuri is a curvaceous young woman of pale skin complexion, whose slender, graceful build belies her deceptive muscular strength. She stands slightly taller than average. She has large round, pale green eyes with long black eyelashes and many notable white sparkles reflecting light off of them, a small beauty mark beneath each of them, and light pink lips. Mitsuri has long and visibly thick sakura pink hair that fades into a lime green color at the halfway point, which she wears in three thick braids. She has five shorter, choppy clumps hanging over her face as voluminous bangs, the tips lime green as well. She has been called beautiful and charming on multiple occasions.\nAt the age of seventeen, Mitsuri once dyed her hair black in an attempt to appear \"normal\" during her second marriage proposal.\nMitsuri wears a heavily customized version of the standard Demon Slayer Corps uniform, which is black in the manga and tinted light plum in the anime. Her outfit consists of a tight-fitting button-up jacket with a stand-up collar and long sleeves, featuring gold buttons and a shirt pocket on the left breast, with the kanji for Destroy (滅, Metsu?) engraved on the back of the collar. Beneath this, she wears a white long-sleeved collared undershirt. Due to the snug fit of her uniform, both the chest area of the jacket and her undershirt are left unbuttoned and open, exposing her cleavage. Instead of the standard tattsuke-hakama pants, Mitsuri wears a short pleated mini-skirt, maintaining the color and fabric style of her uniform. Her waist is fastened with the standard white belt. Over her uniform, she wears a plain white haori—a gift given to her by Kyojuro Rengoku, the Flame Hashira and her mentor. For legwear, she dons a pair of lime green thigh-high stockings with vertical stripes and teal cuffs at the top. These were a gift from Obanai Iguro, the Serpent Hashira. Her footwear consists of white zōri sandals with pink straps, tied at the front in decorative bows.\nWhile at the Swordsmith Village, Mitsuri wore a kimono with floral designs and a haori.\nDuring her battle with Zohakuten, she manifest her Demon Slayer Mark, located just below her neck and near her left clavicle. It appears as two red hearts positioned opposite from each other, aligned by two red teardrop-shaped spots in the middle.\nDuring her and the other remaining Hashira's fight against Muzan, Mitsuri's left and back braids are cut off by Muzan Kibutsuji's attacks, now shortened to shoulder length, and part of her left ear is also torn at the side. Mitsuri also loses both of her arms in the process of ripping off Muzan's left arm.\nGallery\nMitsuri with her Demon Slayer Mark.Mitsuri with her hair dyed black.Mitsuri as a Mizunto-ranked Demon Slayer training under Kyojuro.\nPersonality\n \nMitsuri is a very emotional, passionate, and jovial individual who constantly compliments and swoons over her comrades in her head, likely a contributing factor towards her nickname as \"the Hashira of Love.\" Although she can be shy and is easily flustered, Mitsuri is always kind to others. However, despite her gentle and seemingly innocent demeanor, Mitsuri will show no mercy in the face of demons, instead expressing such sentiments with a fierce tone. She showcases a great amount of dedication to the Demon Slayers' cause. Despite being put out of commission by Muzan at an early stage in their battle, she was determined enough to return and fight.\nGiven her desperation for marriage, Mitsuri decided to become a member of the Corps with the purpose of finding a suitable husband stronger than her, a rather difficult task given the astounding level of her physical strength. Upon joining the Corps, she felt an immense amount of guilt for her reasoning behind becoming a Demon Slayer to the point where she ate much less than her typical meals. However, she was able to move past those feelings with the help of Shinobu Kocho and Obanai Iguro.\n \nBesides her rather emotional personality, Mitsuri can also come off as somewhat childlike at times. When she is asked to explain the process of obtaining the Demon Slayer Mark, she describes it using bizarre onomatopoeia. She's also prone to exaggerated over-reactions. She is a very caring person, always showing others her love as befits her Hashira title. She can get rather excitable, grabbing her friends for a big group hug after the battle against Gyokko and Hantengu.\nWhen she is slashed by Muzan and taken out of the battle by Obanai, she says she wants to be of use and not drag everyone else down. She even begs for Obanai to come back and not get himself killed. This alludes to her love for him, the person she can finally feel for and be loved by. She shares Obanai's hope that they could reincarnate, meet each other and get married in another life.\nAbilities\n\nOverall Abilities\n \nAs a Hashira of the Demon Slayer Corps, Mitsuri is a very powerful and skilled combatant. She is said to have completed the Final Selection within a mere six months of training, which Kyojuro Rengoku considers outstanding. Her abilities were put on display during the events within the Swordsmith Village, where she quickly subdued and defeated a group of demons created by Upper Rank Five, Gyokko, and later played a big part in the fight against Upper Rank Four, Hantengu, specifically against his manifestation of hatred Zohakuten, which possesses the combined strength of four Upper Rank demons.\n \nBy overcoming her fear of rejection that caused her to repress her full strength, she unknowingly unlocked her Demon Slayer Mark by pushing her heart and blood circulation further to try and become faster and stronger. With its power increasing her abilities further, Mitsuri was able to fend off the incredibly powerful Upper Rank until sunrise. During the events in the Infinity Castle, Mitsuri held her own against the newly appointed Upper Rank Four, Nakime. Afterwards, she managed to land a surprise technique on the Demon King himself, Muzan Kibutsuji, and played her part in the fight to stall for sunrise.\nAbnormal Muscular Constitution: Mitsuri has a special muscular composition, making her muscles eight times denser than that of a regular human. While her limbs are thin, they possess unbelievable strength and endurance capable of maintaining her body's structure after a point-blank sound attack from Zohakuten. To maintain the composition of her body, Mitsuri eats as much as three sumo wrestlers.\nDemon Slayer Abilities\nDemon Slayer Mark: During her battle against Upper Rank Four, Hantengu's clone, Zohakuten (憎珀天, Zōhakuten?), Mitsuri stopped suppressing her full strength and, by pushing herself further, unconsciously awakened and obtained her Demon Slayer Mark, that takes the form of two dark red hearts upside down and opposite from each other with two dark red teardrop-shaped wings on both sides where the two heart tips meet that appear near her neck, close to her clavicle. When this manifested, Mitsuri's physical strength, endurance, precision and power increased dramatically to the point she was able to stand on equal grounds against Zohakuten, while he was unleashing his most powerful techniques against her.\nPhysical Abilities\nEnhanced Flexibility: Mitsuri has been noted to possess an extremely flexible body, allowing her to achieve a wide range of motion. She has incorporated her innate flexibility into her Love Breathing techniques, successfully using it to outpace and counterattack Zohakuten's techniques without much trouble. Mitsuri's superhuman flexibility is also displayed in the form of her whip-like Nichirin Sword which is also incredibly flexible. However, only she can make use of the sword due to her pliability preventing her from getting cut while performing high speed actions that make use of incredible ranges of motion.\n \nImmense Speed & Reflexes: As a Hashira, Mitsuri is an extremely fast individual. She first showcased her exceptional speed when she sliced up and killed the spawns created by Upper Rank Five, Gyokko, before they could even react, saving numerous swordsmiths in the process. Her tremendous speed and reflexes were best displayed during her battle against Zohakuten, where she dodged lightning and sound waves produced by the Upper Rank's Blood Demon Art and proceeded to slice through them without much trouble. Later, she reacted to a point-blank sound wave produced by Zohakuten, tensing her body before the attack landed.Due to the speed at which she could destroy his dragons and evade his attacks, Zohakuten resorted to prolonging the battle and exhausting her stamina in an attempt to defeat her.\n \nImmense Strength: Due to her abnormal muscular constitution, Mitsuri possesses a level of physical strength superior to that of average humans even before becoming a Demon Slayer. As a Hashira, her strength is even comparable to that of Giyu, Kyojuro, and Sanemi. When she was 13 months old, Mitsuri possessed enough arm strength to lift a rock weighing 15 kg (33 lbs). In her attempt to rescue Nezuko and Genya from Zohakuten's dragons, she was able to pull one down as it tried to attack her, causing it to collide violently with two others behind it and knock them down. Her superhuman strength was also displayed during the battle against Muzan, where Mitsuri was able to grab hold of Muzan's arm whip and rip it off with her bare hands, which shocked the Demon King.\nImmense Stamina & Endurance: As a Hashira, Mitsuri has attained incredible stamina and endurance due to years of extremely harsh training. In the battle against Hantengu, despite sustaining several injuries, she still lasted the longest out of Tanjiro, Nezuko and Genya, and stalled them long enough for them to win. With the help of Obanai, Mitsuri were able to hold her own against the newly appointed Upper Rank Four, Nakime for a period of time. Even while enervated and suffering from numerous injuries, Mitsuri still had enough energy reserves to tear off the elongated arm of the Demon King.\nFighting Style\n \nMaster Swordswoman: As a Hashira of the Demon Slayer Corps, Mitsuri is one of the most powerful and skilled swordswomen in the entire organization. Mitsuri makes use of a special swordsmanship style based around her thin and flexible Nichirin Sword akin to a whip sword. Her swordsmanship skill allowed her to quickly subdue the creatures spawned by Upper Rank Five, Gyokko, slicing up the vases on the demons' back at speeds faster than they can react to and with great accuracy. Mitsuri best displayed her unique swordsmanship style and sword wielding skill during her battle with Zohakuten. Her swordsmanship was so precise that Mitsuri could cut through lightning and sound waves produced by the Upper Rank, and she managed to counter and destroy all of his Blood Demon Art techniques, which forced the demon to resort to exhausting her in a desperate attempt to kill the Hashira.\nBreathing Style\nLove Breathing (恋の呼吸, Koi no kokyū?): A Breathing Style Mitsuri created herself based on her experience using Flame Breathing, from being a student of Kyojuro Rengoku. Love Breathing incorporates elements of Mitsuri's superhuman flexibility and her unique whip-like Nichirin Sword. Using this Breathing Style, she can unleash attacks that cover a wide range of motion as well as long ranges that a normal katana would be unable to accomplish.\nFlame Breathing (炎の呼吸, Honō no kokyū?): A Breathing Style that Mitsuri learnt when training under the Flame Hashira, Kyojuro Rengoku. However, although Mitsuri has learnt it, she was not as skillful with it and cannot fight to her fullest using it. Thus, she developed Love Breathing, a Breathing Style more suited to her and can properly make use of her strengths.\nTechniques\n \nFirst Form: Shivers of First Love (壱ノ型　初恋のわななき, Ichi no kata: Hatsukoi no Wananaki?) - The user dashes forward and performs a single slash that winds through the target, hitting multiple areas with one slice.\nSecond Form: Love Pangs (弐ノ型　懊悩巡る恋, Ni no kata: Ōnō Meguru Koi?) - The user performs a singular, long-winding swing that cuts the target at multiple angles.\nThird Form: Catlove Shower (参ノ型　恋猫しぐれ, San no kata: Koi Neko Shigure?) - The user leaps into the air and performs multiple arched slashes in quick succession.\nFifth Form: Swaying Love, Wildclaw (伍ノ型　揺らめく恋情・乱れ爪, Go no kata: Yurameku Renjō Midarezume?) - The user leaps into the air before performing a somersault and releasing dozens of rapid, winding slashes from afar that essentially form a tornado of slashes. In the game, this technique was shown to have an even more powerful drill-like attack when boosted with a Demon Slayer Mark.\nSixth Form: Cat-Legged Winds of Love (陸ノ型　猫足恋風, Roku no kata: Neko Ashi Koi Kaze?) - The user fully extends their sword to perform an arcing slash before retracting it and extending it once more, done in quick succession to form a layers of slashes.\nGame Exclusive Techniques\nFirst Form: Shivers of First Love, Entwined (壱ノ型　初恋のわななき・縛, Ichi no kata: Hatsukoi no Wananaki - Baku?) - The user continuously whips their opponent with their sword, lifting themselves and their opponent upwards a short distance. They continue to deliver multiple slashes while moving behind the target before wrapping the blade around their body and whipping them to the ground. The user then descends to the grounded target and preforms Shivers of First Love, the technique once again launching them upwards.\nFifth Form: Swaying Love, Wildclaw, Everlasting Beauty (伍ノ型　揺らめく恋情・乱れ爪　麗, Go no kata: Yurameku Renjō - Midarezume - Rei?) - A slightly more theatrical version of Swaying Love, Wildclaw. The user whips their opponent with their sword several times, before dramatically wrapping it around the target and subsequently twirling around to launch the sword, which further strike the opponent in quick succession. The user then executes Fifth Form: Swaying Love, Wildclaw as they would normally.\nFeral Fury (乱れ斬り, Midare Giri?) - The user leaps and somersaults behind their opponent, randomly slashing them multiple times with their long blade.\nDancing Love Haze (恋霞演舞, Koi Kasumi Enbu?) - A collaboration between a Love Breathing user and a Mist Breathing user. Both strike their opponent simultaneously with a cross-cut, the Mist Breathing user activating Obscuring Clouds, then they dash and slash the opponent twice. The Love Breathing user jumps in with a front flip slash, the Mist Breather dashing in with another slash while the Love Breather delivers more whip slashes with a twirl. The Mist Breather delivers three more slashes before the Love Breather delivers a somersaulting slash that crashes the opponent back, scattering dust. The Love and Mist Breather then finish their attack by performing their third and fifth forms respectively (Catlove Shower and Sea of Clouds and Haze) while dashing in two directions.\nEquipment\nNichirin Whip-Katana: Unlike most Demon Slayers who use standard katanas, Mitsuri wields an extremely thin, flexible, and long Nichirin sword, that is more akin to a whip or an Urumi. It was made by Tecchin Tecchikawahara, due to its bizarre shape requiring immense expertise to craft. Due to her sword's characteristics, only Mitsuri can use it without cutting herself in the process, which can be attributed to her superhuman flexibility and fighting style. Using her whip-katana, not only is her attack range longer than the average swordsman, but she can also perform attacks that bend and weave through her targets, slashing different areas or the same area multiple times.\nHer whip-katana is in black color with pink outline, and the katana's tsuba is shaped like a four-leaf clover; the leaves have a pink core with a golden border, with the words Destroyer of Demons (惡鬼滅殺, Akki Messatsu?) engraved on the side. The handle is magenta in color and it is wrapped in green cords that are tied to create hearts, and a magenta kishira. Despite her unique katana, Mitsuri carries around a standard sized and shaped sword sheath that is in white color; as such, due to her sword's shape, Mitsuri folds her katana multiple times to properly sheathe it.\nStandard Nichirin Katana: Early on in her career as a Demon Slayer, Mitsuri used a standard sized and shaped Nichirin katana. Its handle and tsuba appeared identical to Mitsuri's current katana.\nGallery\nMitsuri shows how she sheathes her katana.Mitsuri's tsuba.Puzzle & Dragons sprite.Mitsuri's old katana.\nRelatives\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFather\n \n \n \n \nMother\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nMitsuri\n \n \n \n \nBrother\n \n \n \n \nSibling\n \n \n \n \nSibling\n \n \n \n \nSibling\nBattles\nMitsuri Kanroji Battles\nPre-Series Battles\nKyojuro Rengoku vs Hairo\nSwordsmith Village Arc\nTanjiro Kamado, Nezuko Kamado, Genya Shinazugawa and Mitsuri Kanroji vs Hantengu\nInfinity Castle Arc\nDemon Slayers vs Muzan Kibutsuji: Part 1\nMitsuri Kanroji and Obanai Iguro vs Nakime\nSunrise Countdown Arc\nDemon Slayers vs Muzan Kibutsuji: Part 2\nTrivia\nMitsuri's surname contains the Kan-on'yomi reading of the kanji for \"sweet, sugary\" (甘, kan?), \"dew\" (露, ro?) and the Go-on'yomi for \"Buddhist temple\" (寺, ji?). Her first name contains the Go-on'yomi for \"nectar\" (蜜, mitsu?) and \"Lapis\" (璃, ri?).\nHer surname is actually the name of a temple in China located around Nanjing, mentioned in the iconic Chinese novel Romance of the Three Kingdoms.\nMitsuri ranked 12th place in both the first and second character popularity poll with 280 votes and 3714 votes respectively.\nMitsuri's hair color is said to be the way it is because of her eating too much sakuramochi.She ate 170 mochis a day for eight months.\nHer striped socks were a gift from Obanai, as she was initially very embarrassed wearing her uniform.\nMitsuri's mentor was Kyojuro. She derived her Love Breathing from his Flame Breathing.\nIt is revealed in a Volume Extra that her current uniform is made by Masao Maeda, a notoriously perverse uniform tailor of the Kakushi who also gave similarly designed outfits to Shinobu, Kanao, and Aoi. Unlike the others who burned their uniforms in protest, Mitsuri opted to keep wearing it, as she couldn't manage to burn hers.\nMitsuri's appearance is somewhat reminiscent of that of the watermelon fruit, having pink and green hair, and beauty marks reminiscent to watermelon seeds. While the insides of watermelons are usually red, they can be pink in many others as well.\nMitsuri makes a cameo appearance alongside Obanai Iguro in Chapter 137 of Tonikaku Kawaii.\nBecause of how much she eats, her food expenses are unexpectedly high.\nAs revealed during Hashira Training, Mitsuri keeps bees to harvest honey, which she uses to top bread and pancakes.\nMitsuri and Shinobu get along quite well due to them having been the only two female Hashira after Kanae's death. She also teaches Shinobu western cooking.\nMitsuri's hobbies are cooking and Menko, which she has never lost at.\nA few of Mitsuri's attacks are named after cats, due to the fact that she used to own a cat as a child. She and Gyomei Himejima enjoy talking about cats together.\nWhen putting her sword back into its sheath, she folds it multiple times and twirls it around due to its structure.\nMitsuri's sword resembles and may be based off of a South Indian weapon known as the urumi due to its flexible, whip-like form.\nMitsuri can eat 100 sticks of dango.\nMitsuri has states that there are 5 kids in her family, and they all get along with each other.\nMitsuri shares her Japanese and English voice actresses with Kogyoku Ren from Magi and Risa from Phantasy Star Online 2.\nMitsuri viewed the other Hashira as follows:\n\"She's supercute! I'm older but she's more mature. I wish we could hang out together more, but there isn't time... \" - Insect Hashira\n\"His age gives him a certain attractiveness, but he acts childish, like he's about ten. That's so funny!\" - Sound Hashira\n\"What a sweet guy! He writes the nicest letters. And he always compliments me. Even if I take forever to finish eating, he just waits and smiles!\" - Serpent Hashira\n\"It's adorable how he loves cats! And he's the strongest corps member! Wow!\" - Stone Hashira\n\"He's silent and fidgety – which is cute!\" - Water Hashira\n\"He's like an impressive older brother! I had fun training with him. And he babies me!\" - Flame Hashira\n\"It's amazing how he's a Hashira at such a young age! He seems wise – and dignified!\" - Mist Hashira\n\"He's scary, which is impressive, but he gets angry at me a lot...\" - Wind Hashira\nMitsuri's level of openness was ranked at 90%.\nMitsuri liked Obanai long before her confession after the battle against Muzan. She was not able to confess though, as her trauma from her past marriage interviews held her back.\nShe would sometimes ask Shinobu for love advice, but due to both of them being oblivious to love, their exchanges mostly became weird. Mitsuri likened Shinobu's love advice to a research thesis, since it mostly focuses on brain response, heart rate, blood pressure, etc.\nAfter joining the Demon Slayer Corps, she was mostly happy, enjoying her time being praised and being with her senior or junior colleagues. However, as her colleagues died one after another, she sometimes couldn't help but tremble in anger and sadness.\nMitsuri has the biggest appetite out of all the Hashira.\nMitsuri is the only known female Demon Slayer that has unlocked the Demon Slayer Mark.\nMitsuri's father and mother are voiced by Kenji Nojima and Junko Minagawa (Ricco Fajardo and Jennifer Sun Bell in the English dub) respectively.\nIt is revealed in Episode 52’s Taisho Secret that Mitsuri’s favorite foods are pork cutlets and omurice.\nMitsuri's English voice actress, Kira Buckland, also voices Mukago.\nMitsuri shares a family name with a real life Buddhist temple called the Kanroji temple. Demon Slayer's popularity caused an influx of visitors to the temple, with the head priest Hogan Yamashita praising the series, stating, \"The manga evokes empathy for the characters, such as the enemies who had not become demons by choice. It also expresses the Buddhist spirit and principles of life, such as familial love and friendship.\"\nIn Kimetsu Academy, Mitsuri is 19 years old. Having graduated from high school, she studies at a nearby art university, wanting to make everyone happy with her art. Back in her high school days, she was banned from the school store due to the huge amount of food she would buy, and Kyojuro was her former homeroom teacher. She also has a part-time job as a delivery girl for Hyottoko Pizzeria.\nQuotes\n(To herself) \"My heart would never flutter for those who needlessly hurt others!\"\n(To herself) \"In the Demon Slayer Corps, everyone valued me. The people I saved from demons thanked me with tears in their eyes Is it okay for a girl to be this strong? I still worry that someone may ask that, as though I'm not human. In my fear, I was suppressing my strength. But not anymore. Leave this to me. I will protect everyone.\"\n(To Tanjiro Kamado, Nezuko Kamado and Genya Shinazugawa then Zohakuten) \"Thanks, you guys! I may be a Hashira, but I messed up! Sorry! I will not let my comrades die! The Demon Slayer Corps is an important place for me! You may be an Upper Rank or whatever, but that doesn't matter! I'm not gonna let one of those jerks beat me! Get ready, cuz I'm about to get serious!\"\n(To herself) \"I remember now! I was searching for a worthy man... But I was also searching for a place to be myself! I must be flexible... and lithe. I must be more like myself. What should I do, Rengoku? At a time like this, I... I can't stop... my heart from pounding!\"\nReferences\n↑ Kimetsu no Yaiba Manga: Chapter 123 (Page 13).\n↑ Official Twitter Account\n↑ 3.0 3.1 3.2 Kimetsu no Yaiba Manga: Chapter 101 (Page 12).\n↑ Kimetsu no Yaiba Manga: Chapter 101.\n↑ Kimetsu no Yaiba Manga: Chapter 45 (Page 3).\n↑ 6.0 6.1 Kimetsu no Yaiba Extra: Kyojuro Rengoku's Story: Part 1.\n↑ Kimetsu no Yaiba Manga: Chapter 188.\n↑ Kimetsu no Yaiba Manga: Chapter 198 (Pages 14-15).\n↑ 9.0 9.1 Kimetsu no Yaiba: One-Winged Butterfly, Chapter 3.\n↑ Kimetsu no Yaiba Manga: Chapter 45 (Page 2).\n↑ Kimetsu no Yaiba Manga: Chapter 164 (Pages 5-17).\n↑ Kimetsu no Yaiba Manga: Chapter 182 (Pages 16-19).\n↑ 13.0 13.1 Kimetsu no Yaiba Manga: Chapter 123 (Page 14).\n↑ Kimetsu no Yaiba Manga: Chapter 124.\n↑ 15.0 15.1 Kimetsu no Yaiba Manga: Chapter 123 (Page 3).\n↑ Kimetsu no Yaiba Manga: Chapter 112.\n↑ 17.0 17.1 Kimetsu no Yaiba Manga: Chapter 122 (Page 19).\n↑ Kimetsu no Yaiba Manga: Chapter 123 (Page 9-11).\n↑ Kimetsu no Yaiba Anime: Episode 53.\n↑ Kimetsu no Yaiba Manga: Chapter 198 (Page 14-15).\n↑ Kimetsu no Yaiba Manga: Chapter 164 (Pages 8-15).\n↑ Kimetsu no Yaiba Manga: Chapter 45.\n↑ Kimetsu no Yaiba Manga: Chapter 112 (Page 5).\n↑ 24.0 24.1 Kimetsu no Yaiba Extra: Kyojuro Rengoku's Story: Part 2.\n↑ Kimetsu no Yaiba Manga and Anime: Chapter 112 (Pages 8-10) and Episode 49.\n↑ Kimetsu no Yaiba Manga and Anime: Chapter 123 (Page 4) and Episode 54.\n↑ Kimetsu no Yaiba Manga and Anime: Chapter 122 (Pages 18-19) and Episode 54.\n↑ Kimetsu no Yaiba Manga and Anime: Chapter 123 (Page 6) and Episode 54.\n↑ Kimetsu no Yaiba Manga and Anime: Chapter 182 (Page 19) and Episode 54.\n↑ 30.0 30.1 30.2 30.3 Kimetsu no Yaiba Game: The Hinokami Chronicles 2.\n↑ Kimetsu no Yaiba Manga: Chapter 112 (Page 9).\n↑ Kimetsu no Yaiba Manga: Chapter 112 (Page 10).\n↑ Kimetsu no Yaiba Manga: Volume 14, (Extra Pages).\n↑ Kimetsu no Yaiba Manga: Volume 6, (Extra Pages).\n↑ Kimetsu no Yaiba Anime: Episode 54.\n↑ Kimetsu no Yaiba Manga: Chapter 124 (Page 3).\n↑ 37.0 37.1 37.2 37.3 37.4 Kimetsu no Yaiba First Fanbook.\n↑ Kimetsu no Yaiba Manga: Volume 12, (Extra Pages).\n↑ Kimetsu no Yaiba Manga: Chapter 132 (Page 5).\n↑ Kimetsu no Yaiba First Fanbook.\n↑ Kimetsu no Yaiba Manga: Volume 14.\n↑ 42.0 42.1 42.2 42.3 42.4 Kimetsu no Yaiba Second Fanbook.\n↑ Kimetsu Gakuen: Volume 2, Chapter 10\n↑ Kimetsu Gakuen: Volume 1, Chapter 5\n↑ Kimetsu no Yaiba Anime: Episode 49.\n↑ Kimetsu no Yaiba Manga: Chapter 124 (Pages 3-4).\n↑ Kimetsu no Yaiba Manga: Chapter 123 (Pages 18-19).\nNavigation\n Characters\nDemon Slayer Corps\nUbuyashiki Family:\nKagaya Ubuyashiki · Amane Ubuyashiki · Hinaki Ubuyashiki · Nichika Ubuyashiki · Kiriya Ubuyashiki · Kuina Ubuyashiki · Kanata Ubuyashiki · Senri Ubuyashiki · Akito Ubuyashiki\nHashira:\nGiyu Tomioka · Mitsuri Kanroji · Obanai Iguro · Sanemi Shinazugawa · Gyomei Himejima · Kyojuro Rengoku · Tengen Uzui · Muichiro Tokito · Shinobu Kocho · Kanae Kocho · Sakonji Urokodaki · Jigoro Kuwajima · Shinjuro Rengoku\nDemon Slayers:\nTanjiro Kamado · Zenitsu Agatsuma · Inosuke Hashibira · Genya Shinazugawa · Kanao Tsuyuri · Murata · Ozaki · Masachika Kumeno · Yoriichi Tsugikuni · Takeuchi · Nagakura · Noguchi · Yoshioka · Shimamoto\nButterfly Mansion:\nAoi Kanzaki · Sumi Nakahara · Kiyo Terauchi · Naho Takada · Goto\nSwordsmith Village:\nTecchin Tecchikawahara · Hotaru Haganezuka · Kozo Kanamori · Kotetsu · Tetsumotonaka · Tetsudoji · Tetsutani · Tetsuido\nOther/Associates:\nSabito · Makomo · Suma · Makio · Hinatsuru · Masao Maeda\nDemons\nDemons:\nMuzan Kibutsuji · Nezuko Kamado · Temple Demon · Hand Demon · Swamp Demon · Asakusa Demon · Tamayo · Yushiro · Susamaru · Yahaba · Tongue Demon · Horned Demon · Spider Demon (Father) · Spider Demon (Mother) · Spider Demon (Son) · Spider Demon (Daughter) · Shizu Shinazugawa · Woodland Demon · Serpent Demon\nTwelve Kizuki:\nKokushibo · Doma · Akaza · Nakime · Hantengu · Gyokko · Gyutaro · Daki · Kaigaku · Enmu · Rokuro · Wakuraba · Mukago · Rui · Kamanue · Kyogai\nCivilians/Other\nKamado Family:\nTanjuro Kamado · Kie Kamado · Takeo Kamado · Hanako Kamado · Shigeru Kamado · Rokuta Kamado · Sumiyoshi Kamado · Suyako Kamado · Sumire Kamado\nShinazugawa Family:\nKyogo Shinazugawa · Sumi Shinazugawa · Teiko Shinazugawa · Hiroshi Shinazugawa · Koto Shinazugawa · Shuya Shinazugawa\nNorthwest Town:\nKazumi · Satoko · Tokie\nTsuzumi Mansion:\nTeruko · Shoichi · Kiyoshi\nEntertainment District:\nKoinatsu · Omitsu · Toyo · Rei · Yatsu\nOther:\nSaburo · Hisa · Senjuro Rengoku · Ruka Rengoku · Yuichiro Tokito · Tsutako Tomioka · Sayo · Keizo · Koyuki · Kotoha Hashibira · Akeno Tsugikuni · Uta · Takaharu\nAnimals:\nChachamaru · Kaburamaru\nSpecies/Groups:\nKasugai Crows · Ninju\nDescendants/Reincarnations\nKamado Family:\nKanata Kamado · Sumihiko Kamado\nAgatsuma Family:\nToko Agatsuma · Yoshiteru Agatsuma\nOther:\nAoba Hashibira · Tojuro Rengoku · Tenma Uzui · Giichi Tomioka · Sanehiro Shinazugawa\nSpin-Off/Anime Original Characters\nDemon Slayers:\nUraga\nCivilians:\nYae · Taro · Fuku · Tomi · Tatsu\nDemons:\nMatazo · Hairo · Flute Demon · Ubume · Slasher · Mantis Demon"
}