{
  "requested_name": "Nezuko Kamado",
  "resolved_title": "Nezuko Kamado",
  "url": "https://kimetsu-no-yaiba.fandom.com/en/wiki/Nezuko_Kamado",
  "summary": "“",
  "full_text": "Nezuko Kamado\n“\nThings don’t go exactly the way we want them to. We’re only human. You get to decide where your happiness comes from. What’s important is now. \n”\n \n— Nezuko Kamado's ideology of accepting one's humanity in Worm, Simpleton, Stupid Coward\nNezuko Kamado (竈門 禰豆子, Kamado Nezuko?) is the deuteragonist of Demon Slayer: Kimetsu no Yaiba. She is the younger sister of Tanjiro Kamado, one of the two remaining members of the Kamado family, and an informal member of the Demon Slayer Corps. Formerly a human, she was attacked and transformed into a demon by Muzan Kibutsuji.\nQuick Answers\nWhat is Nezuko Kamado's most prominent trait as a demon?\n\t\t\t\t\t\tNezuko's most prominent trait is her extraordinary growth rate, allowing her to adapt and fight against ever more powerful demons by increasing her abilities. \n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Community\n\t\t\t\t\t\nHow does Nezuko recover her strength?\n\t\t\t\t\t\tInstead of devouring human flesh, Nezuko recovers her strength through sleep.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Community\n\t\t\t\t\t\nWhat happens to Nezuko when she transforms further?\n\t\t\t\t\t\tIn her full demon form, Nezuko takes on a more combative and enhanced appearance, and her physical capabilities are greatly heightened to enable her to fight stronger demons.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Community\n\t\t\t\t\t\nWhat is Nezuko's unique ability that sets her apart from other demons?\n\t\t\t\t\t\tNezuko gains the ability to completely resist sunlight.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Community\n\t\t\t\t\t\nWhat is Nezuko's Blood Demon Art?\n\t\t\t\t\t\tNezuko's Blood Demon Art allows her to combust her blood at will into flames that are harmful for demons.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Community\n\t\t\t\t\t\n{\"@context\":\"https:\\/\\/schema.org\",\"@type\":\"FAQPage\",\"name\":\"Nezuko Kamado\",\"mainEntity\":}\nAppearance\nNezuko is a young girl with fair skin, visibly large, prominent fangs, a slender build, and sharp, stiletto nails with a base color of light pink and ombre fading to a red-pinkish color at the end where they point. Her hair is long, black, and wavy. It reaches just below her waist, turning a flame-orange color as it passes her elbows, and appears to be crimped into large, straight ridges, worn side-swept drastically to her left. She has soft-looking, pale pink eyes that appear a lighter color around the rims of their irises and on the center a persian pink below the pupils; they slanted downwards toward the sides of her face and framed by notably long eyelashes. In the manga, Nezuko can sometimes be shown with more than one bow. According to Tanjiro, Nezuko was known as a great beauty in their home town.\nShe wears a light pink kimono with an asanoha (hemp leaf) pattern, the lining a paler pink layered with the white wavy yuban underneath as a medium-length trailing skirt kimono to freely move as a demon; this, the white clothes lowly cover her knees then goes down to almost her ankles making a open window, secured by a red and white-chequered hanhaba obi with an orange-threaded obijime and a green obiage. Over this, she sports a long, dark-brown haori that reaches her calves, as well as a pair of zōri with pink straps and white tabi socks, wrapped with thick pieces of black material resembling kyahan. Nezuko also wears a small pink ribbon on the left side of her head to keep her hair out of her face, along with the bamboo muzzle Giyu Tomioka gave her, which is secured around her jaw with a strip of red cloth.\nWhen Nezuko transforms into her awakened form during her fight with Daki, she has a bigger, taller, and more curvaceous body with longer hair that reaches to her feet. She loses her bamboo muzzle and her right footwear, as well as the sleeves of her kimono. She grows a short white horn on the right side of her forehead, designed with an irregular crack pattern, along with vein-like patterns in her forehead near her horn. She has a vein-like pattern around her left eye, but her most striking new feature is the red and green vine-like pattern that covers her skin, circling around her arms, legs, and chest, as well a black, cat-like slit pupils along with crack-like patterns around the rim of her irises.\nAfter gaining her immunity from the sunlight and regaining her ability to speak, her appearance mostly stay the same, with the exception of her bamboo muzzle and her eyes now appears to have a black, cat-like pupils with visible cracks-like patterns around her pupils.\nAs a human, she had a very similar appearance, the only differences being her lack of demon-like traits, fiery-coloured hair, and pale pink eyes. Instead, Nezuko had fully black hair, was tied back in three low buns, was decorated by pink ribbons, and had eyes of a darker pink color. She wore the same kimono, just without her haori and with a layered pink kimono with the white yuban underneath, along with a white Onbuhimo cloth tied around her, which she used to carry her little brother, Rokuta Kamado, on her back. After becoming human again, these features return, with the exception of her hair, which seems to retain its flame-orange tips, a feature that would be passed down to her descendant, Toko.\nGallery\nNezuko's original appearance as a human.Nezuko's current appearance without her muzzle.Nezuko's fully awakened form.Nezuko's appearance as a child.\nPersonality\nNezuko's original personality as a human was that of a kind and caring girl who thought of others before herself, much like her older brother, Tanjiro. Additionally, she was a responsible elder sister to her younger siblings and often put their needs before her own. Nezuko is, however, not afraid to get in harm's way, protecting her friends from demons even after being returned to a human state. It is also shown that Nezuko's humane, laid-back demeanor supports this fact after Tanjiro apologizes to her.\n \nWhile Nezuko initially starts off like any other demon, bloodthirsty and hungry for human flesh, after seeing her brother's desire to protect her from being killed by a Demon Slayer despite her being a demon, she changes completely and becomes fiercely protective of him. Nezuko seems to have forgotten a good portion of her memories as a human, besides those related to her family, and thus doesn't retain the exact personality she had before transformation, instead acting akin to a child. She is still very caring and protective towards humans who she sees as members of her family, although this is mainly due to the influence Sakonji Urokodaki had on her while she was asleep for two years. Nezuko also retains some of her human emotions, as she has been seen to cry when sad and smile when happy, but in general, she appears more detached than her human cohorts, although she is still much calmer and less malicious than most demons. \n \nSince becoming a demon, Nezuko appears to have become rather brazen and does not seem to fear fighting; she fiercely guards her brother as well as her allies. She has also developed a strong willpower, which can be seen through her refusal to consume human flesh or blood, even in cases of extreme injury or exposure to human blood, which can be seen when she refuses Sanemi Shinazugawa after he attempts to lure her into biting him with his Marechi blood. Her strong willpower remains even when she is no longer a demon, as shown when she willingly leaps in front of Inosuke to protect him from her own brother, who had become a demon and was attempting to kill those around him. Though she could have been killed, Nezuko did not hesitate to protect her brother.\n \nOn the rare occasion that Nezuko attempts speech, she has been seen to stutter a lot, which may be due to her bamboo mouthpiece, which is seldom removed, and the fact that she didn't speak for a number of years after her transformation. However, after developing resistance towards sunlight, which allows her to go outside and interact with others more often, her speech has shown signs of improvement, and she is able to fully pronounce words if someone else has just spoken them, or hears them repeated frequently enough.\nNezuko has the subconscious memory of Muzan callously slaughtering her family and harbors a deep anger and resentment towards demons. Due to Sakonji Urokodaki hypnotizing her while she slept for two years, this anger manifests into protectiveness and determination when she witnesses demons harming innocent humans in which she pictures the images of her family. However, this can also apply to friendly demons as shown when she sees her youngest brother Rokuta in Yushiro, a cantankerous but good-hearted demon.\n \nInterestingly, when she first fully awakens her demonic powers when fighting Daki in Yoshiwara, Nezuko revealed a side to her that was severely uncharacteristic of her usual benevolence. Although she was at first fueled by the same vengeance against demons, especially since Daki had almost killed Tanjiro, as an awakened demon herself, her rage grew beyond being justified at being a victim of their cruelty. Witnessing Daki struggle in agony, Nezuko tortured the demon in a manner typical of the species' sadism towards humans, demonstrated by her wicked grin and laughter as she brutalized her opponent. Nezuko had also regressed back to her feral demonic state; when she saw a woman with an open bleeding wound, she instantly became tantalized and attempted to attack her. Fortunately, Tanjiro intervened and brought Nezuko back to her normal self by singing a lullaby their late mother sung, filling Nezuko with enough shame and grief for her to regain control of her impulses. Eventually, during the battle against Hantengu, Nezuko was able to control herself in this form, enabling her to fight with a stable mind and her superior strength together. \nIt was later revealed by Tamayo that her missing memories and underdeveloped personality were due to her not being fully conscious, as she prioritized developing her resistance to the sun over regaining her consciousness.\nAbilities\n\nOverall Abilities\n \nDespite not being a member of the Twelve Kizuki, Nezuko is a very powerful demon. Her most prominent trait is her extraordinary growth rate, due to the high amount of blood she received from Muzan Kibutsuji when he turned Nezuko into a demon. This was shown in many battles where she could defeat her enemies despite being overwhelmed by them in the beginning. She has been shown to defeat her enemies by increasing her own physical capabilities, enhancing her regeneration, or developing her own Blood Demon Art in dire situations. \nNezuko has displayed great combat proficiency and skill in battle, overpowering the Temple Demon, Swamp Demon, and Susamaru. Later on, her power further augmented to the point where she could fight against the likes of the Upper Ranks of the Twelve Kizuki, such as Daki, whom she easily managed to overpower despite initially being no match for her, and Hantengu's clones, who she could fight on equal grounds with.\nDemon Abilities\nAbnormal Demon Physiology: Nezuko has several unique traits that set her apart from all other demons. Most notably, Nezuko can continuously restore her power without consuming any human blood, like any other demon would need to do. Instead, she recovers her strength through sleep alone, though she would have to spend a lot of time sleeping in order to recuperate and regain her power. Moreover, Nezuko has an extraordinary growth rate, as shown multiple times when she grows stronger without any training or consuming humans. This ability is shown to trigger even in the midst of battle and with huge power boosts. Her rapid growth in power was first displayed during her battle against Susamaru; though her foot was initially blown off by the Temari Demon's ball attack, upon regenerating, she was able to take the force of her attack and engage the demon in a back-and-forth skirmish that she was even able to come out of triumphant.\nAdvanced Demon Form: Nezuko has the ability to enter a berserk state where she becomes more demonic in appearance, transforming into an adult version of herself with vine-like tattoos that circle her body and a single horn protruding from her right forehead side. Nezuko's physical capabilities in this state are drastically increased to the point where she could sever Daki's limbs by stomping on them and kick her extremely far distances, destroying multiple buildings in the process. Her regenerative abilities also become on par with those of the Upper Ranks of the Twelve Kizuki. When she first awakened this ability in her fight with Daki, she became frenzied in battle, lost her usual restraint to human blood, and only reverted back to normal when Tanjiro sang her a lullaby. She eventually became able to transform into her Advanced Demon Form while maintaining her usual composure and keeping herself from feeding on or attacking humans during the battle in the Swordsmith Village.\nSunlight Immunity: During her battle with Hantengu, she suddenly managed to develop immunity to sunlight, allowing her to be active regardless of whether she was in the sun or not.\n \nBlood Control: In addition to her Blood Demon Art, Nezuko has shown in her Advanced Demon Form that she has control over her own blood's viscosity. When her limbs and head were severed and she was going to be attacked by Daki further, Nezuko managed to control her limbs and head by congealing and solidifying the blood spraying from them before the streams could break apart. She was able to command her limbs to grab and stop Daki's sashes, and, even though it was done with floating, severed limbs connected by blood, she was able to do it with such strength that the sashes were stopped dead in their tracks. She was then able to pull all of her limbs back together through those blood streams, allowing her body to regenerate.\n \nImmense Regeneration: As a demon, Nezuko has enhanced regenerative abilities that allow her to heal in the blink of an eye. When she first became a demon, her regeneration was relatively slow compared to other demons, taking a few moments to heal her wounds. However, once in her awakened state, her regeneration ability evolved to the point where it matched the caliber of the Upper Ranks of the Twelve Kizuki, allowing her to reconnect her whole torso and body parts as well as regrow her arms and legs instantly. Daki noted that Nezuko's regeneration surpassed her own.\nSize Alteration: Upon being transformed into a demon, Nezuko displayed the basic ability to change and alter her body's size and height. She was able to shrink herself into the physical size of a small child in order to fit inside a small box or a basket, and she could also enlarge herself into a much bigger form.\nPhysical Abilities\nImmense Speed & Reflexes: As a demon, Nezuko already possessed speed that was far superior to regular humans. However, the true extent of her tremendous speed was displayed in her Advanced Demon Form. After becoming stronger, she was able to lunge forward to attack Upper Rank Six Daki before she could comprehend her new opponent's change. Later in the battle, she was able to kick the demon incredibly far down a street and caught up to her midway to continue her assault on the overwhelmed Upper Rank. In the battle in the Swordsmith Village, Nezuko was able to battle and react to Hantengu's clones and even overwhelm them on occasion. \n \nImmense Strength: Nezuko possesses naturally enhanced physical strength as a demon. Even after her recent transformation and with little sleep to recover, she was strong enough to decapitate the Temple Demon with a kick. Nezuko punched the Swamp Demon hard enough to cause him to cough blood and was capable of overwhelming the demon with powerful punches and kicks. As she has no previous combative experience, Nezuko relies on brute strength, using her legs as her main weapon to deliver fast and strong kicks. She has also been shown to increase her strength in battles during dire situations, like strengthening her legs to kick back Susamaru's handballs despite having her legs torn off by them earlier.\n \nIn her Advanced Demon Form, she could pierce through Daki's durable body with a single kick and was able to hold down her obi with her bare limbs; these same obi were powerful enough to wreak massive destruction across a city. In her battle against Upper Rank Four Hantengu, Nezuko was capable of attacking the demon's clones on equal grounds, kicking Karaku's mouth and partially severing his head, grappling with Aizetsu, and leaping high enough into the air to save Tanjiro Kamado when Zohakuten's giant dragons tried to crush him.\nFighting Style\nSkilled Hand-to-hand Combat: Despite having no known fighting experience prior to becoming a demon, Nezuko is a skilled brawler, making full use of her enhanced physical prowess. Her fighting style mainly revolves around the use of her powerful legs to deliver devastating blows and her sharp nails. Since transforming into a demon, she has been a major contributor to battles fought by Tanjiro, frequently assisting on the occasion that he is overwhelmed by an opponent. \nBlood Demon Art\n \nCombustible Blood: Nezuko's Blood Demon Art allows her to combust her blood into pink-colored flames at will. Activating it required Nezuko to physically bleed from open wounds, inflicted by either demon opponents or herself via self-mutilation. Notable examples of the latter were when she ripped her arm off when wrestling with Karaku to splatter blood on him, and slid herself down Aizetsu's yari when impaled to douse him. Her flames have a special property that makes them exclusively harmful to demons, objects belonging to demons, and Blood Demon Arts while being completely harmless to humans and other objects. These flames can hamper the regeneration of other demons. This is shown when Daki's burns took much longer to heal than traditional wounds, and the emotional manifesations of Hantengu had their regeneration stalled after being decapitated with a Bright Red Nichirin Sword ignited by Nezuko's blood, with Karaku wailing about the pain. Nezuko's Blood Demon Art was also able to neutralize Gyutaro's poison to save Inosuke Hashibira and Tengen Uzui from dying. Her flames also have the ability to temporarily turn Nichirin Swords bright red, increasing the strength of attacks inflicted by them. A drawback to Nezuko's Blood Demon Art is that overuse of it can cause her to fall asleep.\nTechniques\nTechniques Demonstrations \nExploding Blood (爆血, Bakketsu?) - Nezuko can ignite the blood that has exited her body, turning it into crimson-pinkish flames that are harmful to demons.\nGame Exclusive Techniques\nCrazy Scratching (乱れ裂き, Midarezaki?) - Nezuko unleashes a rampage of overlapping slashes with her nails covered with the crimson-pink flames of her Blood Demon Art until it finishes with a larger X-shaped slash with both her arms.\nHeel Bash (かかと落とし, Kakato Otoshi?) - Nezuko flips into the air, and with the momentum of the flip, unleashes a downward axe-kick. The axe-kick itself is powerful enough to cause a small crater in the terrain.\nExploding Blood Heel Bash (爆血かかと落とし, Bakketsu Kakato Otoshi?) - A stronger variation of Heel Bash where Nezuko in her advanced demon form \"teleports\" into the air and unleashes a downward axe-kick with great force, creating a surge of crimson-pink flames upon contact with the terrain.\nFlying Kick (飛びかかり蹴り, Tobikakari Geri?) - Nezuko jumps in the air and quickly performs a diving kick. Upon hitting her opponent, she then backflips, using the momentum to kick her opponent high into the air.\nNails of Fury (切り裂く爪, Kirisaku Tsume?) - Nezuko unleashes a powerful uppercut scratch, with trails of her pink flames being left behind.\nFrenzied Kicks (連続蹴り, Renzoku Geri?) - Nezuko releases two upward kicks, followed up by a horizontal rotating kick right after.\nExploding Blood Strike (爆血突き, Bakketsu Tsuki?) - Nezuko lunges forward and performs a knife hand thrust that leaves a trail of pink flames.\nDrop Kick (蹴りおろし, Keri Oroshi?) - Nezuko dashes forward at blinding speeds to simulate teleportation and performs a powerful drop kick with just one leg.\nFiery Slash (爆炎裂き, Bakuen Zaki?) - Nezuko unleashes an X-shaped scratch that engulfs her target into a whirlwind of pink flames and retreats back.\nSpin Kick (廻し蹴り, Mawashi Geri?) - Nezuko charges forward and unleashes a lateral spinning vertical kick to slam her opponent to the ground, causing a large explosion of crimson-pink flames as a result.\nExploding Blood, Rupture (爆血・猛擊, Bakketsu - Mōgeki?) - Nezuko performs a drop kick at her opponent and drags them along the ground, followed up with a series of scratches from left to right and vice versa that slowly engulf the ground on fire before finishing it off with a destructive axe-kick, uprooting and igniting the ground into crimson-pink flames.\nExploding Blood, Hellfire (爆血・渦, Bakketsu - Uzu?) - Nezuko performs a dropkick, sending the target flying back as she leaps forwards and stamps them back into the ground. Back flipping off of them and charging up Exploding Blood on her left leg, a spinning tornado of pink flames forms on her foot, shaping into a drill as she rapidly descends towards her target, the flames engulfing her enemy.\nExploding Blood Sword (爆血刀, Bakketsutō?) - An alternative version of Sun Halo Dragon Head Dance by Tanjiro Kamado notable for the collaborative usage of Nezuko Kamado's Blood Demon Art. The siblings coordinate their attacks to strike their opponent with Sun Breathing and combustible blood slashes simultaneously, which combine into the form of a Japanese dragon made of solar flames, so powerful that it looks like the opponent is being eaten. Afterwards, Nezuko cuts her hand on her brother's blade, coating it in her blood and activating her Blood Demon Art. The siblings then lunge at the opponent in sync, and finish with an extremely powerful and Blood Demon Art-amplified version of Sun Halo Dragon Head Dance.\nSpark of Romance (愛の閃き, Ai no Hirameki?) - A collaboration between Nezuko and Zenitsu Agatsuma when unconscious. However, Nezuko's only input is kicking their opponent back, as Zenitsu asks for his crush to stay back, vowing to protect her himself. Zenitsu then blitzes their opponent using Thunder Breathing: Thunderclap and Flash, Sixfold. For her part, Nezuko watches in amazement at his power, and confusion at his unconscious state.\nSpinning Baguette (ぐるぐるフランスパン, Guruguru Furansu Pan?) - A technique exclusive to the Kimetsu Academy version of Nezuko Kamado. Nezuko bumps into her opponent and accidentally drops her purse carrying baguettes. Angered, Nezuko spins around while swinging her purse and creating a whirlwind of pink flames, eventually building enough momentum to whack her opponent with it.\n— Nezuko's Blood Demon Art —\nAnimeMangaGames\nExploding Blood\nExploding Blood\nHinokami Chronicles\nExploding BloodExploding Blood, HellifreExploding Blood Heel BashExploding Blood StrikeExploding Blood, RuptureCrazy ScratchingHeel BashFlying KickFlying Kick (Alt)Nails of FurySpin KickFrenzied KicksDrop KickFiery SlashExploding Blood SwordSpark of Romance\nJumputi Heroes\nExloding Blood\nBattles\nNezuko Kamado Battles\nFinal Selection Arc\nTanjiro Kamado and Nezuko Kamado vs Giyu Tomioka\nTanjiro Kamado and Nezuko Kamado vs Temple Demon\nKidnapper's Bog Arc\nTanjiro Kamado and Nezuko Kamado vs Swamp Demon\nAsakusa Arc\nTanjiro Kamado, Nezuko Kamado, Tamayo and Yushiro vs Susamaru and Yahaba\nMount Natagumo Arc\nTanjiro Kamado, Nezuko Kamado, and Giyu Tomioka vs Rui\nMugen Train Arc\nDemon Slayers vs Enmu\nEntertainment District Arc\nDemon Slayers vs Daki and Gyutaro\nTanjiro Kamado and Nezuko Kamado vs Mantis Demon\nSwordsmith Village Arc\nTanjiro Kamado, Nezuko Kamado, Genya Shinazugawa and Mitsuri Kanroji vs Hantengu\nSunrise Countdown Arc\nDemon Slayers vs Tanjiro Kamado\nRelatives\n \n \n \n \n \n \n \n \n \n \n \n \nSumiyoshi\n \n \n \n \nSuyako\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSumire\n \n \n \n \nSon\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nTanjuro\n \n \n \n \nKie\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nTanjiro\n \n \n \n \nKanao\n \n \n \n \nZenitsu\n \n \n \n \nNezuko\n \n \n \n \nTakeo\n \n \n \n \nHanako\n \n \n \n \nShigeru\n \n \n \n \nRokuta\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nChild\n \n \n \n \nSpouse\n \n \n \n \nChild\n \n \n \n \nSpouse\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nChild\n \n \n \n \nSpouse\n \n \n \n \nChild\n \n \n \n \nSpouse\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSpouse\n \n \n \n \nChild\n \n \n \n \n \n \n \n \n \n \n \n \nToko\n \n \n \n \nYoshiteru\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Kanata\n \n \n \n \nSumihiko\n*The story does not indicate which child of Sumiyoshi carries on the lineage nor the quantity of generations that follow prior to Tanjuro.\nTrivia\nNezuko is the first demon to ever be a member of the Demon Slayer Corps.\nThe first kanji of Nezuko's name means \"red bean\" (禰豆, nezu?) and is also part of the Japanese word for a flower, the Japanese Snowball (伍禰豆, gonezu?). Whereas the second kanji is a common feminine suffix, which translates to \"child\" (子, ko?). The first kanji of her last name translates to a traditional Japanese wood or charcoal-fuelled cookstove/furnace (竈, kama?), while the second kanji means \"door\" (門, do?).\nThe fact that her surname translates to the word for a wood-fueled furnace is likely a reference to her family's occupation prior to their demise.\nNezuko was born on Mount Kumotori in Okutama, Tokyo.\nThe first part of Nezuko Japanese voice actress' name, Akari Kitō (鬼頭 明里, Kitō Akari?), means \"Demon\" (鬼, ki?).\nNezuko and Kito also share the same height, 5'0\".\nNezuko's English voice actress, Abby Trott, also voices Ukogi, Zenitsu's sparrow.\nNezuko's rankings in the popularity polls are as follows:\nNezuko ranked 3rd place in the first popularity poll with 3,319 votes.\nNezuko ranked 11th place in the second popularity poll with 5,000 votes.\nThe reason Nezuko's hair isn't bound up now that she's a demon is because Tanjiro is not that good at doing it for her and she cannot do it herself now. The accessory she has at the front is the one piece Tanjiro can do well for her, and since Nezuko doesn't remove it, it stays on.\nNezuko gets really happy when her hair is braided like Mitsuri Kanroji's. Tanjiro is shown trying to braid it for her after Chapter 105.\nBefore becoming a demon, Takeo Kamado once asked Nezuko about her ideal man. She replied by saying \"My ideal man is like a rook!\", referring to a shogi piece that can move any number of squares horizontally or vertically.\nNezuko is good at rock, paper, scissors. When she and her brother have to decide something and can't come to an agreement, they play rock paper scissors, and she always wins.\nNezuko's favorite food is konpeitō (金平糖, Konpeitō?), Japanese colored sugar sweets shaped like tiny-orbs with small bulges all around it.\nNezuko's hobby is sewing. She's so good at it, she managed to repair Giyu's damaged haori after the decisive battle against Muzan.\nIn Kimetsu Academy, Nezuko is a girl who's known to bite baguettes and keeps it in her mouth, referencing her bamboo muzzle.\nNezuko's portrayal in various media shares similarities with Nene Yashiro from Jibaku Shounen Hanako-kun. Both share the same Japanese voice actress, Kitō Akari, and the same stage actress, Takaishi Akari.\nQuotes\n(To herself) \"Humans are to be protected and saved... I will never hurt them.\" \n(To Tanjiro Kamado) \"Stop apologizing, Tanjiro. Why are you always saying you're sorry? Is it because we were poor? Did you feel unworthy because you wore a tattered kimono? Is that why you're always looking to take the blame? That's just the way things were when father died. We tried as hard as we could, but it didn't work. It's no one's fault. Things don't go exactly the way we want them to. We're only human. You get to decide where your happiness comes from. What's important is now. Let's look to the future. Let's do our bestーtogether!\"\n(To Tanjiro Kamado) \"My dear brother! I'm so sorry. I'm sorry I didn't understand for so long. I put everything on your shoulders. Why is it you who always has to suffer? Why do kind people who struggle every day get trampled over and over? It's frustrating but don't give in! It is almost over so don't turn into a demon. Let's go home. Let's go back home together.\"\nReferences\n↑ Kimetsu no Yaiba Manga: Chapter 127 (Page 11).\n↑ Rengoku Volume 0\n↑ Kimetsu no Yaiba Manga: Chapter 196 (Page 12).\n↑ https://twitter.com/kimetsu_off/status/1210696997839110144\n↑ Kimetsu no Yaiba Manga: Chapter 15 (Page 3).\n↑ Kimetsu no Yaiba Manga: Chapter 1 (Page 40).\n↑ Kimetsu no Yaiba Manga: Chapter 1 (Page 4).\n↑ Kimetsu no Yaiba Manga: Chapter 204 (Page 1).\n↑ Kimetsu no Yaiba Manga: Chapter 3 (Page 14).\n↑ Kimetsu no Yaiba Manga: Chapter 1 (Page 5).\n↑ Kimetsu no Yaiba Manga: Chapter 204.\n↑ Kimetsu no Yaiba Manga: Chapter 47 (Pages 5-11).\n↑ Kimetsu no Yaiba Manga: Chapter 127 (Pages 3-4).\n↑ Kimetsu no Yaiba Manga: Chapter 128 (Page 7).\n↑ Kimetsu no Yaiba Manga: Chapter 127 (Page 2).\n↑ Kimetsu no Yaiba Manga: Chapter 84 (Page 4).\n↑ Kimetsu no Yaiba Manga: Chapter 95 (Page 14).\n↑ Kimetsu no Yaiba Manga: Volume 7, (Extra Pages).\n↑ Kimetsu no Yaiba Manga: Chapter 40.\n↑ 20.00 20.01 20.02 20.03 20.04 20.05 20.06 20.07 20.08 20.09 20.10 20.11 Kimetsu no Yaiba Game: The Hinokami Chronicles.\n↑ 21.0 21.1 21.2 Kimetsu no Yaiba Game: The Hinokami Chronicles 2.\n↑ Kimetsu no Yaiba Manga: Volume 12, (Extra Pages).\n↑ Jump GIGA: 2016 Vol.1\n↑ Kimetsu no Yaiba First Fanbook.\n↑ Kimetsu no Yaiba First Fanbook.\n↑ Kimetsu no Yaiba Second Fanbook.\n↑ Kimetsu no Yaiba Manga: Volume 2, (Extra Pages).\n↑ Kimetsu no Yaiba Anime: Episode 22.\n↑ Kimetsu no Yaiba Manga: Chapter 92 (Pages 8-9).\n↑ Kimetsu no Yaiba Manga: Chapter 202 (Pages 2-3).\nNavigation\n Characters\nDemon Slayer Corps\nUbuyashiki Family:\nKagaya Ubuyashiki · Amane Ubuyashiki · Hinaki Ubuyashiki · Nichika Ubuyashiki · Kiriya Ubuyashiki · Kuina Ubuyashiki · Kanata Ubuyashiki · Senri Ubuyashiki · Akito Ubuyashiki\nHashira:\nGiyu Tomioka · Mitsuri Kanroji · Obanai Iguro · Sanemi Shinazugawa · Gyomei Himejima · Kyojuro Rengoku · Tengen Uzui · Muichiro Tokito · Shinobu Kocho · Kanae Kocho · Sakonji Urokodaki · Jigoro Kuwajima · Shinjuro Rengoku\nDemon Slayers:\nTanjiro Kamado · Zenitsu Agatsuma · Inosuke Hashibira · Genya Shinazugawa · Kanao Tsuyuri · Murata · Ozaki · Masachika Kumeno · Yoriichi Tsugikuni · Takeuchi · Nagakura · Noguchi · Yoshioka · Shimamoto\nButterfly Mansion:\nAoi Kanzaki · Sumi Nakahara · Kiyo Terauchi · Naho Takada · Goto\nSwordsmith Village:\nTecchin Tecchikawahara · Hotaru Haganezuka · Kozo Kanamori · Kotetsu · Tetsumotonaka · Tetsudoji · Tetsutani · Tetsuido\nOther/Associates:\nSabito · Makomo · Suma · Makio · Hinatsuru · Masao Maeda\nDemons\nDemons:\nMuzan Kibutsuji · Nezuko Kamado · Temple Demon · Hand Demon · Swamp Demon · Asakusa Demon · Tamayo · Yushiro · Susamaru · Yahaba · Tongue Demon · Horned Demon · Spider Demon (Father) · Spider Demon (Mother) · Spider Demon (Son) · Spider Demon (Daughter) · Shizu Shinazugawa · Woodland Demon · Serpent Demon\nTwelve Kizuki:\nKokushibo · Doma · Akaza · Nakime · Hantengu · Gyokko · Gyutaro · Daki · Kaigaku · Enmu · Rokuro · Wakuraba · Mukago · Rui · Kamanue · Kyogai\nCivilians/Other\nKamado Family:\nTanjuro Kamado · Kie Kamado · Takeo Kamado · Hanako Kamado · Shigeru Kamado · Rokuta Kamado · Sumiyoshi Kamado · Suyako Kamado · Sumire Kamado\nShinazugawa Family:\nKyogo Shinazugawa · Sumi Shinazugawa · Teiko Shinazugawa · Hiroshi Shinazugawa · Koto Shinazugawa · Shuya Shinazugawa\nNorthwest Town:\nKazumi · Satoko · Tokie\nTsuzumi Mansion:\nTeruko · Shoichi · Kiyoshi\nEntertainment District:\nKoinatsu · Omitsu · Toyo · Rei · Yatsu\nOther:\nSaburo · Hisa · Senjuro Rengoku · Ruka Rengoku · Yuichiro Tokito · Tsutako Tomioka · Sayo · Keizo · Koyuki · Kotoha Hashibira · Akeno Tsugikuni · Uta · Takaharu\nAnimals:\nChachamaru · Kaburamaru\nSpecies/Groups:\nKasugai Crows · Ninju\nDescendants/Reincarnations\nKamado Family:\nKanata Kamado · Sumihiko Kamado\nAgatsuma Family:\nToko Agatsuma · Yoshiteru Agatsuma\nOther:\nAoba Hashibira · Tojuro Rengoku · Tenma Uzui · Giichi Tomioka · Sanehiro Shinazugawa\nSpin-Off/Anime Original Characters\nDemon Slayers:\nUraga\nCivilians:\nYae · Taro · Fuku · Tomi · Tatsu\nDemons:\nMatazo · Hairo · Flute Demon · Ubume · Slasher · Mantis Demon"
}