{
  "requested_name": "Nobara Kugisaki",
  "resolved_title": "Nobara Kugisaki",
  "url": "https://jujutsu-kaisen.fandom.com/en/wiki/Nobara_Kugisaki",
  "summary": "Nobara Kugisaki (釘崎野薔薇, Kugisaki Nobara?) is the tritagonist of the Jujutsu Kaisen series. She is a first-year student and grade 3 jujutsu sorcerer at Tokyo Jujutsu High studying under Satoru Gojo alongside Yuji and Megumi.",
  "full_text": "Nobara Kugisaki\nNobara Kugisaki (釘崎野薔薇, Kugisaki Nobara?) is the tritagonist of the Jujutsu Kaisen series. She is a first-year student and grade 3 jujutsu sorcerer at Tokyo Jujutsu High studying under Satoru Gojo alongside Yuji and Megumi.\nQuick Answers\nWhat is the significance of Nobara Kugisaki's role in the Jujutsu Kaisen series?\n\t\t\t\t\t\tIn the Jujutsu Kaisen series, Nobara Kugisaki is the tritagonist. She is a grade 3 jujutsu sorcerer and a first-year student at Tokyo Jujutsu High, where she studies under Satoru Gojo with Yuji and Megumi. Her role involves facing numerous adversities, such as fighting Mahito's separated bodies.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Fandom\n\t\t\t\t\t\nWhat grade of jujutsu sorcerer is Nobara Kugisaki?\n\t\t\t\t\t\tNobara Kugisaki, a first-year student at Tokyo Jujutsu High, holds the rank of a grade 3 jujutsu sorcerer.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Community\n\t\t\t\t\t\nWhat are the physical characteristics of Nobara Kugisaki?\n\t\t\t\t\t\tNobara Kugisaki, a human female, stands at 160 cm (5'3\") and sports dyed ginger hair. She has orange eyes. Her typical attire includes the Jujutsu High uniform complete with a long skirt, black stockings, and brown shoes. Her hair is typically styled with bangs that cover the right side of her forehead.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Community\n\t\t\t\t\t\nWho are Nobara Kugisaki's classmates at Tokyo Jujutsu High?\n\t\t\t\t\t\tNobara Kugisaki is a first-year student at Tokyo Jujutsu High, training under Satoru Gojo. Her classmates include Yuji Itadori, Megumi Fushiguro. Her upperclassmen are Kinji Hakari, Kirara Hoshi, Maki Zenin, Panda, Toge Inumaki, and Yuta Okkotsu.\n\t\t\t\t\t\n\t\t\t\t\t\tProvided by: Community\n\t\t\t\t\t\n{\"@context\":\"https:\\/\\/schema.org\",\"@type\":\"FAQPage\",\"name\":\"Nobara Kugisaki\",\"mainEntity\":}\nAppearance\nNobara is a girl of average height with a slim figure. She has mid-length brown hair that reaches to her neck that is styled with bangs that cover the right side of her forehead. Nobara has orange eyes, long eyelashes and thin eyebrows of the same color. After sustaining a near-fatal injury from Mahito, she now has an eyepatch covering her left eye.\nNobara's jujutsu school uniform consists of a dark blue gakuran-style top (a button-down jacket) and a long matching skirt that reaches to just above her knees. She also sports black pantyhose and brown shoes along with her signature brown belt that holds her tools for jujutsu.\nAs someone who enjoys dressing up, Nobara has several different outfits. She didn't have a tracksuit prior to enrolling at Jujutsu High and bought one shortly after. The tracksuit included a white and blue hoodie accented with a flower pattern, black tights, and white shoes.\nNobara as a child.Nobara in the manga (gray).Nobara's eyepatch.\nPersonality\n \nNobara is a confident and brash young woman with an unshakable character. More than anything, Nobara is determined to stay true to herself no matter what. She takes great pride in being both a pretty girl and a strong fighter, refusing to let anyone influence her.\nInitially, Nobara can appear to be a very obnoxious and arrogant person. She first introduced herself to Yuji and Megumi by expressing how inferior they were and argued with Yuji for the greater part of their first mission together. Despite her abrasive attitude, Nobara is actually an incredibly caring and dutiful person, but would never let most people see that side of her. After fighting alongside each other on several missions, Yuji and Megumi grew to become Nobara's closest allies.\n \nEven from a young age, Nobara was outspoken and different from everyone else in her small town. She felt everyone was crazy and was determined to trade the small countryside to the big city. Nobara was only ever drawn to outsiders who moved into the village like Fumi and Saori, especially the latter. She looked up to Saori to a great degree and was disheartened when she was forced out of the neighborhood. Saori leaving made Nobara want to escape the village more and aspired to meet Saori again one day. Before attending Jujutsu High, Nobara made a promise to Fumi that the three of them would reunite in Tokyo.\nStaying true to who she is, Nobara carries herself confidently as a jujutsu sorcerer. Whenever Yuji and Megumi tend to be decisive, Nobara is willing to take charge even if the boys don't like it. While they're prone to panic in some situations, Nobara is able to remain relatively level-headed regardless of what's happening. Nobara loves joking around in civil situations and is a huge trash talker in combative ones, no matter who it is. Among all her peers, Nobara looks up to Maki Zenin in particular. She loves the way Maki carries herself and admires her strength as someone fighting against the oppression of their own family.\n \nNobara and Yuji are the two class clowns among the first years that typically annoy Megumi to for a laugh any chance they get. Although she likes to pretend that she doesn't like the boys, Nobara was upset after Yuji's death following the Detention Center incident. She even shed a tear upon his revival and demanded an apology from him.\nMomo Nishimiya insulted Yuji during the Goodwill Event while trying to justify Mai Zenin's undesirable attitude, annoying Nobara. Nobara dislikes Mai, which upset Momo and caused her to monologue about the gender-based discrimination in the Zenin Clan. This only served to annoy Nobara, who couldn't care less about any sentiments based in \"boys versus girls\". Like Saori, Maki is a good person despite the circumstances that surround her while Mai is not. Nobara doesn't believe people are excused just because they come from a difficult background. She openly rejected Momo and told her to consider the kind of person Yuji was before condemning him, citing that life isn't just a job.\n \nUpon first enrolling at Jujutsu High, Satoru Gojo was unsure how a girl from the countryside would fair against gruesome-looking cursed spirits. Satoru believes it takes someone to be virtually insane to voluntarily be a jujutsu sorcerer or else they'll quit quickly. Despite her distaste for crazy people, Nobara has proved she is plenty crazy herself. She passed Satoru's test with flying colors and didn't hesitate to inflict pain on herself during the battle with the Death Paintings, Eso and Kechizu.\nIn order to counter Eso's cursed technique, Nobara willingly stabbed herself with nails and smiled while doing it. She appeared to take pleasure in outwitting her opponents and didn't hesitate to injure herself further in order to ensure victory and her own survival. Together, she and Yuji were victorious and ended up killing both brothers. Although Yuji was guilt-ridden over killing the brothers, Nobara was relatively unfazed. She admitted that she expected killing came with the job of being a jujutsu sorcerer. Noticing that Yuji was acting strange, Nobara comforted him in her own way by claiming that they were both accomplices in the murder.\n \nNobara has a high sense of duty as a jujutsu sorcerer and is a prideful fighter. During the Shibuya Incident, Nobara's pride was hurt by her near defeat at the hands of Haruta Shigemo. After being rescued by Kento Nanami, Nobara wanted to help rescue Satoru from being sealed and redeem herself. However, Nanami refused to let her and ordered her to wait to be rescued. Nobara ignored Nanami's warning because she couldn't bring herself to leave the city while all her allies were still fighting.\nUpon encountering Mahito's double soon afterward, Nobara admitted she didn't have much to show for October 31st and believed beating him would be a solid contribution. Nobara remained confident in her strategy and managed to injure Mahito's soul, forcing him to retreat. Nobara chased him and attempted to exorcise the curse. This overconfidence ultimately proved to be Nobara's downfall.\n \nMahito switched places with his double while Nobara's guard was down against his hands, letting him score a direct hit to her face with Idle Transfiguration. Realizing her time was likely at an end, Nobara took a moment to recall her past life in the village. She used to believe that crazy people like those villagers did nothing but step on other people's lives. However, after meeting all the wild and crazy sorcerers at Jujutsu High, Nobara changed her mind. During this exchange, Yuji watches Nobara with extreme worry and horror. In what could have been her last moments, Nobara smiled at Yuji and asked him to tell everyone that it wasn't so bad in the end.\nFollowing her recovery on December 24, Nobara appeared to still be in high spirits after being brought up to speed about the raid against Sukuna, happily taking the opportunity to help defeat the sorcerer with Resonance. Upon seeing Yuji again, the two got up to old habits by attempting to surprise Megumi with the fact she was alive, later making up for lost time with him after.\nAbilities and Powers\n \nOverall Skill Level: Nobara is ranked as a grade 3 jujutsu sorcerer by Jujutsu High. This is mostly due to her status as a young first-year student and inexperience working as a sorcerer.\nNobara has showcased numerous times the capability to contend with jujutsu users ranked leagues above in terms of grade. Coming into school, Nobara had a solid understanding of how to exorcise curses with her innate technique. She also had the mental fortitude to handle the job but lacked physical ability. While fighting in the Eishu Detention Center, Nobara defended herself adequately until she ran out of nails to fight with.\n \nAfterward, Maki took Nobara under her wing and trained her to improve her physical prowess. The training included heavy stamina conditioning and getting used to getting knocked down by Panda. By the time of the Goodwill Event, Nobara showcased she was in much better shape as a close-combat fighter.\nIn Nobara's fight with Momo, the Kyoto third year had the advantage of flying above Nobara on her broom. Nobara eventually figured out a way to outmaneuver Momo by using the environment to her advantage. Nobara was able to last long enough in that fight due to Maki and Panda's training. She was knocked down several times by gusts of cursed energy wind, but Nobara endured until she figured out a way to counterattack.\n \nDespite ultimately being eliminated from the Goodwill Event, Nobara has since demonstrated the potential to combat special grade curses. Alongside Yuji, Nobara was able to fight on even terms with Eso and Kechizu. Both the students were poisoned by the Death Painting's blood technique, but Nobara used that connection against her adversaries. Thanks to her cleverness and ability to think clearly in high-pressure situations, Nobara instantly figured out a way to counter her opponent's technique.\nNobara's adaptability and fearlessness lead her to use Resonance on herself to injure Eso and Kechizu at the same time. This involved stabbing herself with nails to activate Resonance, but Nobara was more than happy to do so. The poison, as well as the pain from stabbing herself, helped Nobara enter a state of extreme focus, allowing her to unleash the power of Black Flash as well. Nobara and Yuji defeated the special grade curses, prompting Mei Mei (via payment from Satoru) and Todo to recommend her and all her peers for grade 1.\n \nDuring the Shibuya Incident, Nobara underestimated the curse user Shigemo and was taken off guard repeatedly by his uncanny abilities. Shigemo was landing the perfect shots on Nobara, making it difficult for her to keep her balance, let alone fight back. Thinking on her feet, Nobara got Shigemo to talk in order to buy herself some time. This led to Nanami arriving in time to defeat the curse user and rescue her.\n \nHaving little to show for the incident, Nobara continued fighting rather than retreating as she was ordered. She encountered Mahito, an opponent she had information on unlike with Shigemo. In order to combat someone of his caliber, Nobara focused on trying to reach the core of cursed energy, the same feeling that accompanied unlocking Black Flash.\nNobara was able to plan out a strategy accordingly and executed it flawlessly. She led Mahito's double to believe that she was recklessly focusing on physical damage that couldn't hurt his soul. In reality, Nobara knew she could hurt Mahito's soul if she could use his body as an effigy for her technique. After leading him into a false sense of security, Nobara struck his soul and dealt Mahito major damage. Almost immediately, Mahito recognized Nobara as one of his natural enemies in the same way he views Yuji.\nCursed Energy\n \nBlack Flash (黒閃, Kokusen?): A phenomenon that creates a spatial distortion when a user connects an impact of cursed energy within 0.000001 seconds of a physical hit, causing cursed energy to flash black, creating a more potent attack to the power of 2.5 of a normal hit. Nobara unleashed Black Flash for the first time on Kechizu, bringing the Death Painting Womb to a near-death state.\nCursed Technique\nInnate Technique\nStraw Doll Technique (芻霊呪法, Sūrei Juhō?): Nobara's technique involves utilizing jujutsu through a set of tools that includes a hammer, nails, and a straw doll. By channeling her cursed energy through the tools, Nobara can utilize a number of different techniques including sharing damage between her straw doll and her target.\nResonance (共鳴り, Tomonari?): Applies Nobara's cursed energy to her target using a straw doll as an effigy. She can use a severed body part of her target to establish a link to attack the more critical appendenges of her target's body. Upon activation, Resonance causes large black spikes to protrude from the target's chest.\nHairpin (簪, Kanzashi?): A technique that causes the cursed energy imbued nails to erupt with explosive force. This causes the shroud of cursed energy around the nails to expand until the point of detonation.\nEquipment\nCursed Tools\nHammer: Nobara's primary weapon is her signature metal hammer decorated with a heart. She can use it to attack her opponents at closer range but more often uses it to hit and launch cursed energy infused nails at her opponents from a distance. It is also essential to activating her Resonance technique. Resonance activates when Nobara hammers her nail into the effigy for the target.\nNails: Nobara imbues metal nails with cursed energy to work with her innate technique. This allows Nobara to freely levitate the nails, allowing her to launch them as projectiles at her opponents. The metal nails are also key to all of Nobara's cursed techniques.\nStraw Doll: As the name of her innate technique suggests, Nobara sometimes requires a straw doll in order to perform an exorcism.\nConventional Weaponry\nRubber Mallet: Nobara uses this red hammer to attack humans so that she doesn't kill them.\nBattles & Events\nFearsome Womb Arc\nYuji Itadori & Nobara Kugisaki vs. Cursed Spirits\nEvacuation of the Eishu Detention Center\nNobara Kugisaki vs. Cursed Spirits\nNobara Kugisaki vs. Mai Zenin\nKyoto Goodwill Event Arc\nKyoto Sister-School Goodwill Event\nSpirit Bash Race\nNobara Kugisaki vs. Momo Nishimiya\nBaseball Game\nDeath Painting Arc\nYuji Itadori & Nobara Kugisaki vs. Eso & Kechizu\nShibuya Incident Arc\nThe Shibuya Incident\nNobara Kugisaki & Kento Nanami vs. Haruta Shigemo\nYuji Itadori & Nobara Kugisaki vs. Mahito\nShinjuku Showdown Arc\nJujutsu Sorcerers vs. Sukuna\nTrivia\nNobara's surname contains the kanji for \"nail, peg, tack\" (釘, kugi?) and \"cape, peninsula\" (崎, saki?), and her first name contains \"field, wilderness\" (野, no?) and \"rose\" (薔薇, bara?).\nThe full kanji \"野薔薇\" in her given name refers to her brash and feminine nature.\nThe second kanji \"薔薇\" is associated with roses in merchandise, symbolizing her femininity that values her looks while having a more thorny, tough side.\nThe kanji \"釘\" in her surname alludes to her Straw Doll Technique.\nNobara's rankings in the Popularity Polls are as follows;\nNobara ranked sixth in the first Popularity Poll with 9,590 votes.\nNobara ranked 11th in the second Popularity Poll with 2,152 votes.\nNobara ranked 13th in the third Popularity Poll with 1,012 votes.\nNobara ranked 14th in the fourth Popularity Poll with 1,514 votes.\nNobara is just short of 160 centimeters (5'3\").\nNobara's hair is dyed and it is naturally dark brown.\nHer hair color varies in the anime and manga:\nIn the anime, it is more of a ginger brown color.\nIn manga illustrations, her hair is an orange color.\nNobara goes shopping during her spare time. Her favorite brands are Balenciaga and Onitsuka Tiger.\nNobara buys a lot of food and tries a lot of clothes, enjoying her life in Tokyo.\nThe theme song that Gege Akutami chose for Nobara is \"Seishun Kyosokyoku\" by Sunny Day Service and \"Ano Depaato\" by Natsuko Nisshoku.\nGege Akutami acknowledged that Nobara's hammer changes shape due to their drawing but there is no meaning behind it.\nNobara was unaware that Jujutsu High provided custom uniforms for the summer season and that's why she wanted Mai Zenin's.\nAccording to Jujutsu Kaisen Official Fanbook:\nEnrollment method: Grandmother's recommendation (they had a fight though).\nHer hobby is shopping.\nFavorite dish: Popular food and watermelon.\nLeast favorite dish: Lightly pickled vegetables.\nCause of stress: Dehydration.\nHer ideal type of man: Oda Nobunaga.\nNobara Kugisaki won the award for Best Girl in Crunchyroll Anime Awards 2022.\nReferences\n↑ 1.0 1.1 1.2 1.3 1.4 Jujutsu Kaisen Official Fanbook: (p. 12-15).\n↑ 2.0 2.1 2.2 2.3 2.4 2.5 Jujutsu Kaisen Manga: Vol. 1, Profile\n↑ \nJujutsu Kaisen Manga: Chapter 267 (p. 11).\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 18 (p. 4) and Episode 8.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 5 (p. 16) and Episode 3.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 41 (p. 11) and Episode 17.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 4 (p. 4, 11-12) and Episode 3.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 125 (p. 1-2) and Episode 43.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 125 (p. 4-11) and Episode 43.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 18 (p. 6-9) and Episode 8.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 10 (p. 6) and Episode 5.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 41 (p. 6-7) and Episode 17.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 5 (p. 13) and Episode 3.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 60 (p. 19) and Episode 24.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 63 (p. 1-7) and Episode 24.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 101 (p. 1-2) and Episode 36.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 123 (p. 3) and Episode 43.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 121 (p. 15) and Episode 42.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 124 (p. 14-15) and Episode 43.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 125 (p. 17-19) and Episode 43.\n \n↑ \nJujutsu Kaisen Manga: Chapter 268 (p. 12-13).\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 5 (p. 10-13) and Episode 3.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 7 (p. 13-14) and Episode 4.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 12 (p. 9) and Episode 6.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 41 (p. 2-13) and Episode 17.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 61 (pp. 2—3) and Episode 24.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 61 (p. 4-15) and Episode 24.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 99 (p. 13-18) and Episode 36.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 123 (p. 16-22) and Episode 43.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 61 (pp. 14-15) and Episode 24.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 5 (p. 12) and Episode 3.\n \n↑ \nJujutsu Kaisen Manga and Anime: Chapter 41 (p. 7-8) and Episode 17.\n \n↑ \nJujutsu Kaisen Manga: Vol. 3, Theme Songs\n \n↑ \nJujutsu Kaisen Manga: Vol. 12 (p. 46).\n \n↑ \nJujutsu Kaisen Manga: Vol. 12 (p. 88).\n \nNavigation\n Characters\nTokyo Jujutsu High\nFaculty\nAkari Nitta • Atsuya Kusakabe • Kiyotaka Ijichi • Masamichi Yaga • Satoru Gojo • Shoko Ieiri\nStudents\nKinji Hakari • Kirara Hoshi • Maki Zenin • Megumi Fushiguro • Nobara Kugisaki • Panda • Toge Inumaki • Yu Haibara • Yuji Itadori • Yuta Okkotsu\nKyoto Jujutsu High\nFaculty\nUtahime Iori • Yoshinobu Gakuganji\nStudents\nArata Nitta • Aoi Todo • Kasumi Miwa • Kokichi Muta • Mai Zenin • Momo Nishimiya • Noritoshi Kamo\nJujutsu Sorcerers\nProfessional Sorcerers\nKento Nanami • Mei Mei • Takuma Ino • Tengen • Yuki Tsukumo\nZenin Clan\nChojuro Zenin • Jinichi Zenin • Naobito Zenin • Naoya Zenin • Nobuaki Zenin • Ogi Zenin • Ranta Zenin\nKamo Clan\nNoritoshi Kamo • Shino\nCulling Games Players\nAngel • Charles Bernard • Chizuru Hari • Dhruv Lakdawalla • Fumihiko Takaba • Haba • Hagane Daido • Hajime Kashimo • Hana Kurusu • Hanyu • Hiromi Higuruma • Iori Hazenoki • Reggie Star • Remi • Rin Amai • Rokujushi Miyo • Ryu Ishigori • Takako Uro • Yorozu\nNon-Combatants\nKaori Itadori • Misato Kuroi • Riko Amanai • Ui Ui\nFukuoka Branch Campus\nKaito Yuki • Kensuke Nagino • Saki Rindo\nCurse Users\nSuguru Geto's Group\nLarue • Manami Suda • Miguel Oduol • Mimiko Hasaba • Nanako Hasaba • Suguru Geto • Toshihisa Negi\nKenjaku's Group\nHaruta Shigemo • Jiro Awasaka • Juzo Kumiya • Kenjaku • Niji Ebina • Ogami • Ogami's grandson • Sukuna • Uraume\nQ\nBayer • Kokun\nNon-Curse Users\nShigeru Sonoda • Shiu Kong • Toji Fushiguro\nCursed Spirits\nMahito's Group\nDagon • Hanami • Jogo • Mahito\nVengeful Spirits\nKuchisake-Onna • Michizane Sugawara • Rika Orimoto • Tamamo-no-Mae Incarnate\nDeath Paintings\nChoso • Eso • Kechizu\nOther Curses\nAkuro-o Otake • Finger Bearer • Fly Heads • Ganesha • Ko-Guy • Kurourushi • Rainbow Dragon • Rika • Smallpox Deity\nNon-Sorcerers\nSugisawa Third High School\nSetsuko Sasaki • Takagi • Takeshi Iguchi\nSatozakura High School\nJunpei Yoshino • Shota Ito • Sotomura\nSaitama Urami East Junior High\nFujinuma • Taichi Kanada • Takeda • Tsumiki Fushiguro\nCivilians\nFurudate • Fumi • Jin Itadori • Keita Oe • Nagi Yoshino • Saori • Tadashi Okazaki • Takada-chan • Wasuke Itadori • Yuko Ozawa\nU.S. Government\nCyrus Veil • Garry K. Johnson"
}