{
  "requested_name": "Power",
  "resolved_title": "Power",
  "url": "https://chainsaw-man.fandom.com/en/wiki/Power",
  "summary": "\"Hey, hey, hey! Grovel, human!! My name is Power! Are you my buddy or whatever?!\"",
  "full_text": "Power\n\"Hey, hey, hey! Grovel, human!! My name is Power! Are you my buddy or whatever?!\"\n\"All lives are equally trivial. Including mine. So any death, even my own, is nothing to be sad about. But... but...! Denji... can't die... cuz Denji's... Denji's... my first... friend.\"\nPower (パワー, Pawā?) is the tritagonist of the Public Safety Saga. She is the Blood Fiend (血の魔人, Chi no Majin?) who embodies the concept of blood and a Public Safety Devil Hunter working under Makima's special squad.\nAppearance\n\nFiend Form\nPower possesses the corpse of an unknown woman or girl with long hair. She mainly appears being blonde. Her hair color varies from blonde to pink in manga illustrations, even appearing dirty blonde in some official art, and appears strawberry blonde in the anime. As a Fiend, she has red and yellow eyes that form a cross pattern, sharp teeth with defined fangs, and light red horns protruding from the top of her head. If Power accumulates too much blood, her horns become larger and more curved, and she can sprout additional pairs of horns from the sides of her head.\nPower usually wears the standard dress shirt, tie, and slacks required of Public Safety Devil Hunters. Normally, she wears breast pads to increase the size of her bust. She almost always wears her jacket hanging halfway off her body giving her an untidy, half-dressed appearance.\nDevil Form\nIn her Blood Devil (血の悪魔, Chi no Akuma?) form, she appears as a tall humanoid with four arms and a mostly pale-skinned body. Her head has a pointed appearance with a red color, sharp teeth, and two circular eyes with cross-like pupils. She also has long horns, resembling how her Fiend form looked with too much blood, and longer hair in this form. Her chest has an open rib cage showing a chest cavity full of intestines up to her neck. Her arms have red coloration from hand to elbow. She has four-fingered hands and large claws. Her legs have the same red coloration from the mid-thigh down, ending in heel-like feet and she has a cat-like tail.\nPower without her blue jacket in the anime.Devil Form\nPersonality\nPower is childish, greedy, and almost entirely self-motivated. She tends to fight as if she has something to gain and is certain of her victory, and has no problems with running away from a fight where she is outmatched. She feels the need to boast her superiority over her fellow Devil Hunters due to her status as a Fiend. She has no loyalty to humans or Devils, openly admitting that she will join whichever is the winning side. Power also enjoys the thrill of a fight and enjoys showing off her strength and proving her own superiority. When she was in front of an swarm of zombies, she got excited and told Denji to watch carefully how she single-handedly defeats all of them. She is highly egotistical and often claims she is capable of doing things she cannot actually do, only to abandon them halfway through when the situation turns sour for her. She frequently deflects the consequences of her actions to those around her.\nPower is a compulsive habitual liar; after getting in trouble with Makima for killing a Devil when she wasn't supposed to, Power immediately blamed Denji and claimed he told her to kill it. She also blamed Denji for eating all of the emergency food that the team collected even while she had crumbs on her face, and when accused of abandoning a fight because she was scared, Power falsely stated that she ran away merely because she was hungry.\nPower is also rude, unkempt, and feels as though those around her should clean up after her. She self-admittedly rarely bathes or flushes the toilet and sees humans as being overly sensitive for caring about their hygiene so much.\nPower has a tendency of imagining several ways of making humans kneel and suffer. When they were trapped in a hotel due to the ability of the Eternity Devil she spent most of the time there \"planning\" to win a Nobel Prize and become Japan's Prime Minister so she could raise up their taxes up to 100%.\nShe has no problem gossiping and talking about her friends behind their backs; sharing the secret of Aki's shortened lifespan with the Angel Devil.\nPower sees no difference between pork, beef and human meat; being willing to eat all of them, even if the meat is disgusting zombie flesh. She hates vegetables, throwing them away when she finds them in her meal. Power is an insatiable glutton, eating all of the stored food that the team needed in order to survive the Eternity Devil's trap and hoarding food for herself at the Division 4's newbie welcoming party. When asked by Aki about what reward she could want as part of their mission, Power stated that she desired to suck a human's blood until they die. When promised Denji's blood, Power became ecstatic at the prospect.\nAfter returning from Hell and witnessing the power of the Darkness Devil, Power develops severe PTSD, being completely afraid of being alone and feeling that she will be swallowed by the Darkness Devil. As a result, she needs Aki and Denji to help take care of her, helping her to eat, bathe, and sleep, revealing a more vulnerable side.\nThough she is extremely selfish, Power was able to experience compassion for the first time towards her pet, after only caring about the smell and taste of blood and the feeling of death when she was killing something. This compassion prompted her to act for the sake of another being when her pet Meowy was kidnapped. Power also begins to care for a select few close friends, such as Denji, as evidenced by getting him a birthday cake, and later putting herself in direct danger in order to protect him. She also appears to care about Aki and is saddened and afraid when he becomes the Gun Fiend. Contrary to her core values, Power developed such extreme loyalty to her friend Denji that she denied her impulse to sacrifice him to Makima in order to save herself, ultimately saving his life at the cost of her own, and proving that she is capable of putting others before herself.\nRelationships\n\nMeowy\nDespite initially wanting to eat her and taking care of her only so that she could be fattened up, Power cares deeply for her cat, Meowy. She was willing to sacrifice Denji's life to save her from the Bat Devil. When she thought Meowy was dead after being eaten by the Bat Devil, Power became despondent and empathized with Denji before allowing herself to be eaten.\nDenji\nPower and Denji initially had a rocky relationship, with Power being entirely willing to trick and sacrifice Denji to the Bat Devil for Meowy's sake. However, after Denji saves Power and Meowy, they begin living together at Aki Hayakawa's home and develop a more amicable relationship. They often bicker and become annoyed with one another, as well as cause trouble for Aki as a pair. Power eventually develops strong affection for Denji, even going so far as to deny Makima's wishes and put her own life on the line to keep him safe. Power considers Denji to be her very first friend, and so values him highly. As is mentioned by Makima, Power became a sister figure to Denji, and the two often bicker like siblings.\nAki Hayakawa\nPower takes up residence at Aki's home after she joins Public Safety. Aki frequently winds up being annoyed by Power's rude and brash tendencies, and she seems to enjoy needling him. Despite this, she does grow to care for Aki as time goes on, and seems saddened after the events with the Gun Fiend. The two might be described as developing a similar relationship to a disgruntled elder brother and bratty little sister, with Power constantly causing trouble that Aki has to deal with.\nMakima\nPower has always had a deep fear of Makima, likely due to her prowess as the Control Devil. Even with Power's personality, Makima's unsettlingly calm commands cut through Power easily. Makima offers Power a chance to be her \"pet\" again if she hands over Chainsaw Man, immediately turning the worry in Power's eyes to excitement. But due to Makima's cold-hearted personality, Makima kills her without remorse.\nAbilities\nIn her original form as a Devil, Power claimed to be greatly feared to the point where other Devils would flee from her scent, though this is quite possibly just boasting. As a Devil, Power possesses all of the standard Devil abilities, such the ability to make contracts with humans for a price, restoring her health by consuming blood, take over a dead human body and their consciousness, becoming a Fiend, and reviving in Hell after being killed.\nRight now, Power has only one contract, being with Denji. In exchange for promising to find and befriend the reincarnated Blood Devil, Power gave Denji her blood. Denji used her blood to create a blood chainsaw and disturb Makima's regeneration.\nPhysical Abilities\nEnhanced Strength: Power is far stronger than the average human. She can wield a massive hammer made from her own blood, kill a bear with little effort and crush the Sea Cucumber Devil's body in one swing.\nEnhanced Speed: Power is a quick fighter, able to land an attack on Denji when she betrayed him while evading Denji's own swing. She was able to disappear from the Katana Man's sight as he gunned down the Devil Hunters before landing an uppercut that he couldn't block.\nDevil Powers\nBlood Manipulation: Power can freely manipulate the blood in her body to form weapons. She can also manipulate other people's blood through direct contact and is able to prevent them from bleeding out though she acknowledges that it is difficult. Power can also distort her target's regenerative abilities by mixing her own blood.\nBlood Hammer: Power can create an enormous hammer out of her own blood which she uses to crush her opponents. She can also make smaller handheld versions.\nBlood Knife: Power can create knives out of her blood to stab or slice her targets. She is also proficient in dual-wielding these.\nBlood Spear: Power can create a spear out of her own blood and uses it to stab at her target. By placing her blood in bottles and hiding them in the area as traps she can make spears suddenly appear from the environment to take her opponent off-guard.\nBlood Scythe: Power can create a scythe out of her blood which she uses to slice her targets.\nThousand Tera Blood Rain (サウザンドテラブラッドレイン, Sauzando Tera Buraddo Rein?): In her Full Devil form, Power can generate thousands of blood swords and spears from the blood surrounding herself, levitate and throw them to her enemies. She can use this technique several times. This technique is strong enough to halt Makima for a couple of seconds.\nBlood Transfer: Through a contract, Power can transfer her blood and life energy to someone, similar to Pochita's ability to assimilate Denji's body. It was enough to completely heal the critically damaged Chainsaw Man's body.\nBlood Empowerment: As a Fiend, Power is able to restore her health by consuming blood. Also as the Blood Devil, her regenerative powers are at a higher level than other Devils. When Power drinks too much blood or drinks blood from a stronger Devil then her, her power drastically increases. It is shown that she sprouts additional horns from her head after drinking too much blood. In this state, a single punch from Power has enough force to launch Denji into the ceiling. She can regenerate herself from small amounts of blood even after her death by consuming the blood of the stronger Devil. After the defeat of the Chainsaw Man at the hands of Makima, Pochita exploited this ability by letting the blood of her inside Denji's body consume itself. After drinking blood of the Chainsaw Man, Power revived as a Devil from the small amount of blood that Denji have consumed. Her speed, strength, durability and blood manipulation abilities have been increased dramatically. After her transformation, she is also able to resist Makima's domination powers.\nPower creating a hammer from her blood.Power using her abilities remotely to create spears.Power creating thousands of swords, blades and spears.Power's horns after consumption of blood.\nSkillset\nKnifemanship: Power demonstrates her skills on using knives during her fight against the Yakuza zombies, even telling Denji to admire her skills.\nActing Skills: Power is an amateur actress, capable of faking her death by lying on the ground in order to fool Quanxi.\nOther Abilities\nEnhanced Smell: Power has a keen sense of smell, recognizing the scent of blood from a distance, while Denji was oblivious, and following it in order to track down the Sea Cucumber Devil. She can memorize and recognize specific scents, being able to detect Aki's presence from his smell alone, despite him being behind a door.\nChapter Appearances\n\nPublic Safety Saga\nv • eIntro arc\n1. Dog & Chainsaw\nAbsent\n2. The Place Where Pochita Is\nAbsent\n3. Arrival in Tokyo\nAbsent\n4. Power\nDebut\nv • eBat Devil arc\n5. A Way to Touch Some Boobs\nAppears\n6. Service\nAppears\n7. Meowy's Whereabouts\nAppears\n8. Chainsaw vs. Bat\nAbsent\n9. Rescue\nAppears\n10. Kon\nAppears\n11. Compromise\nAppears\n12. Squeeze\nAppears\n13. Gun Devil\nAppears\nv • eEternity Devil arc\n14. French Kiss\nAppears\n15. Endless 8th Floor\nAppears\n16. The First Taste\nAppears\n17. Kill Denji\nAppears\n18. Chainsaw vs. Eternity\nAppears\n19. Nobel Prize\nAppears\n20. Drinking\nAppears\n21. Taste of a Kiss\nAppears\n22. Cola-Flavor Chupa Chups\nMentioned\nv • eKatana Man arc\n23. Gunfire\nAppears\n24. Curse\nAppears\n25. Ghost, Snake, Chainsaw\nAppears\n26. The Gun is Mightier\nAbsent\n27. From Kyoto\nAbsent\n28. Secrets & Lies\nAbsent\n29. Perfect Score\nAppears\n30. Bruised & Battered\nAppears\n31. The Future Rules\nAppears\n32. Over and Over Again\nAppears\n33. Mission Start\nAbsent\n34. Full Team\nAbsent\n35. Minor\nAbsent\n36. Katana vs. Chainsaw\nAppears\n37. Train, Head, Chainsaw\nAbsent\n38. Easy Revenge!\nAppears\nv • eBomb Girl arc\n39. Tearjerker\nAppears\n40. Love, Flower, Chainsaw\nAbsent\n41. Before the Storm\nFlashback\n42. Teach Me How to Swim\nAbsent\n43. Jane Fell Asleep in the Church\nPictured\n44. Boom Boom Boom\nMentioned\n45. A Fine Day for Explosions\nMentioned\n46. Massacre Melody\nAbsent\n47. Luck With Women\nFlashback\n48. Kaboom Kaboom Kaboom\nAbsent\n49. Shark Hurricane\nAbsent\n50. Sharknado\nAbsent\n51. Dark Diving\nAbsent\n52. Lost Love, Flower, Chainsaw\nAppears\nv • eInternational Assassins arc\n53. In a Dream\nAppears\n54. To Go to Enoshima\nAbsent\n55. Let's Go\nAppears\n56. A Curse and A Fist\nAppears\n57. Suddenly\nAppears\n58. Yutaro Kurose\nAbsent\n59. Mess\nAppears\n60. Quanxi and Fiends' 49-Person Massacre\nAppears\n61. News Reporter\nAppears\n62. Super Mess\nAppears\n63. Trip To Hell\nAppears\n64. Welcome To Hell\nAppears\n65. The Darkness Devil\nAppears\n66. Woof!\nAppears\n67. The First Devil Hunter\nMentioned\n68. Dark Power\nAbsent\n69. Shining Power\nAbsent\n70. Pinch\nAbsent\nv • eGun Devil arc\n71. Bath\nAppears\n72. All Together\nAppears\n73. Everyday Life No More\nAppears\n74. What the Waves Say\nMentioned\n75. 9,12\nAbsent\n76. Don't Open It\nAppears\n77. Ring Ring Ring\nAppears\n78. Snowball Fight\nAppears\n79. Play Catch\nAbsent\nv • eControl Devil arc\n80. A Dog's Feelings\nAppears\n81. Paw\nAppears\n82. Always Eat A Hearty Breakfast\nAppears\n83. Death, Resurrection, Chainsaw\nAppears\n84. Hero Of Hell\nAbsent\n85. Bloody Good Gut Feeling\nAbsent\n86. Date Chainsaw\nAbsent\n87. Chainsaw Man vs. the Horrifying Weapon Humans\nAbsent\n88. Star Chainsaw\nAbsent\n89. Go Get 'Em, Chainsaw Man\nAbsent\n90. Super Power\nAppears\n91. Power, Power, Power\nDeath\n92. Vanilla Sky\nAbsent\n93. You & Crappy Movies\nAbsent\n94. Chainsaw Man vs. the Weapon Humans\nAbsent\n95. Chainsaw Man vs. Control Devil\nAbsent\n96. This Kind of Taste\nMentioned\n97. I, Love, Chainsaw\nAbsent\nAcademy Saga\nv • eDating Denji arc\n112. Between Cat and Criminal\nAbsent\n113. I Wanna See Penguins!\nAbsent\n114. Endless Aquarium\nAbsent\n115. High Schoolers These Days\nAbsent\n116. Taste of Starfish\nMentioned\n117. Penguin and Weapon\nAbsent\n118. Saying Goodbye\nAbsent\n119. Thief\nAbsent\n120. Triangle\nAbsent\nv • eFalling Devil arc\n121. Theory of Happiness\nAbsent\n122. The Prophecies\nAbsent\n123. Hors D'oeuvre\nAbsent\n124. Soup\nAbsent\n125. Apple Thief\nAbsent\n126. Food Fight\nFlashback\n127. Save the Asa\nAbsent\n128. Main Dish\nAbsent\n129. Save Me, Chainsaw Man\nAbsent\n130. Kill Building\nAbsent\n131. Taste of Crap\nAbsent\nv • eAging Devil arc\n156. Whup Whup Whup Whup Bzzz Split Split\nAbsent\n157. College Fund\nAbsent\n158. Gyohnee Guillotine\nAbsent\n159. Attack on Samurai\nAbsent\n160. That for Which the Heart Beats\nAbsent\n161. Chainsaw Man Puzzle\nAbsent\n162. Fearsome\nAbsent\n163. Dream Balls\nAbsent\n164. Charred Remains\nAbsent\n165. Everyday Scenery\nAbsent\n166. Rain, Brothel, Removal\nAbsent\n167. Super Smooch\nAbsent\n168. Kiss, Love, Sperm\nAbsent\n169. Hands and Adaptation\nAbsent\n170. How to Eat Sushi\nAbsent\n171. Special Division 5\nAbsent\n172. Bzzz! Boom! Chomp!\nAbsent\n173. Hard of Hearing\nAbsent\n174. Ayyy, Aging\nAbsent\n175. Both Hands\nAbsent\n176. Two Children\nAbsent\n177. Trigger Finger\nAbsent\n178. Gun Goddess\nAbsent\n179. Vamvagah\nAbsent\n180. Aging's World\nAbsent\n181. Trees on the Mind\nAbsent\n182. Cute\nFlashback\n183. Barf, Head, Perv\nFlashback\n184. Run, Denji\nAbsent\n185. Stomach in Another World\nAbsent\n186. Yank, Blorsh, Bdroom\nAbsent\n187. Barf!\nAbsent\n188. Octopus, War, Chainsaw\nAbsent\n189. Heart Pass, Octopus\nAbsent\n190. To Their Respective Worlds\nAbsent\nv • eCurrent arc\n191. Cuz I'm a Devil\nAbsent\n192. How Devils Play\nMentioned\n193. Burning Kiss\nAbsent\n194. Fun School Festival\nAbsent\n195. Kill Me Tears\nAbsent\n196. Chainsaw Man to the Rescue!\nAbsent\n197. 3 Seconds\nAbsent\n198. It's Fami!\nAbsent\n199. Enjoy Your Food\nAbsent\n200. Toxic Couple\nAbsent\n201. Terror Looks Like This!\nAbsent\n202. Devil Combination\nAbsent\n203. Human Shield\nAbsent\n204. With One Life\nAbsent\n205. Who?\nAbsent\n206. Chest, Woman, Apology\nAbsent\n207. Budda Budda Budda Budda!\nAbsent\n208. Changed My Mind\nAbsent\n209. Terrifying Weapon\nAbsent\n210. Peace\nAbsent\n211. War, Panties, Chainsaw\nAbsent\n212. Really Good Girl\nAbsent\nAnime Appearances\nv • eSeason 1\n1. Dog & Chainsaw\nAbsent\n2. Arrival in Tokyo\nDebut\n3. Meowy's Whereabouts\nAppears\n4. Rescue\nAppears\n5. Gun Devil\nAppears\n6. Kill Denji\nAppears\n7. The Taste of a Kiss\nAppears\n8. Gunfire\nAppears\n9. From Kyoto\nMentioned\n10. Bruised & Battered\nAppears\n11. Mission Start\nAppears\n12. Katana vs. Chainsaw\nAppears\nTrivia\nPower's rankings in the Popularity Polls are as follows:\nPower ranked 1st in the First Popularity Poll with 35,268 votes.\nPower ranked 3rd in the Second Popularity Poll with 69,850 votes.\nPower's breast pads ranked 25th in the Second Popularity Poll with 2,330 votes.\nPower derives her power from blood phobia, also known as hemophobia or hematophobia, an extreme irrational fear of blood, but mostly due to the scary and disturbing connotations surrounding the gruesome sightings of blood spill and the fear of bleeding/blood loss.\nHer name originates from Powers, an angel from the middle order of Christian angelic hierarchy along with Dominions and Virtues.\nDominion and Virtue are also followers of Chainsaw Man along with, Angel Devil, Beam, Galgali, Princi and Seraphim.\nAnother term for the Powers classification of angels are Authorities.\nIn an interview for Jump Festa 2021, Fujimoto stated that Power's personality was inspired by Walter Sobchak from The Big Lebowski.\nIn another interview, conducted in Early 2020 for the French magazine ATOM, Fujimoto also states that Power's characterization was based on Eric Cartman, from the American TV animated sitcom South Park.\nOn one of Tatsuki Fujimoto's alternate Twitter accounts, he has dumped some concept art and what seems to be an early design for Power which may have served as inspiration for Akane Sawatari as she has light-colored hair (as both still have now), with snake eyes and seen with a snake or serpent-like creature wrapping around her.\nPower's 76.1 shirt is a reference to a Japanese radio station.\nPower took the original scrapped role of Himeno in terms of being Denji’s buddy.\nPower’s lower/second set of horns are shaped exactly like Nayuta’s from Yogen no Nayuta, a character responsible for inspiring Nayuta and the Four Horsemen. Power shares a feral personality, animal motif with cats and weapon summoning (also seen with the other horsemen Yoru) to the horned Nayuta and a domineering yet childish personality to Chainsaw Man’s Nayuta. She also shares similar mannerisms to both and a close relationship to the main character with Chainsaw Man’s Nayuta especially taking the role of replacing Power’s role as Denji’s best friend after her death.\nPower’s personality is based on Eric Cartman from South Park.\nReferences\n↑ Chainsaw Man Anime Exhibition - Character Height Chart\n↑ 2.0 2.1 Chainsaw Man Manga: Chapter 61, Page 13\n↑ 3.0 3.1 Chainsaw Man Manga: Chapter 4, Page 18\n↑ 4.0 4.1 Chainsaw Man Manga: Chapter 39, Page 1\n↑ Chainsaw Man Manga: Chapter 12, Page 3\n↑ 6.0 6.1 Chainsaw Man Manga: Chapter 56, Pages 18 - 19\n↑ Chainsaw Man Manga: Chapter 24, Page 15\n↑ Chainsaw Man Manga: Chapter 29, Pages 17 - 18\n↑ Chainsaw Man Manga: Chapter 36, Pages 6 - 9\n↑ Chainsaw Man Manga: Chapter 5, Pages 12 - 13\n↑ 11.0 11.1 Chainsaw Man Manga: Chapter 17, Page 11\n↑ Chainsaw Man Manga: Chapter 29, Page 3\n↑ Chainsaw Man Manga: Chapter 11, Page 15\n↑ Chainsaw Man Manga: Chapter 16, Page 3\n↑ Chainsaw Man Manga: Chapter 45, Page 11\n↑ Chainsaw Man Manga: Chapter 36, Page 2\n↑ Chainsaw Man Manga: Chapter 11, Page 14\n↑ Chainsaw Man Manga: Chapter 20, Pages 8 - 9\n↑ Chainsaw Man Manga: Chapter 71, Pages 3-16\n↑ Chainsaw Man Manga: Chapter 9, Pages 3 - 6\n↑ Chainsaw Man Manga: Chapter 7, Pages 5 - 7\n↑ Chainsaw Man Manga: Chapter 7, Page 2\n↑ Chainsaw Man Manga: Chapter 7, Pages 8 - 11\n↑ Chainsaw Man Manga: Chapter 5, Page 5\n↑ Chainsaw Man Manga: Chapter 91, Pages 14 - 16\n↑ Chainsaw Man Manga: Chapter 6, Pages 11 - 13\n↑ Chainsaw Man Manga: Chapter 23, Pages 14 - 15\n↑ 28.0 28.1 Chainsaw Man Manga: Chapter 5, Pages 6 - 9\n↑ Chainsaw Man Manga: Chapter 18, Page 6\n↑ Chainsaw Man Manga: Chapter 6, Pages 11 - 12\n↑ Chainsaw Man Manga: Chapter 15, Pages 3 - 4\n↑ 32.0 32.1 Chainsaw Man Manga: Chapter 36, Pages 5-8\n↑ Chainsaw Man Manga: Chapter 31, Pages 5 - 6\n↑ Chainsaw Man Manga: Chapter 59, Page 15\n↑ Chainsaw Man Manga: Chapter 30, Page 2\n↑ Chainsaw Man Manga: Chapter 38, Pages 24 - 25\n↑ Chainsaw Man Manga: Chapter 5, Pages 4 - 10\n↑ https://amao-itigo.hatenablog.com/entry/2020/12/19/205309\n↑ http://twitdoc.com/view.asp?id=532608&sid=BEYO&ext=PDF&lcl=Chainsaw-Man-ATOM-English.pdf&usr=The_real_Faick\nSite Navigation\nv • eDevils\nPrimal Fears\nDarkness Devil • Falling Devil • Aging Devil • Death Devil\nFour Horsemen\nControl Devil • War Devil • Famine Devil • Death Devil\nDevils\nAngel Devil • Bat Devil • Bitterness Devil • Bomb Devil • Blood Devil • Bow Devil • Carpenter Bee Devil • Centipede Devil • Cosmos Devil • Chainsaw Devil • Chicken Devil • Cockroach Devil • Claw Devil • Curse Devil • Doll Devil • Ear Devil • Eternity Devil • Fire Devil • Fish Devil • Flamethrower Devil • Fox Devil • Future Devil • Ghost Devil • Violence Devil • Grape Devil • Guillotine Devil • Gun Devil • Hell Devil • House Devil • Justice Devil • Katana Devil • Knife Devil • Leech Devil • Loneliness Devil • Longsword Devil • Mannequin Devil • Mantis Devil • Marshmallow Devil • Mold Devil • Mouth Devil • Muscle Devil • Nail Devil • Needle Devil • Nuclear Weapons Devil • Octopus Devil • Pig Devil • Punishment Devil • Sea Cucumber Devil • Shark Devil • Skin Devil • Snake Devil • Snow Devil • Spear Devil • STD Devil • Pillbug Devil • Spider Devil • Stone Devil • Tank Devil • Tomato Devil • Typhoon Devil • Whip Devil • Zombie Devil\nFiends\nGun Fiend • War Fiend • Shark Fiend • Cosmos Fiend • Violence Fiend • Long • Loneliness Fiend • Nail Fiend • Pillbug Fiend • Pingtsi • Blood Fiend • Tsugihagi\nHybrids\nChainsaw Hybrid • Flamethrower Hybrid • Katana Hybrid • Longsword Hybrid • Bow Hybrid • Bomb Hybrid • Spear Hybrid • Whip Hybrid\nUnknown\nSeraphim • Dominion • Virtue\nv • eDevil Hunters\nPublic Safety Devil Hunters\nAki Hayakawa † • Angel † • Aging Devil's Victim ‡ • Barem Bridge ‡ • Beam † • Denji ‡ • Division 2 Vice Captain † • Division 4 Female Member † • Division 4 Male Member † • Dominion • Ear Devil † • Fumiko Mifune • Furuno • Fushi † • Galgali † • Himeno † • Hirofumi Yoshida • Hirokazu Arai † • Katana Man ‡ • Kato † • Kishibe • Kobeni Higashiyama ‡ • Kusakabe † • Madoka ‡ • Makima † • Masaki Ando † • Michiko Tendo † • Miri Sugo ‡ • Minami Nakano ‡ • Nail Fiend ‡ • Nakamura † • Nomo † • Pillbug Fiend † • Power † • Princi † • Reze ‡ • Quanxi • Sato † • Seraphim • Spear Hybrid ‡ • Subaru † • Takagi † • Tamaoki † • Tanabe † • Tomono ‡ • Virtue • Whip Hybrid ‡ • Yutaro Kurose †\nCivilian Devil Hunters\nAkane Sawatari † • Aldo • Asa Mitaka ‡ • Cosmo † • Denji ‡ • Hirofumi Yoshida ‡ • Joey † • Katana Man ‡ • Kenzo • Long † • Mysterious Man † • Pingtsi † • Quanxi ‡ • Santa Claus ‡ • Tolka † • Tsugihagi † • Yoru ‡\nDevil Hunter Club\nAsa Mitaka ‡ • Fami ‡ • Furio † • Haruka Iseumi • Hirofumi Yoshida • Nobana Higashiyama • Seigi Akoku • Yoru ‡ • Yuko †"
}