{
  "requested_name": "Rias Gremory",
  "resolved_title": "Rias Gremory",
  "url": "https://highschooldxd.fandom.com/en/wiki/Rias_Gremory",
  "summary": "Rias Gremory (リアス・グレモリー, Riasu Guremorī) is the main female protagonist of High School DxD. ",
  "full_text": "Rias Gremory\nRias Gremory (リアス・グレモリー, Riasu Guremorī) is the main female protagonist of High School DxD. \nShe is the Gremory Clan's heiress after her oldest brother, Sirzechs, took the position of Lucifer. Rias is the sole daughter and youngest child of Zeoticus and Venelana Gremory, the aunt of Millicas Gremory, and the maternal cousin of Sairaorg and Magdaran Bael.\nShe became known as the Crimson-Haired Ruin Princess, because of the color of her hair and Power of Destruction. Now, Rias is a first-year College Student at Kuoh Academy, the former President of the Occult Research Club, and the school's Number-One Beauty, as well as one of Kuoh Academy's Two Great Ladies alongside Akeno Himejima. She is the master of Issei and one of his fiancées. \nAppearance\n \nRias is a beautiful young woman with a voluptuous body, white skin, blue eyes (blue-green in the anime, season 1-3) inherited from her father, Zeoticus, and a buxom figure. Her body measurements are . Her body weight is . \nHer most distinctive feature is her long, beautiful crimson hair, which she also inherited from her father, that reaches down to her thighs with a single hair strand (known in Japan as ahoge) sticking out from the top. Her hair also has loose bangs covering her forehead and side bangs framing her face. Rias' height is 172 cm. (5 feet 8 inches), making her one of the tallest female characters of the series.\nAlthough Rias has worn various types of clothing throughout the series, her most commonly worn outfit is the Kuoh Academy girls' school uniform, which consists of a white long-sleeved, button-down shirt (short sleeves for spring/summer), with a black ribbon on her shirt collar worn under a black shoulder cape and a matching button-down corset, a magenta skirt with white accents, and brown dress shoes over white crew-length socks. Rias also tends to wear seductive lingerie and thongs, especially when she has a desire to sleep with Issei.\nOn some rare occasions, Rias wears glasses when she's deep in thought, as she feels they make her mind work better despite having perfect eyesight. \nPersonality\nAs a Devil from the House of Gremory, Rias is very kind and compassionate, especially to her servants and people close to her. She gets angry and violent whenever people insult her or her peerage, showing a fiery side to her. This also plays into the fact that she dislikes cruelty towards people, as shown with her disgust over Marius Tepes, who abused his own sister for his own benefit, and how she killed the Fallen Angels, such as Mittelt, Dohnaseek, Kalawarna, and Raynare for their cruel treatment of Issei. Rias also holds great sympathy towards Sairaorg and his mother Misla Bael for how badly they were treated by the Bael clan.\nRias is proud of her family's name, but she does not like being seen as Rias of the Gremory Family. The reason for her living in the human world (as revealed in Volume 2 of the novels) is because there, everyone sees her as Rias, not as a Devil or as the Crimson-Haired Ruin Princess. Due to this and the fact that the only men who showed interest in her were interested in her due to being the Heiress of the House of Gremory, Rias soured on the idea of finding a lover, until meeting and falling in love with Issei. \nShe thinks of Issei as a special person and always gets jealous when girls are around him, becoming a totally different person when she sees him and other girls together, or when it comes to training. Despite her mature stature like a woman, Rias tends to act her true age and becomes frustrated whenever girls flirt with Issei. While Rias is usually calm and mature in most situations, she loses her mature aura and presence when she sees any girl (especially Akeno) flirting with or seducing Issei.\nShe enjoys teasing Issei and Asia (from Volume 3 of the novels onward), but at the same time makes it clear (to Asia or any girl) that Issei is hers, and she does not want to share him at all. The Gremory Family and their servants are beings with extraordinary affection among the Devils, and Rias is no exception. She has no problem with showing Issei her breasts or sleeping naked with him (which she always does according to her and claims she can't sleep without being nude or without Issei). Despite being seductive like Akeno, both of the girls are still innocent to love, as both of them become their age whenever around Issei or on a date with him.\nAfter becoming Issei's girlfriend, Rias begins to show more confidence in her relationship with Issei, and she is no longer jealous or angry when Issei is with other girls like she previously was, even accepting Issei's dream of having a harem and letting the girls have dates with him. However, Rias still shows some signs of jealousy such as when Issei doesn't spend enough time with her, but she still believes in him and loves him. Due to being Issei's official girlfriend and later fiancée, the other girls acknowledge her as the \"Legal Wife\" as she manages the other women who are in love with Issei. According to Ravel, the burden of Rias as the \"Legal Wife\" is greater than the burden of Issei as she has to manage the girls' maidenly feelings towards Issei and balance out Issei's feelings towards each of his lovers/brides. Like Akeno, Rias shows a sign of dependence toward Issei (possibly lesser than the former) as Rias will lose her will to fight and lead for some time if Issei is severely injured or she believes that he is dead. She also developed an instinct when Issei is with an unknown woman or when other girls tried to seduce him before her, as she immediately rushed to him.\nRias holds her older brother, Sirzechs, in high regard (despite her older brother's antics of being a siscon) because she deeply cares for him. When Rias was a child, she was entirely dependent on him and held him in admiration, while also feeling inferior to him at the same time.\nRias loves participating in Rating Games, as she dreams of becoming the Rating Game champion by defeating the current Rating Game champion; Diehauser Belial, with the help of her peerage. While Rias is a powerful devil in her own right, being much stronger than average High-class Devils and according to Azazel, being able to become a Ultimate-class Devil just on the virtue on her talent alone, Rias suffers a bit of an inferiority complex when she compares herself to her fellow Rookies Four colleagues, as she feels inferior to Sona as a strategist and that she is far weaker in power than Sairaorg. However, according to Riser and Azazel, Rias has a talent for finding and recruiting talented individuals for her peerage, inspiring great loyalty and growing stronger with them as seen in her meeting with Issei. During the Azazel Cup, she was highly evaluated as a scout as she managed to recruit Crom Cruach and Vasco Strada, along with two Longinus possessors, being praised by the professional critics. She is noted to be a skilled negotiator, as she was able to convince Rossweisse to join her peerage by offering her better working conditions and a better salary compared to her previous job in Valhalla, and while during the Azazel Cup, she was able to convince Vasco Strada to join her team after he declined all prior invitations to participate in the Cup by appealing to his warrior swordsman spirit and offering to restore his youth without using a Devils ability, thus not violating his faith, with Strada praising her negotiating skill as a sweet Devil's whisper.\nRias is competitive and hates to lose, especially after losing her first Rating Game against Riser as she strives to always win, whether it is in sports or Rating Games.\nDue to being spoiled by her father Zeoticus and her brother Sirzechs from an early age, she has a somewhat impatient and selfish personality. Being a spendthrift, Rias enjoyed shopping as a hobby and because of her bad money spending habit, her mother Venelana and her sister-in-law Grayfia often scold her for her frivolous spending, as her mother reconsidered the amount of money she is allowed as allowance.\nEarly in her childhood, she developed an instinctive fear and hatred of camels due to being hit by a camel after making fun of it, as the fear is great enough that the residents of the Gremory territory constantly keep camels away from her despite the Gremory's association with camels in the Ars Goetia.\nDue to being taught about Japan from Souji Okita, Rias is a complete Japanophile who is obsessed with Japan's culture and history, buying various Japanese souvenirs and being ecstatic while visiting Kyoto during her school field trip, though she became pouty and stomped at the train station due to being unable to fully explore Kyoto. She also founded a Japanology club after graduating from high school.\nHistory\nRias is the daughter and second child of the Gremory Family. She became the heir after her brother, Sirzechs, became the Satan Lucifer, losing his right as heir to the house. After being announced as the heiress of the Gremory Clan, Rias was eventually placed into engagement with Riser Phenex. When she was a child, she was attacked by a camel for making fun of it, which caused her to have a strong fear of camels ever since. Just seeing imagery of a camel is enough to trigger her fear, as shown when she gets frightened seeing her clan's mascot, which is a camel.\nPrior to the series, Rias has reincarnated Akeno Himejima, Koneko Toujou, Yuuto Kiba, and Gasper Vladi as members of her peerage. Rias met Akeno, her Queen, first servant, and best friend, in Japan, saving Akeno from being killed by her fellow Himejima Clan members after Akeno accidentally entered Heinrich Cornelius Agrippa's territory. She then met Koneko, her second servant, after her brother rescued Koneko from being executed, leaving Koneko under Rias' care. She later reincarnated both Yuuto and Gasper, the former who died after being a part of the \"Holy Sword Project\" and the latter killed by Vampire hunters.\nShe entered Kuoh Academy two years before the series along with Akeno, Sona, and Tsubaki, reviving the abolished Occult Research Club which is used as a base for her servants and became its president. Rias and Akeno went on the Kyoto trip during their second year, and Rias enjoyed every moment of it, however, they didn't plan a proper schedule so therefore there were places that she wasn't able to visit like the Nijou-jou. Rias was so upset that she stomped her feet at the railway station. Also during their second year, Rias and her club organized a haunted house for the school festival and even used real ghosts as she requested a friendly Youkai to look for jobs to plan the decorations. This, however, got them in a lot of trouble with Sona who scolded them for using the real thing.\nPowers & Abilities\nGreat Demonic Power: Like Sirzechs, Rias inherited exceptional demonic power from her parents and has great talent and skill in using it, even by the standards of a High-Class Devil. After Issei transferred power to her, her demonic power increased to where it rivaled an Ultimate-Class Devil, shaking the ground, and being able to mildly injure the Cadre Kokabiel. Azazel noted that even without training, Rias has the potential to become one of the highest class devils using natural talent. Rias has further improved her demonic power through dedicated training and eventually became an Ultimate Class Devil. She was capable of overpowering Ultimate-Class Devils wounded by Crom Cruach, and while in her Balor Princess Form could keep up with Fenrir at 80% percent power.\n \nPower of Destruction (滅びの力, Horobi no Chikara): A unique demonic power, which allows her to erase seemingly anything, such as matter, energy and even immaterial things such as souls. She would originally often release massive blasts to engulf and erase her targets, but Rias has improved her control over her Power of Destruction to the point of being able to compress it into softball-sized bullets and release them in quantities Kiba compared to a machine gun, which he noted that those without enough power would vanish from one of them.\nExtinguished Star (消滅の魔星, Ikusutinguisshu Sutā): Rias' Ultimate One-Hit Kill Technique, developed from both her own training and the influence of draining Issei's dragon power on her demonic power. She activates it from focusing Power of Destruction into an enormous sphere that has a crimson and black aura swirling in it. Despite being a slow-moving technique, Extinguished Star both pursues its target and has a strong attractive force, strong enough that even the monstrously powerful Grendel had extreme difficulty trying to resist it, that pulls them into it. Its destructive power has been said to surpass the Rating Game's retiring system. Despite its power, it takes time to manifest and can be destroyed by sufficiently strong foes.\nCastling: Due to being the King of her own peerage, Rias has the ability to use Castling, which allows her to swap locations with one of her Rooks. She first used it during Nilrem's attack on Kuoh Academy, swapping places with one of her unused Rook pieces.\nHealing: Rias is capable of healing others using her demonic power, and skilled enough that she can continue the process while asleep. It requires her embracing the injured person and both parties to be completely nude in skin to skin contact for better effectiveness, although it takes the better part of a night to take full effect. She has shown to be able to heal fatal wounds such as when Issei was struck by a Light Weapon.\nOppai Beam (おっぱいビーム, Oppai Bīmu): Rias has gained the ability to project a red light from her breasts, which recharges Issei's energy. Each use of this power causes her breasts to temporarily shrink in size, however, her breast size will restore itself after a few days of rest.\nTransformation: In True Volume 3, she can use her demonic power to change the color of her hair from crimson to blonde.\nExpert Magician: Rias is adept in Devil Magic, using it for a variety of purposes enhanced by her demonic power, being one of the magic specialists of her peerage alongside Akeno. \nDefensive Magic: Rias can create several barriers to protect herself and her servant, such as from Katerea's self-destruction spell during the Three Factions Conference.\nMemory Manipulation: Rias has shown that she has skill in memory alteration, using it on Issei's parents.\nSummoning Magic: Rias is capable of summoning her bat-like familiar.\nEnhanced Durability: Rias has shown great tolerance to damage and pain, as she was going continuing to fight Regulus and remain in the Rating Game, though she was nearly defeated due to blood loss.\nKeen Intellect: Rias is a very intelligent and knowledgeable woman, due to being naturally gifted as well as her aristocratic education as the heiress of the Gremory Clan since childhood. When running the Occult Research Club, she is shown to be knowledgeable on occult topics such as supernatural beings like Youkais, Devils, Angels and Fallen Angels. \nExpert Tactician: Though outsmarted several times throughout the series, Rias has proven herself to be an excellent tactician and has saved her team along with others many times due to her profound intellect and her ability to handle unexpected difficulties calmly. Indra also acknowledged Rias as a capable leader and strategist even without Issei's support.\nMaster Negotiator: Rias is shown to be very talented in negotiations as she could convince Rossweisse to join her peerage by offering her better working conditions and a better salary compared to her previous job in Valhalla, and while during the Azazel Cup, she was able to convince Vasco Strada to join her team after he declined all prior invitations to participate in the Cup by appealing to his warrior spirit and offering to restore his youth without using Devil's demonic power. She also managed to recruit Crom Cruach for her team in the Azazel Cup by using his love for fighting strong opponents and his favorite food as payment.\nOther Skills: As a High-Class Devil, more so the Gremory Heiress, Rias learned a wide arrange of different skills. In the Human World, she learned things no other pure-blood would ranging from housework to gardening, both of which became hobbies. \nHuntress: Rias can hunt and prepare wild animals, such as boar, for consumption.\nFisherwoman: Rias has some skill in fishing, being able to catch and prepare fish for dinner.\nMaster Chef: Rias is a great chef with a wide range of cooking skills and can cook food of the finest quality. According to Issei, Rias is good at cooking Japanese food, Western food, and Chinese food. He considered Rias to be one of the Four Heavenly Kings of the Kitchen in the Hyoudou Residence alongside Akeno, Asia and Miki.\nMaster Dancer: As a Devil noble, Rias is highly skilled in social dancing. During her and Issei's dancing trial in the ruins of connection, she could dance beautifully with Issei, even leading him in the parts he is inexperienced in to pass the trial.\nMaster Designer: Rias is a brilliant interior designer, having designed the chic interior of Cafe CxC along with very elegant furniture.\nStealth Expert: Rias has learned how to mask her presence to allow her to remain undetected, as a way to sneak behind and surprise Issei without being noticed.\nFlight: Being a Devil, Rias can fly using her wings.\nEquipment\nCrimson Extinct Dragonar (深紅の滅殺龍姫, Kurimuzon Ekusutinkuto Doragunā): Also known as Crimson Dragon Princess of Annihilation. A combination technique between Rias and Issei, where he uses his Red Wyverns and they sync both of their auras and the Wyverns attach themselves to Rias to create her own female version of Issei’s Scale Mail. The armor acts just like Issei's, boosting Rias' abilities and giving her the ability to utilize Boost, Transfer, and Penetrate until she reaches her limit.\nForbidden Invade Balor the Princess (禁夜と真闇の滅殺獣姫, Fōbidun Invueido Barōru za Purinsesu): Also known as Beast Ruin Princess of the Forbidden Night and True Darkness. A combination technique between Rias and Gasper, where he melts into his shadow and fuses with hers covering her in darkness. This resulted in a form of Rias, which appears as a dark beast in the shape of a human enveloped in a deep red aura of destruction and also a third eye with a deep red pupil and ten wings. This was inspired from Sairaorg's Balance Breaker supplemented by her Crimson Extinct Dragonar. Rias is able to use her third eye to freeze opponents in time and travel through shadows; her own Power of Destruction is also greatly enhanced with the infusion of power of darkness, as well as being able to stop her own attacks and control them such as changing their trajectory. This form, while still incomplete, exceeds Satan-class power, and is able to casually destroy an area with a radius of a few hundred meters filled with skyscrapers.\nGalatine II (ガラチン II, Garachin II): A crimson sword able to be used by a devil, which Rias had received from Heaven as a blessing after her engagement to Issei. She plans to pass it on to their future children.\nQuotes\nLight Novel\n(To Issei upon death) \"So you were the one who called me.\" (Volume 1, Life 0)\n(Introducing herself to Issei) \"My name is Rias Gremory. I am a Devil. And I am your Master. Nice to meet you, Hyoudou Issei-kun. Can I call you Ise?\" (Volume 1, Life 1)\n\"There's one last thing you should never forget, Ise. Even a can take down the . This is basic in chess. This truth also applies to the Devils' chess pieces. You can become stronger.\" (Volume 1, Life 4)\n\"If you can get stronger and feel comfort by touching my breast, then I don’t mind being a Switch-Princess. The Switch-Princess that only belongs to you. If I can become the source of your power, then that will fulfill my wish. –My adorable Ise.\" (Volume 7, Life-3)\n\"You finally called me by my name……… I have waited for this the whole time. I really did…… But I didn’t have the courage to tell you…… So I thought that it would never happen……… But when I heard your feelings that time……… I was so happy……… I was so happy that I was about to cry during the match………\" (Volume 10, New Life)\n\"A world without him! I don't care about the World without Ise! ……To me, he was….. that person was….. He was more important than anyone else. For me to live without him……\" (Volume 12, Life -3)\n\"Now my adorable servants! Let's blow away the enemy before us as the Gremory group!\" (Volume 12, Life -2)\n\"Magical Girl Ria! I’m going to annihilate the heinous villains all at once with my twinkling magic☆\" (Volume 15, Life-1)\nManga\n(To Issei) \"Geez... You're an honest kid with perverted thoughts too. Ufufu~♥\" (Manga, Chapter 22)\nAnime\n\"Insulting my servants warrants death!\" (Season 2 New)\nTrivia\nRias' birthday is April 9th, according to official material.\nRias' name is derived from the Pokémon Garchomp (ガブリアス, Gaburias). \nRias' nickname Crimson-Haired Ruin Princess was taken from her mother's nickname Flaxen-haired Ruin Princess.\nThe reason why Rias has large breasts even at a young age is because it is a hereditary trait as her mother Venelana, grandmother Chysis and her ancestor Runeas also have large breasts.\nRias was decided not to have large breasts originally, as Ishibumi said he intended Rias' sizes to be only a bit larger than the common girls in Japan would have. However, he inspected Miyama's illustration of her with big breasts, he fell in love with it, and decided to give her large breasts.\nAccording to a questionnaire:\nHer favorite type of man is one who would follow her to the bottom of hell.\nHer erogenous zone is located on her neck.\nHer favorite body part of hers is her crimson hair, because it's the pride of her family.\nHer lucky panty color is red, but she'll wear any color if it makes Issei happy.\nWhen bathing, she starts washing from her left arm, and when bathing with Issei, she'll always wash his back.\nShe thinks herself as someone who tries to be strict but has a soft spot.\nOne reason she's kind to her servants is because she finds them all cute.\nHer specialty is Japanese cuisine due to studying it ever since she came to Japan.\nShe has trouble dealing with Grayfia because she's very strict with her monitoring.\nHer favorite music is folk and classical.\nShe hates humidity because it makes it hard to take care of her hair.\nShe'll invite Akeno and Sona to go shopping to get rid of her depression.\nHer first kiss was with Issei.\nShe has the habit to suddenly caress the cheek of cute people.\nHer first love is Issei.\nShe's proud of Sirzechs and Grayfia but feels inferior to them.\nShe spends her holidays relaxing at home while drinking tea and reading.\nHer ambition for the future is to win every title in the Rating Game.\nIf she were to become a Satan, she would liberalize love, because she believes people need to marry the one they love.\nHer favorite things are the old school building and being in the clubroom with Issei.\nRias stated that she intends to model the son-in-law of her house herself and rear him according to her ideals.\nIn Rating Game fighting-types, Rias is considered a Wizard-type who is closer to a Power-type.\nRias was one of the young Devil heirs and Kings chosen to compete in the Youth Devil Rating Game Tournament.\nShe came in first place after defeating Sairaorg Bael in the Rating Game finals match for first place.\nRias could play the piano when she was a child but it is unknown if she still can.\nRias' job requests as a Devil are usually to defeat monsters targeting her clients or de-cursing items.\nRias makes review videos of her “Switch Princess goods” and uploads them to DeviTube, with the accessories she wears in them secretly becoming popular as a compelling fashion choice.\nRias is the first female character to be placed into an engagement, the second being Kiyome, and third being Rossweisse.\nRias' hobbies are reading, shopping, gardening, cooking, making handcraft and maquettes, and playing video games.\nShe also a hobby of tea parties.\nRias is said to be exceptional at interior design.\nRias has a driving license and owns multiple cars such as a red saloon and a red convertible being two of them.\nIn one of the short stories, it is revealed that Rias is a big \"Japanophile\", having a huge collection of objects and artifacts back in her room in the Underworld.\nIt is also the reason as to why she came to visit Japan in the first place.\nRias mentioned that she wants a Japanese style wedding when she gets married and wants it in the Human world; possibly due to her being a Japanophile.\nRias wants to have her wedding take place in Kyoto.\nThe reason for this is because Ishibumi decided she must have a foreign name from the beginning.\nShe is the first to become Issei's girlfriend, as well as becoming the first to become engaged to him.\nRias has stated wanted to have one daughter with Issei but she strongly predicted that their first child will be a boy.\nRias is the character that killed the most named characters in the series for a total of five characters (Raynare, Dohnaseek, Kalawarna, Mittelt, and Viser).\nRias has a fear of camels, because she got hurt by wild camels after she sneaked out to go to the farm when she was still young.\nIn one of her original early concepts, Rias' design bore a striking resemblance to Tamaki Kousaka from To Heart 2.\nThe Crimson Extinct Dragonar was inspired by the Extremis Iron Man Armor.\nIn the finale of High School DxD BorN, Rias used an armor variant, presumably similar to Crimson Extinct Dragonar, after being manipulated by Issei's evil double.\nOriginally, Rias wasn't even planned to be in the series.\nIshibumi describes Rias as being the King, the mother, and the big sister of her peerage all at once.\nIn the \"DxD\" popularity election, she came in first in the all-character category, first in the heroine category, first in the coupling category with Issei, and fifth with Akeno.\nReferences\n↑ Ishibumi's Blog\n↑ Light Novel Volume 3, Life 2\n↑ Light Novel Volume 3, New Knight and New Rival\n↑ Light Novel Volume 5, Life.2 The gathering of the Young Devils!\n↑ Light Novel Volume 23, Life.2 Dragon Attracts Dragon, Part 3\n↑ Light Novel Volume 24, Life.4 The Limits of Humanity and Ultimate Evil Dragon\n↑ Ishibumi's Twitter\n↑ Dragon Magazine July 2010 issue\n↑ Light Novel Volume 4, Life.2 Class visit Begins\n↑ 10.0 10.1 Light Novel DX.1, Life.2 Ultimateǃǃ Onii-chan Mask\n↑ Light Novel Volume 13, Extra Life\n↑ Gremory of the DeviTube\n↑ Fischer Random\n↑ Dragon Magazine July 2010 issue\n↑ Dragon Magazine May 2019\n↑ Light Novel DX.3, Extra Life.2 Graduation Trip and Vortex Bunch\n↑ Light Novel Volume 4, Life.2 Class visit Begins\n↑ Light Novel Volume 24, Life.1 Bursting into Summer!\n↑ Light Novel Volume 22, Life.3 Gremory’s Graduation Ceremony\n↑ Light Novel DX.4, Line.2 The Student Council's Secret\n↑ Let's Go with Training! ~Mascot Chapter~\n↑ Dragon Magazine May Issue 2021\nNavigation\nv • eHigh School DxD\nTeam D×D\nIssei Hyoudou's Peerage\nIssei Hyoudou • Ingvild Leviathan • Asia Argento • Xenovia Quarta • Ravel Phenex • Rossweisse • Bennia Orcus\nRias Gremory's Peerage\nRias Gremory • Akeno Himejima • Issei Hyoudou • Yuuto Kiba • Koneko Toujou • Gasper Vladi • Loup Garou\nSona Sitri's Peerage\nSona Sitri • Tsubaki Shinra • Genshirou Saji • Tsubasa Yura • Tomoe Meguri • Momo Hanakai • Reya Kusaka\nXenovia Quarta's Peerage\nXenovia Quarta • Ruruko Nimura\nVali Team\nVali Lucifer • Bikou • Kuroka • Fenrir • Arthur Pendragon • Le Fay Pendragon • Gogmagog\nSairaorg Bael's Peerage\nSairaorg Bael • Kuisha Abaddon • Coriana Andrealphus • Misteeta Sabnock • Liban Crocell • Beluga Furcas • Gandoma Balam • Ladora Buné • Regulus\nHero Faction\nCao Cao • Georg • Jeanne • Heracles • Connla • Perseus • Marsilio\nSlash/Dog Team\nTobio Ikuse • Lavinia Reni • Natsume Minagawa • Kouki Samejima • Shigune Nanadaru\nBrave Saints\nDulio Gesualdo • Griselda Quarta • Irina Shidou\nSeekvaira Agares' Peerage\nSeekvaira Agares • Alivian • Bafeel Furcas\nJourney to the West Team\nSun Wukong • Zhu Bajie • Sha Wujing\nDragons\nDdraig • Albion • Fafnir • Vritra • Yu-Long\nDevils\nFour Great Satans\nSirzechs Lucifer • Serafall Leviathan • Ajuka Beelzebub • Falbium Asmodeus\n72 Pillars\nRiser Phenex • Lord Phenex • Zeoticus Gremory • Sairaorg Bael • Magdaran Bael • Misla Bael • Seekvaira Agares • Misteeta Sabnock • Coriana Andrealphus • Liban Crocell • Lady Phenex • Diodora Astaroth • Venelana Gremory • Zephyrdor Glasya-Labolas • Diehauser Belial • Ladora Buné • Millicas Gremory • Beluga Furcas • Gandoma Balam • Ruval Phenex • Zekram Bael • Naud Gamigin • Lilitifa Vepar • Gragg Forneus • Eneely Vassago • Iolava Amon • Cleria Belial • Sectaas Barbatos • Veves Furfur • Bafeel Furcas • Latia Astaroth • Iryuka Glasya-Labolas • Avi Amon\nExtra Demons\nGrayfia Lucifuge • Euclid Lucifuge • Kuisha Abaddon• Bedeze Abaddon • Mephisto Pheles • Roygun Belphegor\nReincarnated Devils\nEnku • Viser • Regulus • Tannin • Souji Okita • Surtr Second • MacGregor Mathers • Beowulf • Isabela • Ile and Nel • Karlamine • Mira • Siris • Xuelan • Yubelluna • Bülent • Marion • Rudiger Rosenkreutz\nSatan Clans\nLucifer • Lilith • Beelzebub • Leviathan • Asmodeus • Rizevim Livan Lucifer • Bidleid Bashalun Beelzebub • Tsufaame Tereaku Leviathan • Damaidosu Zereikel Asmodeus • Razevan Lucifer • Vali Lucifer • Ingvild Leviathan • Shalba Beelzebub • Katerea Leviathan • Creuserey Asmodeus\nNew Devils\nBalberith • Verrine • Gressil • Sonneillon\nOther Devils\nLirenkus\nFallen Angels\nGrigori\nAzazel • Shemhazai • Baraqiel • Kokabiel • Armaros • Sahariel • Tamiel • Benemune\nRaynare's Group\nRaynare • Dohnaseek • Kalawarna • Mittelt\nAngels\nFour Great Seraphs\nMichael • Gabriel • Uriel • Raphael\nTen Seraphs\nMetatron\nBrave Saints\nDulio Gesualdo • Griselda Quarta • Irina Shidou • Diethelm Waldseemüller • Kiyotora Shinra • Nero Raimondi • Mirana Shatarova • Ryuu Heikan • Jessica Lagerkvist • Caesar Villiers • Lint Sellzen\nGods and Buddhas\nChristianity God\nGod of the Bible\nNorse Gods\nOdin • Vidar • Loki • Thor • Freyr • Hel • Baldur • Gna • Fulla • Hlin\nGreek Gods\nZeus • Poseidon • Hades • Apollon • Artemis • Erebus • Nyx • Tartarus • Chronos • Hypnos • Oneiros • Eros\nHindu Gods\nIndra • Shiva • Brahma • Vishnu • Prahlada • Virochana • Mahabali • Varuna • Ganesha • Hanuman\nCeltic Gods\nBalor • Lugh\nPersian Gods\nAngra Mainyu • Aka Manah\nE×E Gods\nChimune Chipaoti • Regalzeva\nDragons\nTrue Dragon\nGreat Red\nDragon God\nOphis • Lilith \nTwo Heavenly Dragons\nDdraig • Albion\nFive Great Dragon Kings\nYu-Long • Tiamat • Vritra • Midgardsormr • Fafnir\nEvil Dragons\nGrendel • Crom Cruach • Aži Dahāka • Ladon • Yamata no Orochi • Apophis • Niðhöggr • Anselmus • Cyril • Gregorios • Simeon • Aži Dahāka II • Fake Ddraig • Fake Albion\nOther Dragons\nRassei • Samael • Issei Hyoudou • Tannin • Bova Tannin • Blizzard Dragon • Sprite Dragon • Earth Dragon • Spectre Dragons\nHumans\nKuoh Academy Students\nZekka Miyamoto • Lilebette D'Artagnan Lunaire • Aika Kiryuu • Yukihiko Hoderi • Kiyome Abe • Matsuda • Motohama • Murayama • Katase • Hase • Tadami Kamo • Tadami Kamo • Kyuji Enno • Mai Kazamatsuri • Ryuuji Tsuchida • Mai Kazamatsuri • Masato Mizuhashi\nFive Principal Clans\nSuzaku Himejima • Shuri Himejima • Suou Himejima • Akeno Himejima • Tobio Ikuse • Ouryuu Nakiri • Nakagami Nakiri • Momiji Nakiri • Genbu Doumon • Seiryuu Kushihashi\nCross Times Kiss\nMitsuya Kanzaki • Shizuka Kirino\nMagicians\nShooting Star • Meredith Ordinton • Mil-tan • Elaine Westcott • Walburga\nExorcists\nVasco Strada • Ewald Cristaldi • Touji Shidou • Masaomi Yaegaki • Teodoro Legrenzi • Siegfried\nOther Humans\nGorou Hyoudou • Miki Hyoudou • Uther Pendragon • Magnus Rose • Leonardo • Belzard • Elsha • Valper Galilei • Freed Sellzen\nOther Characters\nYoukais\nYasaka • Kunou • Nurarihyon • Magari • Sha Wujing • Zhu Bajie • Fujimai • Salamander Tomita\nVampires\nElmenhilde Karnstein • Valerie Tepes • Marius Tepes • Lord Vladi • Millarca Vordenburg\nGrim Reapers\nPluto • Bennia • Orcus • Pluto II • Thanatos • Zeno\nValkyries\nGöndul • Rossweisse • Brynhildr • Schwertleite • Helmwige • Ortlinde • Grimgerde • Schwertleite\nEvies\nRugatimu • Haz Ilyus • Bebevu Su • Gvardora\nOther Species\nRyuuteimaru • 666 (Trihexa) • Typhon • Surtr"
}