{
  "requested_name": "Shinobu Kocho",
  "resolved_title": "Shinobu Kocho",
  "url": "https://kimetsu-no-yaiba.fandom.com/en/wiki/Shinobu_Kocho",
  "summary": "“",
  "full_text": "Shinobu Kocho\n“\nI once believed that the road of happiness continued forever and ever into the distance. When it was destroyed, I realized for the first time that happiness lies atop a thin sheet of glass. And just as we were saved, there are those whose happiness hasn't yet been destroyed. So I wanted to get stronger and protect them.\n”\n \n— Shinobu Kocho to herself in Wrath\nShinobu Kocho (胡蝶 しのぶ, Kochō Shinobu?) is a major supporting character of Demon Slayer: Kimetsu no Yaiba. She is a Demon Slayer of the Demon Slayer Corps and the Insect Hashira (蟲柱, Mushi Bashira?) of the Taisho era.\nShinobu is also the younger sister of the former Flower Hashira Kanae Kocho and adoptive older sister of Kanao Tsuyuri.\nAppearance\nShinobu is a petite, young woman with a slender build and a fairly pale complexion. She has large eyes that lack pupils, only a haze of gradient purple, making her eyes appear similar to those of insects, and rose pink lips. She has raven-black wavy hair that fades into a dark purple hue at the ends, styled at the back of her head into a flat yakai-maki bun fastened with a white, turquoise and light purple butterfly ornament. She has center-split, ear-length, voluminous curtain bangs that flow down to frame the sides of her face, with two slightly thinner chin-length locks of hair in front of her ears below them. By the time of Hashira Training, both her bangs and locks are visibly more refined and lightly longer. She stands out among the more physically imposing Hashira due to her diminutive stature and small frame, which is later reinforced by her mentioning that she does not possess enough physical strength to decapitate a demon as the others do. According to Zenitsu, Shinobu is so cute that she could make a living on her looks alone.\nShinobu wears a dark purple-tinted variation of the standard Demon Slayer uniform. It consists of a button-up jacket with a stand-up collar and long sleeves, featuring gold buttons and a shirt pocket on the left breast, with the kanji for Destroy (滅, Metsu?) engraved on the back of the collar. Beneath the jacket, she wears a white long-sleeved collared undershirt. Her long, saggy tattsuke-hakama pants are also tinted dark purple and are fastened at the waist with a white belt. Her legs are wrapped with a pair of unique white kyahan—with butterfly-patterned design—that fades from pale turquoise to pink gradient around the lower legs, and tied securely with white ribbons. Her tabi socks match the dark purple color of her uniform. Over her uniform, she wears a distinctive white haori that once belonged to her late older sister, Kanae Kocho. The haori features a butterfly wing pattern inspired by the Monarch Butterfly, with a color gradient that fades from white into pale turquoise and then pink on the sleeves and hem, that are cuffed with a black trim, with white-pale turquoise dots, resembling butterfly wing edges. For footwear, Shinobu wears white zōri sandals with purple straps, and she conceals a hidden blade in the right sandal—used as a last resort weapon.\nWhen Shinobu was fourteen, her appearance was altered slightly. Her chin-length strands of hair in front of her ears were tucked in and she had a different Demon Slayer uniform consisting of silver buttons and cloth a darker shade of purple. She also sported a plain white haori over it.\nGallery\nShinobu as a child.Shinobu when she was 14.\nPersonality\n \nShinobu displays a bright, friendly and cheerful demeanor, always having an easygoing smile on her face regardless of the situation she is in. However, her outward behavior is shown very quickly to be a façade. This is displayed in the way she enjoys teasing others, to the point of being rather sardonic about it, enjoying most notably to pick on Giyu Tomioka. Despite her relaxed exterior and her initial claim of wanting to get along with demons, she can be rather cruel towards them, which is seen when she kills Daughter after giving her false hope of helping her, and immediately attempting to kill Nezuko Kamado without giving Tanjiro Kamado a chance to prove that she was harmless to humans.Later on, she is shown to have a more compassionate side towards both Tanjiro and his sister after hearing their full story.\n \nIt is later revealed that her outwardly calm and tranquil disposition is worn as a mask, as Shinobu holds an intense hatred for demons due to the loss of her sister, Kanae Kocho, at a young age, along with the deaths of her parents, almost all of her Tsuguko, and the families of her apprentices at the Butterfly Mansion. This hatred is so strong that she is in a near-constant state of extreme anger, which is sensed by Tanjiro Kamado when the two individuals hold a conversation. Her desire for revenge rendered her unable to live the normal life her sister had wished upon her, instead devoting the entirety of her energy to defeating demons.\nDuring her battle against Doma, Shinobu reveals that she also suffers from an inferiority complex due to her inferior physical abilities compared to her fellow Hashira, having been jealous of them for possessing taller or more muscular bodies than her and cursing her own body for not developing further to make her more effective in combat.\n \nShinobu's younger self had a more brash, blunt and uncomplicated demeanor as seen when she and her sister rescued Kanao Tsuyuri, who she had a pointedly negative attitude towards raising. After the death of Kanae, however, Shinobu began to outwardly behave more like her sister and eventually developed her positive attitude and mannerisms to match while internally holding in her rage, which she later clarifies is fueled by her desire to continuously display the smile that her sister favored. Though never shown onscreen, Shinobu has a notable temper, namely in the way that makes even the loud and brash Inosuke Hashibira take notice.\nAbilities\n\nOverall Abilities\n \nAs a Hashira of the Demon Slayer Corps, Shinobu is a very powerful and skilled combatant. Despite not possessing the physical strength to cut off a demon's head common to that of an average Demon Slayer, Shinobu uses her creativity, ingenuity and other physical abilities to more than make up for it. Instead of the traditional method of decapitating a demon with a Nichirin Sword to kill them, Shinobu opts to use a modified version of a katana that acts as a stinger to inject a powerful wisteria-based poison that is lethal to demons. In addition to her intellect, she is extremely fast and agile, allowing her to overpower demons very quickly. Her extreme speed was revealed during her battle with the second most powerful Upper Rank demon, Doma, where she was able to go toe-to-toe with the demon briefly, even managing to outmatch him slightly and receive praise from him.\n \nIndomitable Will: Shinobu possesses an undaunted spirit and incredible willpower, driven by her unyielding hatred for demons. Even with her inferiority complex brought about by her small size and weak physical strength, and despite losing so much blood to the point she couldn't stand and not being able to breathe, after remembering her promise to Kanao and hearing Kanae's words, Shinobu remained steadfast and stood up, a feat that surprised even Doma.\nKeen Intellect: Shinobu is intelligent and possesses vast knowledge and keen observation. During her battle with Doma, she was able to critically analyze and assess the Upper Rank's techniques, further deeming that breathing itself was dangerous due to his Blood Demon Art of frozen mist. Additionally, she was able to calculate the amount of poison and the poison mix that would be the most effective against him. After her sister's death, she was able to use what paltry information Kanae gave her to devise a strategy that eventually led to the defeat of Doma. She also developed a form of sign language with Kanao to communicate crucial information in a short span of time, which helped Kanao in fighting and defeating the Upper Rank demon. Shinobu is manipulative as she would taunt Inosuke by mocking his inability to do Total Concentrated Breathing Constant and later used her charms to encourage the perverted Zenitsu into doing his best to succeed in the same training.\n \nMedical Expertise: Despite not being as combat-talented as the rest of her fellow Hashira, Shinobu instead displays immense skill and mastery in over medical and pharmaceutical fields to make up for her lack of natural-born combat ability, being highly knowledgeable about how to create various poisons using wisteria and utilize them in combat to achieve the most deadly effect. She is capable of killing opponents within seconds, and even manages to create a poison strong enough to drastically weaken Doma, the second strongest demon of the Twelve Kizuki. She possesses the necessary skills to slowly saturate her body with poison without negatively impending her own health, as well as the medical skills needed to counteract the venoms and poisons created by demons. This is seen when she manages to undo the poison that is slowly transforming Zenitsu Agatsuma into a spider and restore him back to his previous human form.\nAnti-Kibutsuji Drug: Upon teaming up with Tamayo and Yushiro, Shinobu was able to aid Tamayo in creating a successful, four-stage drug that would be used to significantly weaken Muzan, even despite his immense physical resistance and abilities. This drug was undeniably one of the biggest factors in the final fight against the Demon King, as it made the normally useless attacks of the Demon Slayers into ones that were super effective, allowing them to drive him into a corner and kill him.\n \nPoisonous Physiology: In order to defeat Doma, Shinobu heavily altered her body by absorbing highly concentrated wisteria-based poison over a period of a year prior to her battle with him. She is successful in saturating her body with the undetectable poison that has completely merged with her body's own cell structures, including those of her blood and internal organs—all the way down to the very tips of her fingernails. With Shinobu's overall size and weight, her body is the equivalent of 37 kilograms worth of poison, approximately 700 times more than the lethal amount needed to kill an average demon, with the poison being strong enough to melt Doma down to his very bones and prevented him from regenerating.\nPhysical Abilities\n \nEnhanced Agility: Being a key aspect to her Insect Breathing swordsmanship style, Shinobu is incredibly agile and swift, shown when she maneuvered through a lush forest effortlessly and evaded Daughter's silk Blood Demon Art with ease. While fighting, Shinobu relies on acrobatic movements to deliver dozens of short thrusts with her katana to inject as much poison as she can into her enemy at once. This also allows her to dodge and evade attacks rather than blocking them. Shinobu's agility even surprised Doma who had trouble keeping up with her extraordinary movements.\nEnhanced Strength: Despite being the smallest member of the Demon Slayer Corps and thus having the weakest swinging strength due to her small arms, Shinobu instead displays powerful thrusting and stabbing strength, as proven when she pierced a stone boulder in half and managed to break a ceiling with an upward thrust attack. Her strength also allows her to pierce the neck of Upper Rank Two, Doma, even lifting up and pinning his much larger frame to the ceiling.\n \nImmense Speed & Reflexes: Shinobu possesses tremendous speed and reflexes enabling her to easily evade and out-pace demons, attacking them before they can even register what happened. Shinobu is so fast that it often appears as if she teleported. Her inhuman speed even managed to surprised Doma as she outpaced the Upper Rank several times during their fight, unleashing multiple strikes that Doma couldn't fully block or evade, making him admit that Shinobu is the fastest Hashira that he had ever met. Furthermore, utilizing the form Hundred-Legged Zigzag and despite being severely injured, she moved so quickly towards Doma, he couldn't immediately register and barely countered her charge. Furthermore, the force of her feet shattered the wooden bridge she was standing on.\nImmense Stamina and Endurance: As a Hashira, Shinobu has attained tremendous levels of stamina and endurance due to years of harsh training. This was shown during her fight against Doma where she was able to keep fighting the Upper Rank despite losing a lot of blood, having one of her lungs punctured and being unable to breathe, a feat which made Doma doubt if she was human.\nFighting Style\n \nMaster Swordswoman: As a Hashira of the Demon Slayer Corps, Shinobu is one of the most powerful and skilled swordswomen in the entire organization. Her fighting style is unique to her alone, but as effective as any traditional swordsmanship styles. Shinobu's swordplay specializes in sword thrusting and piercing techniques in order to inject poison into demons. Her sword thrusts are so fast and powerful that they can pierce boulders and out-speed Water Breathing's Drop Ripple Thrust form, the fastest thrusting technique in that Breathing Style. However, the structure of her sword makes it ineffective for blocking attacks, so she makes up for it with her swift thrusts and stabs. Her swordsmanship prowess allowed her to go against Upper Rank Two, Doma, who has lived and fought for over a century, further showcasing her brilliant sword wielding skill.\nBreathing Style\nInsect Breathing (蟲の呼吸, Mushi no kokyū?): A Breathing Style created by Shinobu Kocho, who designed it to compensate for her lack of physical strength to cut off a demon's head. She has become extremely proficient in this swordsmanship style, allowing her to defeat countless demons and even go toe-to-toe with the second strongest Upper Rank demon, Doma.\nTechniques\n \nButterfly Dance: Caprice (蝶ノ舞　戯れ, Chō no mai: Tawamure?) - The user leaps into the air and charges towards the opponent, stinging them multiple times with their blade to inject poison in just seemingly one strike.\nDance of the Bee Sting: True Flutter (蜂牙ノ舞　真靡き, Hōga no mai: Manabiki?) - The user dashes at their target at blinding speeds and uses the momentum of their speed to then strengthen a single thrust into their opponent and inject poison into them.\nDance of the Dragonfly: Compound Eye Hexagon (蜻蛉ノ舞　複眼六角, Seirei no mai: Fukugan Rokkaku?) - A six strike attack with which the user aims to strike and inject their target with multiple doses of poison at the target's weak spots (such as the neck, heart, torso, etc.) in order to kill them with a large dose of poison.\nDance of the Centipede: Hundred-Legged Zigzag (蜈蚣ノ舞　百足蛇腹, Gokō no mai: Hyakusoku Jabara?) - An attack with which the user uses their full speed to run a zigzag pattern that confuses their opponent in order to create an opening for them to directly stab their opponent's neck and inject poison to kill them, with the stab's force and power being further enhanced by the momentum of their speed. Doma noted that the sheer speed of this technique is strong enough to destroy an entire wooden bridge.\nGame Exclusive Techniques\nButterfly Dance: Caprice, Illusory Light (蝶ノ舞　戯れ・幻光, Chō no mai: Tawamure - Genkō?) - The user lunges at their opponent before unleashing a barrage of straight short thrusts with their sword, ending with one powerful thrust that launches their opponent away and onto their back. The user then leaps into the air while transforming into a gigantic butterfly of light, before diving from it and stabbing their blade straight through their opponent and into the ground, cracking the surrounding terrain and creating a massive crater in its wake.\nButterfly Dance: Caprice, Fluorescence (蝶ノ舞　\"戯れ\"・燐光, Chō no mai: Tawamure - Rinkō?) - The user kicks their opponent upwards and uses blades hidden in their sandals to slash them mid-air, before kicking them downwards. The user then performs Butterfly Dance while homing in on the opponent from above, although instead of a single strike, it’s a constant barrage of poisonous thrusts from all directions, so fast it forms into a ball of energy and erupts into a double-helix shape consisting of butterflies.\nSixfold Thrust (六連突き, Rokuren Tsuki?) - The user unleashes five short but very quick thrusts towards their opponent, before briefly pausing and then unleashing a sixth, more powerful thrust.\nSwift Thrust (速足突き, Haya'ashi Tsuki?) - The user spins before kicking off the ground and quickly dashing towards their opponent with enough speed to simulate teleportation, then does a powerful, singular thrust that hits twice.\nRising Thrust (昇り突き, Nobori Tsuki?) - The user launches a thrust towards their opponent and then releases an upwards thrust that launches their opponent high up into the air.\nThe Brilliant and the Brave (柱と庚, Hashira to Kanoe?, lit. \"Hashira and Kanoe\") - A collaboration between an Insect Breathing user and a Water Breathing user, although unlike Dancing Waters' Allure, it is not required for the Water Breather to have a particularly high skill set. The Insect Breather takes the lead by kicking their opponent back several times before unleashing two thrusting attacks similar to Dance of the Butterfly. After the opponent falls to the ground, the Water Breather joins in and attacks them several times, albeit much more unrefined. The Water Breather then rushes forwards and uses a move similar to Water Surface Slash. However, there’s a minor chance that the Water Breather’s uniform is damaged in the chaos.\nDancing Waters' Allure (水艶乱舞, Suien Ranbu?) - A collaboration between a Water Breathing user and Insect Breathing user. After the two deliver a crosscut, the Water Breather attacks the opponent several times in a winding fashion similar to Striking Tide. The Insect Breather then joins in and delivers a spinning thrust similar to Dance of the Butterfly. The Water and Insect Breather then bombard their opponent with several attacks from their respective Breathing Styles; the former attacking from several directions, the latter somersaulting around their opponent and stabbing them several times. After the Water Breather slashes them, the Insect Breather stabs and kicks them in the air. As the opponent falls down, the Insect Breather charges towards them while the Water Breather executes a move similar to Dead Calm. When contact is made, the opponent is struck by a constant and multidirectional barrage of Water Breathing and Insect Breathing attacks ending in a spectacular combination.\nChemistry Class Concoction (科学実験, Kagaku Jikken?) - A technique exclusive to the Kimetsu Academy version of Shinobu Kocho. As President of the Pharmacology Club, she uses her knowledge in chemistry to give her opponent a Erlenmeyer flask containing a strange pink chemical. She then pours in another chemical from a test tube which reacts violently and results in an explosion, causing Shinobu to sarcastically lament “another failure”.\nEquipment\nStinger Nichirin Katana: Shinobu carries a heavily modified Nichirin Katana forged by Tecchin Tecchikawahara. It is the same as any katana from the handle to slightly above the hilt, but above that, the weapon loses its blade and is replaced by a rod. It ends in a needle-like tip, resembling an insect's stinger in appearance and function. The blade is designed for injection of wisteria poison into demons, as Shinobu uses her medical expertise to replace her relative lack of strength and inability to decapitate demons. Her katana's tsuba is designed to bear resemblance to a butterfly, being four-petaled flower shaped, being in aqua color, and trimmed with an orange border. The handle is orange and wrapped in turquoise cords, and capped with an orange kashira. The blade is lavender-blue in color, with the words Evil Demon (惡鬼, Akki?) engraved on the right face, while the words Destruction (滅殺, Messatsu?) are engraved on the left face due her sword's structure. Along with her katana, she has also modified the weapon's sheath, using it as a portable poison mixer and loader, with the sheath being in white color.\nGallery\nAn illustration of Shinobu's modified Nichirin katana.Shinobu's tsuba.Puzzle & Dragons sprite.\nRelatives\nFather\n \n \n \n \nMother\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nKanae\n \n \n \n \nShinobu\n \n \n \n \nKanao\n*Kanae and Shinobu purchased Kanao out of slavery and adopted her as their little sister.\nBattles\nShinobu Kocho Battles\nMount Natagumo Arc\nShinobu Kocho vs Spider Demon (Daughter)\nInfinity Castle Arc\nDemon Slayers vs Muzan Kibutsuji: Part 1\nShinobu Kocho vs Doma\nTrivia\nShinobu's surname contains the Kan-on'yomi reading of the kanji for \"butterfly\" (胡蝶, kochō?). Her first name is written in hiragana and thus doesn't have any semantic values, but it's usually written with the kanji for \"stealth, endurance, patience\" (忍, shinobu?).\nSince her first name uses three hiragana characters, it's notably different to Kanae and Kanao's names, as they're both written with three katakana characters instead.\nShinobu's rankings in the popularity polls are as follows:\nShinobu ranked 6th in the first popularity poll with 1813 votes.\nShinobu ranked 5th in the second popularity poll with 8787 votes.\nShinobu shares her Japanese and English voice actresses with Emi Igawa from Your Lie in April, Yumeko Jabami from Kakegurui, and Therese Alexanderite from The Rising of the Shield Hero.\nShinobu's Demon Slayer uniform's jacket is originally designed to leave the center of the chest area open, similar to Mitsuri Kanroji's, but, as Shinobu disliked this aspect of its design, she burned the original uniform right in front of the Kakushi who had just given it to her and requested a fully buttoned version of the uniform instead.\nShinobu and Mitsuri get along quite well due to them having been the only two female Hashira after Kanae Kocho's death. Mitsuri also teaches her western cooking.\nShinobu's parents worked in compounding medicine, a reason why Shinobu is also very talented with medicines.\nThe amount of wisteria poison in Shinobu's body was originally stated to be seventy times the lethal amount to kill a demon in the magazine version, but it was later corrected by Koyoharu Gotoge to be seven hundred times in the volume edition.\nShinobu's blade was designed and created by the chief of the Swordsmith Village, Tecchin Tecchikawahara, likely due to its unique shape requiring the chief's expertise to forge.\nThere was some tension during the cooperative research time between Shinobu and Yushiro. Shinobu held some distrust towards Tamayo due to her being a demon and Yushiro wished to kill Shinobu as a result of it.\nShinobu has a pet goldfish named Fugu.\nAccording to Giyu Tomioka, Shinobu can't stand furry animals.\nAlthough Shinobu wouldn't admit it, she was a natural airhead. The names she came up with for Kanao Tsuyuri were so bizarre that upon seeing them, Kanae broke down into such an \"EH?!\" expression that even Aoi Kanzaki wasn't able to smoothen things out.\nShinobu viewed the other Hashira as follows:\n\"He's a good guy but our conversations don't always make sense.\" - Flame Hashira\n\"I treated his wounds and examined his memory loss. He has difficulty choosing words, but he's a good kid at heart.\" - Mist Hashira\n\"Sometimes we discuss physical movement (in swordsmanship).\" - Serpent Hashira\n\"I deeply respect him.\" - Stone Hashira\n\"He should talk more.\" - Water Hashira\n\"We clashed when he tried to take Aoi and the others on a mission.\" - Sound Hashira\n\"I love her. She's cheerful and cute.\" - Love Hashira\n\"When we meet, he always asks how I've been.\" - Wind Hashira\nShinobu's overall level of openness was ranked 85%.\nShinobu's haori resembling a monarch butterfly's wings is notable as in real life, the milkweed diet of the butterflies causes them to be poisonous, which is a defense against predators. This both is represented through Shinobu's usage of poison, and mirrors how her habit of consuming wisteria caused Doma to be severely poisoned after absorbing her.\nShinobu's favorite food is Ginger Tsukudani.\nShinobu's hobby is telling ghost stories.\nIn Kimetsu Academy, Shinobu is the president of Pharmacology Club and Fencing Club, and even won the fencing championship. She's also friendly with the Flower Arrangement Club, because their clubroom is close.\nQuotes\n(To Tanjiro Kamado) \"How can you feel sorry for something that's killed humans? I've never heard of anything so absurd. But if that was how my sister truly felt, then I must carry it on. If there's a way not to kill these pitiful demons, I have to keep trying to come up with it. Without ever extinguishing the smile my sister said she loved...\"\n(To herself, recollecting her childhood life) \"I once believed that the road of happiness continued forever and ever into the distance. When it was destroyed, I realized for the first time that it lies upon a thin sheet of glass. And just as we were saved, there were those whose happiness that haven't yet been destroyed. So I wanted to get stronger and protect them. That's what we promised each other. Even if we're weak and can't cut off demon heads, if we defeat one demon, we can save dozens of people. And if we can defeat an Upper Rank Kizuki, we can save hundreds. It isn't about whether we can or cannot do. There are things we have to do.\"\n(To herself, responding to a question Tanjiro Kamado asked in the past) \"Yes, I'm angry, Tanjiro. I've always been angry. My parents were killed. My older sister was killed. And all my Tsuguko except Kanao were killed. If demons hadn't murdered those girls' families, they'd be living happily with them right now. It really makes me furious!\"\nReferences\n↑ Official Twitter Account\n↑ 2.0 2.1 Kimetsu no Yaiba Manga: Chapter 41 (Page 19).\n↑ Kimetsu no Yaiba Manga: Chapter 45 (Page 7).\n↑ Kimetsu no Yaiba Manga: Chapter 44 (Page 4).\n↑ Kimetsu no Yaiba Manga: Chapter 45 (Page 14).\n↑ Kimetsu no Yaiba Manga: Chapter 47 (Page 7).\n↑ Kimetsu no Yaiba Manga: Chapter 143 (Page 6).\n↑ Kimetsu no Yaiba Manga: Chapter 141 (Pages 2-3).\n↑ 9.0 9.1 9.2 9.3 9.4 Kimetsu no Yaiba Manga: Chapter 142 (Pages 9-10).\n↑ Kimetsu no Yaiba Manga: Chapter 45 (Page 2).\n↑ Kimetsu no Yaiba Manga: Chapter 41 (Pages 16-19).\n↑ Kimetsu no Yaiba Manga: Chapter 44 (Page 2).\n↑ 13.0 13.1 13.2 Kimetsu no Yaiba Manga: Chapter 42 (Pages 8-10).\n↑ 14.0 14.1 14.2 Kimetsu no Yaiba Manga: Chapter 41 (Pages 15-19).\n↑ Kimetsu no Yaiba Manga: Chapter 142 (Page 5-19).\n↑ Kimetsu no Yaiba Manga: Chapter 142 (Page 10-14).\n↑ Kimetsu no Yaiba Manga: Chapter 142 (Pages 5-6).\n↑ Kimetsu no Yaiba Manga: Chapter 162 (Page 1-8).\n↑ Kimetsu no Yaiba Manga: Chapter 143 (Page 11).\n↑ 20.0 20.1 Kimetsu no Yaiba Anime: Episode 20.\n↑ Kimetsu no Yaiba Manga: Chapter 42 (Pages 2-3).\n↑ Kimetsu no Yaiba Manga: Chapter 141 (Pages 16-18).\n↑ Kimetsu no Yaiba Manga: Chapter 163 (Pages 7-9).\n↑ Kimetsu no Yaiba Manga: Chapter 193 (Pages 16-20).\n↑ Kimetsu no Yaiba Manga: Chapter 162 (Pages 5-8).\n↑ Kimetsu no Yaiba Manga: Volume 19, (Extra Pages).\n↑ Kimetsu no Yaiba Manga: Chapter 142 (Pages 16-19).\n↑ Kimetsu no Yaiba Manga: Chapter 142 (Page 18-19).\n↑ 29.0 29.1 Kimetsu no Yaiba Manga: Chapter 141 (Pages 11-14).\n↑ 30.0 30.1 30.2 Kimetsu no Yaiba Manga: Chapter 142 (Pages 6-7).\n↑ Kimetsu no Yaiba Manga: Chapter 142 (Pages 7).\n↑ Kimetsu no Yaiba Manga: Chapter 142 (Page 15-16).\n↑ Kimetsu no Yaiba Manga: Chapter 142 (Page 11).\n↑ Kimetsu no Yaiba Manga: Chapter 142 (Page 14).\n↑ Kimetsu no Yaiba Manga: Chapter 45.\n↑ 36.0 36.1 Kimetsu no Yaiba Manga: Volume 16, (Extra Pages).\n↑ Kimetsu no Yaiba Manga and Anime: Chapter 41 and Episode 20.\n↑ Kimetsu no Yaiba Manga: Chapter 141 (Page 14).\n↑ Kimetsu no Yaiba Manga: Chapter 142 (Pages 15-16).\n↑ 40.0 40.1 40.2 40.3 40.4 Kimetsu no Yaiba Game: The Hinokami Chronicles.\n↑ 41.0 41.1 41.2 Kimetsu no Yaiba Game: The Hinokami Chronicles 2.\n↑ Kimetsu no Yaiba Manga: Volume 16 (Page 12).\n↑ Kimetsu no Yaiba Manga: Chapter 141 (Page 18).\n↑ Kimetsu no Yaiba Manga: Volume 12, (Extra Pages).\n↑ 45.0 45.1 Kimetsu no Yaiba First Fanbook.\n↑ \nKimetsu no Yaiba Manga: Volume 19.\n \n↑ \nKimetsu no Yaiba Manga: Volume 19.\n \n↑ 48.0 48.1 48.2 48.3 Kimetsu no Yaiba Second Fanbook.\n↑ 49.0 49.1 Kimetsu no Yaiba First Fanbook.\n↑ Kimetsu no Yaiba Manga: Volume 7, (Extra Pages)\n↑ Kimetsu no Yaiba Anime: Episode 24.\n↑ Kimetsu no Yaiba Manga: Chapter 143 (Page 2).\n↑ Kimetsu no Yaiba Manga: Chapter 143 (Page 6-7).\nNavigation\n Characters\nDemon Slayer Corps\nUbuyashiki Family:\nKagaya Ubuyashiki · Amane Ubuyashiki · Hinaki Ubuyashiki · Nichika Ubuyashiki · Kiriya Ubuyashiki · Kuina Ubuyashiki · Kanata Ubuyashiki · Senri Ubuyashiki · Akito Ubuyashiki\nHashira:\nGiyu Tomioka · Mitsuri Kanroji · Obanai Iguro · Sanemi Shinazugawa · Gyomei Himejima · Kyojuro Rengoku · Tengen Uzui · Muichiro Tokito · Shinobu Kocho · Kanae Kocho · Sakonji Urokodaki · Jigoro Kuwajima · Shinjuro Rengoku\nDemon Slayers:\nTanjiro Kamado · Zenitsu Agatsuma · Inosuke Hashibira · Genya Shinazugawa · Kanao Tsuyuri · Murata · Ozaki · Masachika Kumeno · Yoriichi Tsugikuni · Takeuchi · Nagakura · Noguchi · Yoshioka · Shimamoto\nButterfly Mansion:\nAoi Kanzaki · Sumi Nakahara · Kiyo Terauchi · Naho Takada · Goto\nSwordsmith Village:\nTecchin Tecchikawahara · Hotaru Haganezuka · Kozo Kanamori · Kotetsu · Tetsumotonaka · Tetsudoji · Tetsutani · Tetsuido\nOther/Associates:\nSabito · Makomo · Suma · Makio · Hinatsuru · Masao Maeda\nDemons\nDemons:\nMuzan Kibutsuji · Nezuko Kamado · Temple Demon · Hand Demon · Swamp Demon · Asakusa Demon · Tamayo · Yushiro · Susamaru · Yahaba · Tongue Demon · Horned Demon · Spider Demon (Father) · Spider Demon (Mother) · Spider Demon (Son) · Spider Demon (Daughter) · Shizu Shinazugawa · Woodland Demon · Serpent Demon\nTwelve Kizuki:\nKokushibo · Doma · Akaza · Nakime · Hantengu · Gyokko · Gyutaro · Daki · Kaigaku · Enmu · Rokuro · Wakuraba · Mukago · Rui · Kamanue · Kyogai\nCivilians/Other\nKamado Family:\nTanjuro Kamado · Kie Kamado · Takeo Kamado · Hanako Kamado · Shigeru Kamado · Rokuta Kamado · Sumiyoshi Kamado · Suyako Kamado · Sumire Kamado\nShinazugawa Family:\nKyogo Shinazugawa · Sumi Shinazugawa · Teiko Shinazugawa · Hiroshi Shinazugawa · Koto Shinazugawa · Shuya Shinazugawa\nNorthwest Town:\nKazumi · Satoko · Tokie\nTsuzumi Mansion:\nTeruko · Shoichi · Kiyoshi\nEntertainment District:\nKoinatsu · Omitsu · Toyo · Rei · Yatsu\nOther:\nSaburo · Hisa · Senjuro Rengoku · Ruka Rengoku · Yuichiro Tokito · Tsutako Tomioka · Sayo · Keizo · Koyuki · Kotoha Hashibira · Akeno Tsugikuni · Uta · Takaharu\nAnimals:\nChachamaru · Kaburamaru\nSpecies/Groups:\nKasugai Crows · Ninju\nDescendants/Reincarnations\nKamado Family:\nKanata Kamado · Sumihiko Kamado\nAgatsuma Family:\nToko Agatsuma · Yoshiteru Agatsuma\nOther:\nAoba Hashibira · Tojuro Rengoku · Tenma Uzui · Giichi Tomioka · Sanehiro Shinazugawa\nSpin-Off/Anime Original Characters\nDemon Slayers:\nUraga\nCivilians:\nYae · Taro · Fuku · Tomi · Tatsu\nDemons:\nMatazo · Hairo · Flute Demon · Ubume · Slasher · Mantis Demon"
}