{
  "requested_name": "Shinobu Oshino",
  "resolved_title": "Shinobu Oshino",
  "url": "https://bakemonogatari.fandom.com/en/wiki/Shinobu_Oshino",
  "summary": "Shinobu Oshino (忍野 忍, Oshino Shinobu) is a mysterious vampire girl who acts as Meme Oshino's companion in the ruins of Eikou Cram School. Later in the series, she resides in Koyomi Araragi's shadow during the day.",
  "full_text": "Shinobu Oshino\nShinobu Oshino (忍野 忍, Oshino Shinobu) is a mysterious vampire girl who acts as Meme Oshino's companion in the ruins of Eikou Cram School. Later in the series, she resides in Koyomi Araragi's shadow during the day.\nShe was formerly a human princess named Laura who was cursed into causing anyone in proximity to her to commit suicide. She then took the name of Acerola before meeting a purebred vampire that turned her into a powerful vampire named Kiss-Shot Acerola-Orion Heart-Under-Blade (キスショット・アセロラオリオン・ハートアンダーブレード, Kisushotto Aseroraorion Hātoandāburēdo). She now takes the form of an eight-year-old girl with another new name after losing most of her powers.\nShe is the titular protagonist of five main arcs: Shinobu Time, Shinobu Mail, Acerola Bon Appétit, Shinobu Mustard and Shinobu Suicide, and four minor arcs: Shinobu House, Shinobu Science, Shinobu Figure, and Princess Beauty.\nName\nShinobu Oshino is the \"human name\" of the vampire Kiss-Shot Acerola-Orion Heart-Under-Blade. She generally is called this, depending on the person talking about her or her power level at the time. This vampire name was conceived by Deathtopia Virtuoso Suicide-Master, who was very proud of how meaningful the name is.\nKiss-Shot, the 'first name', is a reference to the fairy tale of cursed princesses being healed by a kiss from a prince. This also mirrors Araragi, who saved her from death, and became her 'prince'. Also, \"Kiss-shot\" is a reference to the Japanese mythological deity of beauty, Kisshouten, which mirrors her cursed beauty and attempt to become a goddess. Acerola-Orion, the 'middle name', is composed of Acerola, Princess Laura's self given alias after the start of her journey, and Orion, which is a constellation on the equator east of Taurus represented as a hunter with a belt and sword, which reflects her nature as a vampire, that being to hunt and eat humans, as well as furthers Deathtopia's comparison of Princess Acerola to a sword. Finally, Heart-Under-Blade, the 'last name', is born from Deathtopia's impressions of Princess Acerola as a strong woman, like a sword, but with a kind heart. This name is also the inspiration for the name Shinobu (忍), as it is literally made up of the kanji for heart (心) under the kanji for blade (刃). Also, this name is connected with the plot of Kizumonogatari, where her heart was hunted by three vampire hunters, with each of them having wordplay with the word \"blade\" in their names.\nIt is understood that people who have known her, either directly or by reputation, call her by her full vampire name in all cases, exception made of the specialists close to Meme Oshino who was the one to adopt and name her Shinobu after she lost her power following Koyomi Vamp.\nOn the contrary, people close enough to Koyomi Araragi to be aware of her existence refer to her as Shinobu, as her child form is the only one they generally know of (exception made for Tsubasa Hanekawa).\nOnly Koyomi refers to her with both names, generally to referring to her according to her power level. Shinobu herself agrees that being weak changed her personality and that she knows her personality would probably revert to the time of pre-Spring Break during the events of Kizumonogatari if she were to come back to being the powerful vampire she once was. Koyomi generally refers to her as Shinobu intimately, but doesn't hesitate to refer to her by her full vampire name when thinking about her, not wanting to forget her nature nor forgive her actions during Spring Break.\nIntimately, only Koyomi and Seishirou Shishirui called her by the nickname Kiss-shot in front of her. However, most people referring to her vampire nature abridge her name this way behind her back.\nAppearance\nShinobu is a young female with yellow eyes, pointy ears, sharp fangs, and very long blond hair which curls outward at the end. During the course of the series, she takes on several changes in appearance depending on how much of her vampire powers she possesses. Through most of the series, she assumes a younger form as an eight year old. She wears a loose white dress and a pair of sandals, with an aviator hat (implied to be a part of her own body) as an accessory in Bakemonogatari. Later on in the series, her eight-year old form occasionally wears dresses of other colors.\nAs demonstrated in Nisemonogatari, she can suck blood to become older; she appears as a girl in her adolescent years, tying her hair into a ponytail and wearing a black camisole inside a purple jacket, a black skirt and black hosiery. In Kizumonogatari, obtaining her stolen body parts causes her to age, along with gradually transforming her clothes into an appearance similar to her adult form. Her true form as Kiss-Shot depicts a woman in her late twenties wearing an old red dress decorated with black fur, long white gloves, black hosiery, and white high-heels.\nThe Bakemonogatari manga adaptation has Kiss-shot's appearance and clothes occasionally change in their designs throughout the story due to the manga's art style. The seventeen-year old form of Kiss-shot has two long ponytails and wears a black trenchcoat-like uniform. Her true adult form wears a revealing long black dress with bat ornaments. When Kiss-shot is fighting Koyomi in the Kizumonogatari arc of the manga, her dress transforms into black demonic armor with spikes and parts of her hair become long horns, later implied to be her vampire combat attire. Flashbacks of Kiss-shot from hundreds of years ago in the manga portrayed her having shorter hair while wearing a variety of different old-styled dark dresses. It is unknown if the anime or light novel versions of Kiss-shot are able to have these appearances in her different forms.\nDesigns for BakemonogatariDesigns of Kiss shot for BakemonogatariDesigns for NisemonogatariDesigns for KabukimonogatariDesigns for OtorimonogatariDesigns for TsukimonogatariDesigns for KizumonogatariDesigns for Zoku Owarimonogatari\nPersonality\nAfter losing most of her vampire powers, Shinobu falls into a long period of stupor. She is frequently seen in Oshino's place with her hands tucking her knees in, her face always in an emotionless state. She often spends most of the day in one spot, doing mostly nothing with a bitter expression. Shinobu also does not talk to anyone, but she is familiar with Koyomi Araragi and Meme Oshino, and would follow requests from either of them.\nLater she reverts back to her brighter personality after \"reconciling\" with Koyomi. She is rather talkative, and often asserts her superiority through her archaic speech. She mostly plays with Koyomi's tendency to act as the follower between the two. Sometime after Koyomi Vamp, she appears to find a liking to Mister Donuts and they become her obsession. She refers to herself using \"washi\" (ワシ), which is often used in fictional settings to represent characters of old age. This is translated in the English version of the series by having her speak occasionally in an Old English accent.\nShinobu holds affection for Koyomi stemming from him saving her in Koyomi Vamp. She is seen to show jealousy if he spends too much time around other girls or gets too close to those she does not like, notably Nadeko Sengoku. She is shown to be touched by Koyomi being willing to live and die with her, but as called out by Suruga Kanbaru, is initially unwilling to openly return the sentiment until months later in Ougi Dark. When her first minion Seishirou resurfaces, she is concerned that she might choose to return to Seishirou over Koyomi, still having some affection for him, but admits in the end that she wants to stay with Koyomi. Her liking for Koyomi leads to her desiring to restore their master-servant bond whenever it is broken, despite it restricting her abilities and movements.\nDue to being around Meme for many hours while performing her silent treatment, she's obtained a bit of knowledge about different types of oddities, and often helps out Araragi in his time of need, but she still remains as no expert.\nShinobu very rarely refers to anyone by name, with Koyomi showing surprise that she called Tsukihi by hers in Tsukihi Phoenix. Instead she refers to most people by nicknames, such as calling Hitagi \"tsundere girl\".\nBackground\nShinobu's past from before she became a vampire is revealed in \"Princess Beauty\" (うつくし姫 Utsukushihime), published in Anime Monogatari Series Heroine Book 3: Shinobu. It was later included in Wazamonogatari.\nShe was originally named Laura and was the only daughter of a noble family in an unspecified foreign kingdom outside of Japan (implied to be of European origins in the anime) over five centuries ago. Her beauty was famous throughout the entire kingdom, causing her to become known as Princess Beauty. Countless people would line up outside her palace everyday just to see her. Anyone who sees her for the first time is shocked that her beauty exceeds any expectations, and they would bring her countless gifts everyday. Despite everyone's love for her, Laura was never happy, and she never smiled. She wished people would see what's inside her, instead of just her exterior. One day an elderly witch came to grant her wish. The witch turned her physical appearance invisible, and people could only see her inside.\nHowever, her interior turned out to be far more beautiful than her exterior. Her inner beauty manifested itself as a bright light that enveloped the entire kingdom. After seeing her inner beauty, her father felt extreme guilt for not being able to understand her and see her true self, and killed himself out of this guilt. Her mother was so satisfied by giving birth to such a perfect child, that she felt she had nothing left to do in this world. Thus, she also committed suicide. People were so astounded by her pure heart that instead of giving her material gifts they gave her their most valuable possessions: their lives. If they had things more important to them than their lives, they would give her those instead. (e.g. a musician gave her his ears, a poet gave her his tongue, a sculptor gave her his eyes, and some gave her their children's lives, their grandchildren's lives, etc.). Corpses of those who committed suicide for Princess Beauty piled up outside her palace. Before long, the pile of corpses grew higher than the palace.\nLaura was devastated at the result. The witch couldn't turn her back because she gave Laura her knowledge-filled head (the witch beheaded herself). However, Laura's tear was able to revive the witch for a small moment, and the witch told her to go on a journey. The witch told her to avoid people, and to never stay in one place for too long. Otherwise, people will get drawn to Laura's heart and start taking their own lives again.\nPlot\n\nAcerola Bon Appétite\nThis section contains content from Wazamonogatari.Princess Beauty, at that point taking the name of Acerola, continued her journey to find someone to cure her curse that caused all around her to kill themselves at the sight of her beautiful heart. She met a purebred vampire named Deathtopia Virtuoso Suicide-Master who allowed her to stay inside her castle in order to find a solution to her problem, as she, due to her immortality, was the only person able to communicate with Acerola.\nAfter she overstayed her welcome to him, Suicide-Master's servant, Tropicalesque Home-A-Wave Dog-Strings, attempted to kill her, brutally killing himself past the point of regeneration in the process. Devastated at causing yet another death, she requested Suicide-Master to turn her into a vampire so that even if she can't lift her curse, she can at least eat the corpses she leaves so that their deaths won't be in vain.\nSuicide-Master renamed her Kiss-Shot Acerola-Orion Heart-Under-Blade, the Kiss-shot portion referencing the fact that kissing a prince might be the only way to lift her curse. After becoming Suicide-Master's servant, she left to continue wandering the world and eventually, the curse seemed to have lifted. It's not clear if becoming a barbaric vampire was the direct cause of the curse being lifted, or whether or not she actually found a prince to save her, but Suicide-Master seems to suggest that the former could be the case.\nKoyomi Vamp\nThis section contains content from Kizumonogatari.\n \nKiss-shot arrived in the Japan, the place she met the person who eventually became her first minion, for the second time in her life, looking for a place to die. Sometime after arrival, she was attacked by three vampire hunters at once and decided to let them kill her. After her limbs (and unknowingly, her heart) were stolen, she was left for dead and had second thoughts, fearing death at the last moment. Koyomi Araragi later finds her limbless and is terrified. After demanding him to give his life in order to let her live, he runs away as she cries for her life. After contemplating, he changes his mind and gives his neck to her, ready to die.\n \nHe awakes in Eikou Cram School as a vampire and finds the now weakened Kiss-shot had taken the form of a 10 year old girl. She tells him that he can turn back into a human if he can get all of her missing limbs back from the vampire hunters. With each limb retrieved, she grew older by a few years, to a 12 year old and later a 17 year old. Once he succeeded in getting her last limb and also her heart, she returns to her original form and eats Guillotine Cutter when Koyomi was away. Shocked and outraged, Koyomi contemplates suicide for reviving a monster that eats people. Tsubasa reveals that in order to become a human again, he must kill his master.\n \nKiss-shot secretly planned on having Koyomi kill her so she could finally find a proper way to die and allow her minion to turn back into a human. The two fight a pointless fight, excessively decapitating their immortal bodies. In the midst of their fight, Tsubasa arrives. Before Kiss-shot could harm her, Koyomi jumps on Kiss shot, sucking her blood to the brink of death, but stops. With the help of Hanekawa, they realize her true intentions.\n \nAfter having her plan revealed, Koyomi rejects it as he doesn't want to kill her. With the help of Meme Oshino, he finds a compromise that leaves no one's wishes granted. Instead of killing her completely, he would get her to the brink of death, weakening her power, making him as close to human as possible. In return, she'd be so weak that she wouldn't even be able to take the same name anymore. To keep her alive, Koyomi would occasionally feed her his blood. This plan goes through, only the now unnamed vampire holds a grudge and refuses to speak.\nTsubasa Family\n \nThis section contains content from Nekomonogatari.During the Golden Week following Koyomi's encounter with Kiss-shot, she continues to stay inside the abandoned Eikou Cram School Building, where she appears to have developed a more childlike personality and physical appearance, reminiscent of an eight-year-old. In one visit, Koyomi brings some donuts for Meme, but they ended up in the vampire girl's hands after she stubbornly demanded some. \n \nKoyomi later pleaded for her to lend him the Kokorowatari for him to use against Tsubasa Hanekawa in an attempt to separate the sawarineko from Tsubasa herself. She gave him the sword after days of Koyomi's incessant pleas to her, but she ends up using the oddity killer herself when Koyomi exposes his incapability of using the sword properly. After swallowing the sword whole and biting Tsubasa, Black Hanekawa was suppressed.\nHitagi Crab\n \nThis section contains content from Bakemonogatari.During Hitagi Crab, she spends most of her time inside Eikou Cram School, sitting still in a corner and continuing not to talk to anyone. Meme revealed a new name for her, suggesting her name be Shinobu (忍), as \"heart\" (心) under \"blade\" (刃) matches with her original personality and name.\nSuruga Monkey\nTo prepare Koyomi for his fight against the Rainy Devil, Shinobu sucks some of Koyomi's blood upon Meme's request, allowing him to make more use of his vampire powers within a limited period of time. Her contribution barely helped Koyomi in subduing the Rainy Devil, but it was enough for him to survive for the entire ordeal before Hitagi Senjougahara's intervention.\nTsubasa Cat\n \nAfter spending the night in Eikou Cram School, Nadeko Sengoku tells Koyomi she saw Shinobu glaring at her for some reason.\nMayoi Hachikuji claims she saw Shinobu running away from home. As Koyomi searches for her, he contacts the other girls to help him. While everyone searches by themselves, Koyomi ends up searching with the help of Black Hanekawa. \n \nAfter it gets dark and they arrive at an area full of street lamps, Black Hanekawa threatens to kill him if he doesn't go out with Tsubasa, revealing the feelings for him she's been keeping secret since they first met. As she chokes him, Shinobu reveals herself by jumping out of a shadow and suppressing her once again by sucking her blood. Afterwards, without saying a word she submerges into Koyomi's shadow, where she commonly resides for the rest of the series.\nKaren Bee\n \nThis section contains content from Nisemonogatari.During Koyomi's predicament with his sister Karen Araragi's condition, while bathing Shinobu jumps out of his shadow and properly talks to him for the first time since he refused to kill her. She asks him to kill her to become a real human once more, but he rejects the idea, never wanting to talk about it again. He declares he'll only let her die if he dies with her, even if his vampire life span causes him to witness all his friends and family dying before him. Although she claims that she does not like him, Shinobu agrees to reconcile with Koyomi.\nShe helps out in curing Karen's oddity-induced fever, claiming that hanging around Meme for so long gave her a huge wealth of knowledge about oddities. The next day, Shinobu helps out in tracking down Karen, who after recovering left the house in an attempt to get back on her defeat against Deishuu Kaiki.\nTsukihi Phoenix\nShinobu asked Koyomi to take her to Mister Donuts for the 100 yen sale. Koyomi agrees as he wants Shinobu to tell him about Yotsugi Ononoki and Yozuru Kagenui. She does, and Koyomi learns about Yotsugi, but Shinobu refuses to share information about Yozuru, stating she is \"not going to share information about a respectable person\" and tells him to ask Deishuu.\nLater after powering up into a similar form of her former self she helps Koyomi fight for his sister by fighting Yotsugi. She also learns Tsukihi Araragi's the \"tsuki\" part of Tsukihi's name, as it means moon and she likes the moon, the sun is her enemy. During the fight with Yotsugi and Yozuru, Shinobu was powered up into her teenage form and easily beat Yotsugi in battle off screen.\nShinobu House\nAfter the events in Tsukihi Phoenix, Koyomi introduces Hitagi to his sisters. After the \"Gahara Summit\", Shinobu is shown to be jealous and wants more attention from Koyomi. She goes on a dramatic exaggerated rant in an attempt to receive affection from him, and eventually asks Koyomi who would he save if Hitagi, herself, and his sisters were all hanging on an edge. She is amused and satisfied by Koyomi's answer that he would ask Hanekawa for help.\nMayoi Jiangshi\nThis section contains content from Kabukimonogatari.In Mayoi Jiangshi, Shinobu offers to help Koyomi with finishing his summer homework by revealing she is capable of time-travel as a vampire. Koyomi accepts, although Shinobu mistakenly takes him to an alternate timeline where she went berserk after Koyomi and his friends failed to find her during the events of Tsubasa Cat and Koyomi was then killed by Black Hanekawa. When she originally ran away, she had sworn to destroy the world if Koyomi didn't find her. When he died, her original powers returned to her and she turned everyone in the alternate timeline into zombie-like vampires. Afterwards, attempted suicide but failed due to her regeneration.\nAs Shinobu and Koyomi prepare to fight the alternate Shinobu in hopes to get her to send them back to their original time, she instead weeps at the sight of her being able to come to an understanding with Koyomi in an alternate timeline, as now she feels nothing but despair for what she'd done. She allows real Shinobu to suck her blood and turn her into ghastly energy, allowing them to travel back to their original timeline.\nShinobu Time\nThis section contains content from Onimonogatari.Shinobu tells Koyomi the story of her first minion and the anti-existence known as \"The Darkness.\" When she first arrived in Japan as Kiss-Shot a long time ago after leaping from Antarctica, she had landed in a nearby lake that resulted in an explosion which launched all of its water into the air. In doing so, she inadvertently saved a local village from an ongoing drought by \"making it rain.\" As a result, the villagers praised her for her miracle and began to worship her as a deity. She followed along with the misconception and played the part of a false \"god\", hiding her true identity as a vampire.\nAn oddity specialist - now referred to by her as the Original Oddity Slayer - eventually arrived to investigate the rumored manifestation of a new god. With the power to slay oddities granted through the twin-blades Kokorowatari and Yumewatari, of which he was the original owner, the specialist worked with Kiss-Shot to rid the area of unwanted oddities, and the two would eventually form a bond. Despite this, the village people would all slowly and mysteriously vanish, leaving only Kiss-Shot and the specialist behind. The source of these disappearances happened to be the work of \"The Darkness\", a \"corrective\" entity which annihilated oddities that strayed from their true natures. After erasing all of the villagers that had been worshiping a vampire as a goddess, the darkness then attempted to destroy Kiss-Shot for deviating from her vampiric nature, and in the end, it nearly annihilated her and consumed all of the specialist, save his hand. Kiss-Shot then fled back to Antarctica with the remaining hand and immediately felt lonely; to remedy this, she conceded to bite the specialist's hand. In doing so, she revived the specialist as her first minion. The specialist - unable to accept his reincarnation as a vampire - broke ties with Kiss-Shot and attempted suicide by casting himself towards the sun, leaving only Kokorowatari as a memento of his existence.\nAfter telling this story, the Darkness appears again, this time in pursuit for Mayoi Hachikuji. In Koyomi's attempt to escape it, it severs Shinobu's connection to him when it envelops his shadow. Yotsugi Ononoki then uses Unlimited Rulebook to teleport her along with Koyomi and Mayoi away, incidentally leaving Shinobu behind. After they left, it's implied that the Darkness disappeared and Shinobu was spared; she then went home and waited in Koyomi's room until her appearance in Tsubasa Tiger.\nTsubasa Tiger\nThis section contains content from Nekomonogatari.Black Hanekawa finds Shinobu in Koyomi's room after she disappeared in Shinobu Time. The two come to an agreement to help each other, and arrive at the now burned down Eikou Cram School. Off screen, they end up fighting a monkey-crab oddity together when Yotsugi comes to finish the fight with Unlimited Rulebook. She then stays at Namishiro Park until Koyomi and Suruga Kanbaru find her in Shinobu Mail.\nShinobu Mail\nThis section contains content from Owarimonogatari.After finding Shinobu, the monkey-crab oddity returned. Koyomi used the Kokorowatari to slay it, but then Jagirinawa jumped out from its fading corpse. Shinobu defeated the snake and ate the rest of the corpse.\nThe oddity was sent from Seishirou Shishirui, the original oddity slayer who had returned to claim his Kokorowatari back and make up with Shinobu after he found out she turned him into a vampire and tried to kill himself. Shinobu was bitter about the situation and refused to see him as she had made a new minion and expected to never meet him again.\nAfter Koyomi beats Seishirou in a duel by planting a talisman on him, Shinobu apologizes to him and cries as she eats the remains of his body, allowing him to finally die.\nMonths afterwards, Yotsugi asks Koyomi if his feelings regarding the \"miserable\" arrangement between him and Shinobu have changed, considering the lengths Koyomi went for Shinobu and Shinobu's choice to stay with him instead of Seishirou. Shinobu remains silent in his shadow as Koyomi denies any happiness brought by him becoming a vampire and his bond with her, claiming they still make everyone unhappy.\nNadeko Medusa\nThis section contains content from Otorimonogatari.Shinobu appears to not like Nadeko Sengoku very much. When she slept over in Nadeko Medusa, Shinobu manages to prevent Nadeko and Koyomi from sleeping on the same bed, in which Shinobu tells Nadeko that she's lucky that she's cute enough to be able to stir up protective feelings from Koyomi.\nAs Koyomi and Shinobu spot Nadeko about to swallow the tailsmen in his room, she tries to eat her before it's too late but fails and Nadeko turns into her Medusa form. She and Koyomi later meet Nadeko at North Shirahebi Shrine to fight. She nearly kills both of them before Hitagi calls Nadeko on the phone to convince her to wait until Koyomi graduates from high school.\nKoyomi Torus\nThis section contains content from Koyomimonogatari.After discussing the predicament they're in with Nadeko wanting to kill them both and Koyomi having gotten fresh homemade donuts from Hitagi, Shinobu and Koyomi play a game of donut hide and seek.\nWhen Koyomi cannot find the last one, he calls Hanekawa and asks her about it, to which Hanekawa explains that Shinobu likely hid one inside another. While Koyomi cannot comprehend Shinobu's behavior as to why she did not just eat the donuts, Hanekawa explains that Shinobu let go of her personal desire as a gesture of love towards him.\nYotsugi Doll\nThis section contains content from Tsukimonogatari.Shinobu and Koyomi discover that he's turning back into a full vampire after finding he has no reflection in the mirror. When Koyomi calls her from his shadows while falsely telling her he has golden chocolate donuts, she gets angry at the lie and tries to attack him in a comedic fashion. He catches her in a hug, which she finds pleasant and quickly calms down. After she realizes the severity of Koyomi's vampire situation, they contact Yotsugi Ononoki and Yozuru Kagenui to help them. Tensions between Shinobu and the pairing still seem to be in mostly bad terms, as she still threatens them and bluffs about being able to win a fight. They tell the two that they have to stop relying on vampire powers in order to keep Koyomi alive, otherwise he'll turn into a full one and not be able to live life as a human anymore.\nLater when Koyomi and Yotsugi are about to initiate their plan to take Suruga and his sisters back from Tadatsuru Teori, Shinobu explains that she doesn't necessarily mind if he were to become a full vampire herself, so if he's in a dangerous situation, she'd risk making him use vampire powers in order to survive.\nMayoi Hell\nThis section contains content from Owarimonogatari.Due to Koyomi being killed by Gaen, Shinobu's vampire form is fully restored. She then threatens to kill Gaen if her plan to revive Koyomi fails. Upon Koyomi's resurrection later on, she warmly greets him with a headpat.\nOugi Dark\nThis section contains content from Owarimonogatari.Shinobu is seen playing with Gaen, Mayoi, and Yotsugi as they wait for Koyomi to show up to discuss what to do about Ougi. In her adult form, she enjoys picking on Yotsugi in revenge for her comments during their previous encounters. During the meeting, she affectionately holds Koyomi, to his embarrassment, and they both learn about the reasons behind Gaen's actions and the consequences of the supernatural events that have occurred.\nAfter Koyomi resolves the conflict with Ougi Oshino, she meets up with Koyomi and requests Gaen to return her to her 8-year old form bonded to Koyomi's shadow. Koyomi renews his vow that he will die with her, and this time Shinobu responds with her own; if he were to die, she would live for three days to tell someone about him before killing herself. The bond between the two is then restored, but this time not as a punishment or compromise. Shinobu continues to live inside Koyomi`s shadow after he graduates from high school. \nKoyomi Reverse\nAfter Koyomi is sent into the mirror world, he calls out for help from Shinobu only to no avail. He is then later brought by Ononoki to see the mirror world version of Shinobu. This Shinobu is a human who lives hidden behind a curtain inside a castle where Eikou Cram School is supposed to be, as a way to protect others from committing suicide because of her immense beauty told in the \"Princess Beauty\" story. Shinobu advises Koyomi on his situation and apologies for not being able to help him return back to the real world. Koyomi is then forced to depart with Ononoki to protect him from Shinobu`s beautiful presence. \nNadeko Draw\n\nShinobu Mustard\n\nKaren Ogre\nShinobu occupies Karen's shadow as she traverses Oniai Mountain, Senshin Peak and Kachi-kachi Mountain. Shinobu repeatedly appears to save Karen from danger, each time appearing as a different age. Shinobu tells Karen that each different version of herself members of a foreign extended family, and Karen believes her. With Shinobu's assistance, including lending her Kokorowatari and saving her from falling to death, Karen is able achieve her goal of reaching Ouga Falls.\nCatchphrases / Running Gags\n\"Ka ka!\"\n\"Panaino!\"\nTrivia\nShinobu's original human name of Laura was written as Rola, Lola, or Lora in previous unofficial English translations of the series.\nShinobu always labels herself as around 500 years old; her actual age is 598.\nShinobu's former nickname as Kiss-shot was The Iron-blooded, Hot-blooded, Cold-blooded Vampire (鉄血にして熱血にして冷血の吸血鬼, Tekketsu ni shite Nekketsu ni shite Reiketsu no Kyūketsuki). This kind of title is also seen in the case of Deathtopia Virtuoso Suicide-Master.\nIn the first trailer of the Kizumonogatari movie, the name of the voice actor who will play as Shinobu is shown only as \"××××\". Although Shinobu's voice actress in the Bakemonogatari drama CD is Aya Hirano, Maaya Sakamoto took the role of Shinobu in the Nisemonogatari anime series.\nHer current voice actress, Maaya Sakamoto, refuses to sing character songs. This is why the anime adaptations of the Shinobu Time and Shinobu Mail arcs have unique themes with opera style singing instead of vocal song openings.\nExclusive to the novels, Shinobu has a Nintendo DS she uses when she's in Koyomi's shadow. She made it herself through matter generation, likely basing it off the DS he was borrowing from Nadeko.\nShinobu in the manga adaptation demonstrates her vampire abilities more often, including shapeshifting demonic black armor on herself for combat, using her matter generation to construct a whole castle, and summoning a colossal dragon-like creature to ride on during the Kizumonogatari arc. Since the manga has its own distinct canon, it is unknown if the light novel or anime versions of Shinobu also have these abilities.\nHer appearance on the cover of Wazamonogatari bares a striking resemblance to her 10 year old form in Kizumonogatari. Assuming the cover is supposed to be her in the first arc of the book, this form could represent her original appearance as a human. Otherwise, the cover could be referring to Karen Ogre instead.\nAppears In\n\nMain Series\nBakemonogatari\nKizumonogatari\nNisemonogatari\nNekomonogatari\nKabukimonogatari\nOtorimonogatari\nOnimonogatari\nTsukimonogatari\nKoyomimonogatari\nOwarimonogatari\nZoku Owarimonogatari\nWazamonogatari\nMusubimonogatari\nShinobumonogatari\nYoimonogatari\nAmarimonogatari\nOugimonogatari\nShinomonogatari\nIkusamonogatari\nShort Stories\nNisemonogatari Anime Complete Guidebook\nYomiuri Shimbun/Onimonogatari BD/DVD vol. 1\nNisemonogatari Premium Item Box\nAnime Monogatari Series Heroine Book 3: Shinobu\nManga\nBakemonogatari (manga)\nOther\nBakemonogatari Portable\nOkitegami Kyouko no Bibouroku x Monogatari\nWazamonogatari (game)\nKizumonogatari VR\nMagia Record\nGallery\nThe cover of Kizumonogatari featuring the first depiction of Shinobu.Cover of Onimonogatari.Cover of WazamonogatariAdult Kiss shot on the cover of the English edition of Kizumonogatari.Cover of Shinobumonogatari.On the cover of the English version of Onimonogatari.Cover of Koyomimonogatari English Volume 2.On the cover of the English version of Owarimonogatari Vol 2.On the cover of Shinomonogatari Volume 1.Bakemonogatari (manga) Volume 5 Special Edition CoverManga Volume 7 coverManga Volume 7 Special Edition CoverManga Volume 9 CoverManga Volume 9 Special Edition CoverManga Volume 12 Special Edition CoverManga Volume 13 Special Edition CoverBakemonogatari Volume 21 Alternative CoverPromotional Art for the first Kizumonogatari filmPromotional poster for the first Kizumonogatari filmPromotional poster for the second Kizmonogatari filmKey visual for the third Kizumonogatari film.Shinobu in Bakemonogatari.Key art for Monogatari Series Off & Monster SeasonIn Nisemonogatari.Teenage form.In Nekomonogatari BlackA Powerpuff Girl Shinobu, as shown in Nekomonogatari Black Episode 02Kiss shot in KabukimonogatariShinobu in Tsukimonogatari.Shinobu in Owarimonogatari.Shinobu in a school uniform in Koyomimonogatari.Adult Kiss shot in Kizumonogatari.Young Kiss shot in the Kizumonogatari films.Preteen Kiss shot in the second Kizumonogatari' film.Teen Kiss shot in the second film.Adult Kiss shot in the third film.Kiss shot after having her power drainedKiss shot in her 8 year old \"Shinobu\" form.Princess Beauty form in Zoku Owarimonogatari.Kiss-shot's true form in the manga adaptationManga Kiss-shot's seventeen-year old formManga Kiss-shot with horns made of hairManga Kiss-shot's vampire powersKiss-shot in the manga wearing black armorManga Kiss-shot from hundreds of years ago\"Princess Beauty\" anime designAll of Kiss-shot's forms in the Kizumonogatari movie trilogy\nReferences\n↑ CV reference\nNavigation\nv • e Characters of the Monogatari Series\nAraragi Family\nKoyomi Araragi • Karen Araragi • Tsukihi Araragi • Araragi Matriarch\nHeroines\nHitagi Senjougahara • Mayoi Hachikuji • Suruga Kanbaru • Nadeko Sengoku • Tsubasa Hanekawa/Black Hanekawa • Shinobu Oshino • Sodachi Oikura • Ougi Oshino\nOddity Specialists\nMeme Oshino • Deishuu Kaiki • Yozuru Kagenui • Yotsugi Ononoki • Izuko Gaen • Tadatsuru Teori • Seishirou Shishirui\nHearsay Police Department\nZenka Suo • Nozomi Kizashima • Mitome Saisaki • Tsuzura Kouga\nVampire Hunters\nDramaturgy • Episode • Guillotine Cutter\nOther Characters\nHitagi's Father • Hitagi's Mother • Tsunade • Mayoi's Father • Tooe Gaen • Suruga's Father • Suruga's Grandmother • Nadeko's Parents • Tsubasa's Parents • Mizudori • Rousokuzawa • Seiu Higasa • Rouka Numachi • Sasayabu • Komichi Tetsujou • Deathtopia Virtuoso Suicide-Master • Tropicalesque Home-A-Wave Dog-Strings"
}