{
  "requested_name": "Tohru",
  "resolved_title": "Tohru",
  "url": "https://miss-kobayashis-dragon-maid.fandom.com/en/wiki/Tohru",
  "summary": "Tohru (トール, Tōru) also known as Tohru Kobayashi (小林トール Kobayashi Tōru) is one of the main characters in the series Miss Kobayashi's Dragon Maid.",
  "full_text": "Tohru\nTohru (トール, Tōru) also known as Tohru Kobayashi (小林トール Kobayashi Tōru) is one of the main characters in the series Miss Kobayashi's Dragon Maid.\nTohru is a female dragon with the ability to transform into a human girl. After Kobayashi rescues her, she falls in love with her and decides to work for her as a maid. She is the daughter of Damocles.\nAppearance\n \nIn her human form, Tohru is a beautiful girl with long blonde hair with flaming orange tips and red-orange eyes with dilated pupils, and a buxom figure with large thighs and large breasts, claiming to be a D-cup (for dragon size). She magically transforms her scales into a maid outfit, copying the uniform from a maid cosplay café (Maid Café Cozy) after flying to Kobayashi's apartment the first time.\nWhile in the private comfort of Kobayashi's apartment, Tohru wears her tail out, and on occasion, her wings. Outside, she hides both her tail and wings but retains her horns. Anyone who notices usually chalks it up to a form of cosplay. She also has a very long tongue but she barely shows it.\n \n \nTohru's dragon form appears as a big green European dragon with black wings and a light green underbelly. The height of her dragon form towers over Kobayashi's old apartment that's four stories high.\nIn the anime, Tohru's hair is given an extra shade of pink and purple at the tips.\nHer height is 176cm while in human form and 15-20m as a dragon and her measurements are B95/W70/H75.\nPersonality\nAs a Chaos Dragon, Tohru was raised to hate humans and was supposed to be a fierce and dangerous force of evil with nothing other than destruction in mind. However, this all changed when she met Kobayashi. She is now cheerful and kind to every human she meets, except for those who are a real, or as it is in most cases, imaginary, threat to her love interest in Kobayashi. She is also quickly influenced by what she sees on the television or the Internet, and shares a fiery relationship with her rival, Elma.\nAs Kobayashi's maid, Tohru is a hard worker and cares deeply for the household, tending to all aspects of daily life, although this will often lead to trouble such as when Tohru tries to feed her tail to Kobayashi, or molests Kobayashi's dirty laundry. Even still, Kobayashi always shows her appreciation for Tohru's efforts, and does her best to guide Tohru in the ways of modern life and human culture on Earth. Tohru is very protective of Kanna, and is essentially her mother figure and big sister combined.\nHaving been accepted by Kobayashi even in her dragon form, Tohru quickly fell deeply in love with her. Even faced with Kobayashi's stoic character and often unrequited advances, Tohru never fails to make her unending love for Kobayashi known. Tohru's equally strong sexual attraction to Kobayashi often drives her to trickery, such as making a chocolate heart with a love potion secretly added, or finding different ways to make Kobayashi eat her tail.\nOverall, Tohru is warm, loving and responsible. Although she retains much of her dragon-like powers and strength, she is more than happy with her life on Earth, and loves Kobayashi so much that she would rather stay and inevitably outlive her rather than return to her homeworld.\nBackground\n \nHundreds of years ago, Tohru was raised to believe that humans were evil, inferior and foolish beings, which explains her initial distaste towards the human race and her alignment with the Chaos Faction. She was heavily injured by a god leading a human army in her last battle, forcing her to retreat to the modern world to hide where she meets Kobayashi, who drunkenly rescues her from the verge of death. On that same day, she falls in love with Kobayashi and takes her up on her offer to live with her as her maid.\nPowers and Abilities\n \nOverall abilities: Tohru claims that she is one of the more powerful dragons capable of bringing about the Armageddon. She appears to be capable of opening portals to other worlds or dimensions with ease, a rare ability seeing as both Kanna and Elma, despite the latter being equal to Tohru in terms of power, do not possess this particular skill. Lucoa, a former deity, has this ability as well, after implying that she frequently travels between the two worlds to check up on Tohru. Her tail is apparently poisonous, but seemingly not to either her or other dragons in general. Throughout the season, Tohru is shown to have control over the fire \"element\", unleashing a burst of flame enough to sweep away clouds. Unlike Kanna, who summons her energy through her hands, Tohru breathes fire from her mouth. Tohru’s fire can come out in a variety of ways, a large blast of flame, to an incinerating beam, to a small burst of pure destructive energy that destroys anything Tohru wants to get destroyed. Tohru is shown strong enough to compete with fellow dragons Fafnir, Quetzalcoatl, and Kanna in a destructive all-out game of dodgeball (all dragons eventually tired one another out, ending the game/fight in a draw). Elma states she is as strong as Tohru - with Kanna noting the last time the two dragons fought, three islands disappeared. Tohru was shown to be able to compete with her father, Damocles, in their battle.\nThroughout the manga and anime, Tohru has displayed several powers and abilities:\nImmense Strength: As a Dragon, Tohru possesses immense physical strength. A single punch from her was enough to leave a crater after striking a purse-snatcher. She is shown to even grapple with Kanna and Elma.\nImmense Health: Tohru states as a dragon, she never gets sick or unhealthy.\nImmense Speed: Tohru used super speed to catch up to a purse snatcher while shopping with Kobayashi.\nImmense Reflexes: During her fight with Elma in Episode 21, Tohru manages to match Elma's extremely fast barrage of punches blow for blow.\nRegeneration: Tohru can regenerate her tail after she cuts it off in an attempt to feed Kobayashi her tail meat.\nImmense Durability: She survives for a while after being hit with a sword from one of the gods of her homeworld, albeit she would've died had Kobayashi not saved her. Tohru also suffers no major wounds after her battle in Episode 21 with Elma, who is equal in strength to Tohru.\nUnlimited Stamina: Dragons do not require sleep to function, with Tohru only getting sleepy during the cold season. Tohru also states that back in her homeworld, she often had to continuously fight without sleep for many years.\nShapeshifting: Among all dragons so far, Tohru and co. can shapeshift as humans with any outfit of their choice. While her tail and horns are mostly visible, this is purely by her choice.\nFire Breath: Tohru's primary method of attack. She breathes fire. Her fire breath has been shown to be strong enough to sweep clouds away with ease. Her fire can be unleashed in a variety of ways including a large blast of flame, an incinerating beam, and even a small burst of pure destructive energy.\nFlight: As a Dragon, Tohru can use her wings to fly. She can also use magic to propel herself through the air in her human form, as seen during her battle with Elma in Episode 21.\nSharp Teeth: As a Dragon, Tohru possesses razor-sharp teeth.\nSharp Claws: As a Dragon, Tohru possesses razor-sharp claws.\nCleansing Saliva: Tohru states she produces saliva that can remove stains and grime.\nPortal Opening: A rare skill that allows Tohru to open portals to other worlds or dimensions with ease.\nPoison: Tohru's tail is apparently poisonous. Though she is shown to be immune to it whenever she ingests her tail.\nClairvoyance: Tohru can use this power to see through objects. She mostly uses it to check the pockets of Miss Kobayashi's clothes when doing laundry.\nPerception Blocking: This power allows Tohru to render herself or others invisible.\nRelationships\n\nKobayashi\nTohru is deeply in love with Kobayashi. She does her best to serve Kobayashi as her maid every day and hopes that someday they'll share feelings. Throughout the story, she attempts feeding Kobayashi her tail (without success) after detoxifying it.\nIt is confirmed that Kobayashi has begun to return Tohru's feelings of a more romantic nature.\nElma\nTohru and Elma were once friends but had a falling out when Tohru became disgusted by Elma's gluttony - which enabled her worshippers to easily bribe her with food - and destroyed a temple dedicated to her. Following this event, they became fierce rivals until Kobayashi was able to broker a truce. In Elma's wedding arc, it was shown that Tohru has feelings for her.\nKanna Kamui\nTohru and Kanna get along pretty well since they have known each other for a long time. Tohru even teaches Kanna about the human world and Tohru is something like an (adopted) older sister to Kanna.\nTakiya Makoto\nTohru at first disliked Takiya after initially suspecting him of being attracted to Kobayashi. She puts up with him for Kobayashi's sake, seeing as he means well as a friend and colleague. Her opinion of Takiya changes after seeing how he was able to get along with Fafnir after initially recommending that he let Fafnir stay with him.\nLucoa\nLucoa is one of Tohru's old friends and as such, cares about her. Before taking residence in the human world, she goes out of her way to travel between worlds to check up on Tohru, often dropping by Kobayashi's apartment to visit.\nFafnir\nTohru and Fafnir are comrades in their world, both being fellow Chaos dragons. They first met fighting each other for cave territory. Tohru is aware of Fafnir's distrust of humans, especially his eagerness to question Tohru's relationship with Kobayashi. However, Tohru manages to convince Fafnir to get along with humans after he made the decision to live in the human world.\nDamocles\nTohru's relationship with her father is strained because of the way she now chooses to live as Kobayashi's maid. He hates humans and attempts to reclaim her and bring her back to the reality they had come from, to the point where they both fight in their dragon forms; despite this, he takes a human form while in the human world. She objects to his wishes after Kobayashi stands up for her, causing him to call her foolish, stupid, and insolent.\nIlulu\nTohru and Ilulu are both Chaos dragons; however, not much is known about their relationship prior to either of them appearing in the human world. Tohru initially had to fight Ilulu and banish her from the human world as she attempted to destroy it. After Kobayashi took Ilulu in, Tohru's relationship with Ilulu continued to be strained, with both competing for Kobayashi's affection at times. Tohru was especially disapproving of Ilulu's freeloading attitude after being taken in, that she accompanied Ilulu to find a job in the human world. After this, both dragons have a more amicable relationship.\nBandit Girl\nShe is the last human Tohru communicates with, before the latter's suicide mission against the gods of her world. Tohru claims that her encounter with Bandit Girl inspired her to serve as Kobayashi's maid, and she would not mind seeing Bandit Girl again.\nTrivia\n \nTohru’s name was translated to « Thor » in the French translations of the manga and anime.\nKobayashi assumes Tohru is named for Thor, Norse god of thunder. Tohru herself states that she was named for a real-world author, likely to be J.R.R. Tolkien (Japanese: トールキン).\nDespite stating that her maid outfit is made of her scales they can be removed like normal clothes rendering her naked. As seen in chapter 4 when Kobayashi simply took off Tohru's clothes when the prior was drunk.\nAt the end of chapter 4 Tohru reveals that she'll change her outfit based off of Kobayashi's judgement. In the chapter Tohru changed into a Victorian-style maid outfit.\nIn chapter 1 Tohru reveals that she hates eggs that lack a yolk stating that Herensuge was killed by it.\nAt the end of chapter 1 in a little sketch, Tohru says her tail tastes \"sweet and creamy\".\nSince she was a member of the Chaos Faction, she disliked humans, but she did have a human friend in the dragon world.\nTohru is considered as the only Maid-Dragon in the series, since Lucoa is considered as a guardian of Shota.\nIn chapter 9 of the Kana spin off it is shown that Tohru and Kobayashi sleep together.\nTohru has a collection of sexy photos of Kobayashi that she has taken herself and that she uses for her \"solo enjoyment\".\nTohru also has feelings for Elma, even proposing bigamy, although Elma rejected this proposal despite also having feelings for her.\nIn chapter 124, she showed that she is no longer only jealous of Kobayashi, when a new dragon appeared she asked her if she was after Kobayashi or Elma, showing that she cares about both of them.\nTohru also wants to eat \" Kobayashi's tail \" as shown on the cover of the chapter 132.\nShe is ticklish on the soles of her bare feet.\nIn chapter 127, it is revealed that Tohru is rank 22 in the Chaos faction.\nReferences\n↑ Miss Kobayashi's Dragon Maid Official Guidebook: Dragon Maid Encyclopedia, see Image\n↑ No dragon birthdays are given in the official guidebook, only birthdays for human characters.\n↑ Episode 1\n↑ Chapter 48\n↑ chapter 100\n↑ Chapter 110"
}