{
  "requested_name": "Yoruichi Shihōin",
  "resolved_title": "Yoruichi Shihōin",
  "url": "https://bleach.fandom.com/en/wiki/Yoruichi_Shihōin",
  "summary": "\"People discover their true, inner powers when they want to protect something. Their own lives, status, honor, loved ones, a principle... a fierce desire to protect is the key.\"",
  "full_text": "Yoruichi Shihōin\n\"People discover their true, inner powers when they want to protect something. Their own lives, status, honor, loved ones, a principle... a fierce desire to protect is the key.\"\n— Yoruichi Shihōin in THE BLADE AND ME\nOverview\nAnime Continuity\nImage Gallery\nBattles & Events\nYoruichi Shihōin (四楓院 夜一, Shihōin Yoru'ichi) is the former (22nd) head of the Shihōin Clan, one of Soul Society's four great noble houses. She also served as captain of the 2nd Division of the Gotei 13 (with Marenoshin Ōmaeda as her lieutenant) and as commander of the Onmitsukidō. Since defecting from Soul Society and thus forfeiting her leadership positions around 101 years ago, Yoruichi has come to work alongside Kisuke Urahara and Tessai Tsukabishi, based in the Urahara Shop out in the Human World.\nAppearance\nYoruichi Shihōin is a slender yet athletically fit woman of curvaceous frame and average height. She has dark skin, golden irises, and black hair. Her hair is waist-length and kept in a ponytail with chin-length bangs framing the sides of her face. Her standard attire consists of a black, backless, sleeveless undershirt, an orange over-shirt with two white straps on each shoulder, a large beige sash around her waist, and black stretch pants with a pair of lightweight brown shoes, which allow for stealth and easy use of Shunpo. She previously wore a beige neck warmer, which she pulled up to cover her face in order to hide her identity, but seems to have forgone its use. She occasionally wears long beige wrist and leg warmers, each secured by bands. During the Quincy Blood War, Yoruichi wears a short orange dress with a leotard underneath, arm warmers and thigh-length boots, all in black.\nUnlike any other known Shinigami, she can transform into a small black cat for long periods of time. In this form, she has a distinctive male voice and golden eyes.\n110 years ago, during her time as a captain, she wore the same sleeveless and backless Onmitsukidō uniform, with long black wrist guards which Suì-Fēng wears now, but had a black ribbon tied around her neck. She wore a long-sleeved captain's haori. Her hair was much shorter, cut in a style similar to Suì-Fēng's current hairstyle, but without the braids. At some point prior to this, she wore the white Onmitsukidō uniform of the correction corps.\nPersonality\nYoruichi is intelligent and witty, holding an intimate knowledge of Soul Society and its workings, as she was the former leader of the Onmitsukidō and the Second Division's captain. Although of noble birth, she acts differently from most other nobles, very much like Kaien Shiba. For instance, she instructed Suì-Fēng to refer to her without using honorific suffixes, but reluctantly settled for being called \"Yoruichi-sama\". On several occasions, she transforms into her Human form directly in front of Ichigo just to see his reaction to seeing her naked, which she teases him about. In addition, she speaks in a dialect used by elders in the Japanese script, such as identifying herself as \"washi\" (儂; a term usually used by old men to define themselves with), instead of more feminine terms like \"watashi\", in both her Human and animal forms. When directly speaking to others with the \"you\" pronoun, she uses the archaic \"onushi\" (お主).\nWhile it is unknown how she obtained her cat transformation, she appears to prefer spending most of her time in it. Upon showing her Shinigami form to Ichigo, she forgot to put on clothes, as she had grown used to not needing them; due to being in cat form for so long. She especially takes delight in transforming in front of people to see their shocked reaction, due to her cat form making her sound male. Her love for her cat form extends to great anger should someone harm it or insult its appearance, as seen from how upset she got after her tail was damaged.\nAlthough relatively calm and mature when a situation calls for it, Yoruichi is quite laid-back and playful, often teasing or flirting with those younger than her, such as Ichigo Kurosaki at the underground hot spring, a younger and hot-headed Byakuya Kuchiki, Suì-Fēng before her time as a captain, and Kisuke Urahara, childhood friend, former underling, and fellow ex-captain. Yoruichi prefers to drink milk, which fits with her practice of transforming into a cat.\nHistory\n \nYoruichi Shihōin was born a \"Princess\" (姫君, Himegimi; alt. transl. as \"Lady\") of the Shihōin Clan, the so-called Tenshi Heisōban (天賜兵装番, Guard of the Heavenly Gifted Armaments; Viz \"Defender of the Realm\") and one of the Four Great Noble Families of Soul Society. Yoruichi grew up at the Shihōin Mansion in the Seireitei with her childhood friends Kisuke Urahara and Tessai Tsukabishi. During this time, they played together daily under the Sōkyoku hill training space, which Urahara built when they were children.\n \nLater, Yoruichi became the Corps Commander of the Executive Militia of the Onmitsukidō while serving as the 22nd Head (当主, Tōshu) of the Shihōin Clan, becoming the first woman to ever hold the position. Some time later, she would serve as Commander-in-Chief of the Onmitsukidō, as the position is traditionally held by the heads of the Shihōin Clan. She eventually rose to the position of captain of the 2nd Division of the Gotei 13, further uniting the formerly separate military arms together, as this was also traditionally done by her family.\n \nSome time later, she decided to change her role in the Onmitsukidō from being the Corps Commander of the Executive Militia, which is the position traditionally held by the Commander-in-Chief, to being the Corps Commander of the Corrections Corps. While Yoruichi was Onmitsukidō Commander, she took in Suì-Fēng as a personal bodyguard. Recognizing her talent, she became a mentor and friend. She taught Suì-Fēng most of the techniques she knew. During her time in Soul Society, she created many techniques which involved Shunpo, and taught some of them to Byakuya.\n \nAbout 110 years ago, Yoruichi recommended that Kisuke Urahara, her 3rd Seat, be appointed to the recently opened position of Captain of the 12th Division after the former captain, Kirio Hikifune, was promoted. Prior to presenting Urahara with the news of the open position, Yoruichi had a sparring session with him at the Sōkyoku Hill training space. Before retiring to the 2nd Division barracks, Yoruichi informed Urahara she had recommended him for the position. Suì-Fēng confronted Yoruichi, concerned that she was overestimating Urahara's capabilities, and proceeded to explain she believed it had been a mistake to appoint him as Corps Commander of the Detention Unit. Suì-Fēng continued by stating he was undeserving of such a position. While Yoruichi readily admitted that Urahara was not really a hard worker, she dismissed Suì-Fēng's criticisms, playfully insinuating that her focus on him must have romantic connotations, which Suì-Fēng denied.\n \nAfter spending the day following Urahara around Soul Society taking notes, Suì-Fēng returned to the 2nd Division barracks to show Yoruichi her evidence of Urahara's lack of competence in his position, only to find Urahara already there talking with Yoruichi. Suì-Fēng is told Urahara would be taking the captain proficiency exam, to which she stands in disbelief. Yoruichi, confirming it, further requested Suì-Fēng attend the exam as well. She explains that normally only captains are allowed to attend, but she had asked special permission to allow Suì-Fēng to attend. Suì-Fēng was at first confused about why she should attend, but Yoruichi told her there was no need to keep secrets, as she knew she was attracted to Urahara, which Suì-Fēng again denied. Yoruichi explained she knew all about how Suì-Fēng had been following Urahara around all day.\n \nSuì-Fēng admitted she was following Urahara around, but stated it was to prove he was lazy, incompetent, and unworthy of Yoruichi's praise. Suì-Fēng handed her notes to Yoruichi, who, reading them, commented on how detailed they were. When Urahara didn't deny any of the information in the report, Suì-Fēng was shocked he would be so honest about his seemingly unprofessional actions. An unsurprised Yoruichi, stating Urahara never changes, praised Suì-Fēng for her intelligence gathering skills. Suì-Fēng, happy at first, realized Yoruichi regarded the notes not as intelligence information, but rather as a love letter.\n \nSuì-Fēng was reasonably distressed, and Yoruichi, laughing it off, told her to loosen up, as she wasn't serious. They were interrupted by the arrival of a squad member, who delivered a message that the people Urahara had been looking for had been found. Suì-Fēng replied that if he didn't return in time, it would put a strain on the 2nd Division's reputation and Yoruichi's. Yoruichi, dismissing this, told Urahara to hurry off to his duty, and told Suì-Fēng to help prepare for Urahara's Captain's Proficiency Test. Yoruichi was present with the other captains awaiting the start of the ceremony. Upon Urahara's arrival to the 1st Division barracks, where he was formerly introduced to the other captains, he was chastised by Yoruichi for being so reluctant. She told him he was already a captain, so he should stand tall.\n \nA day or so after Urahara took over the 12th Division, Yoruichi was told by an Onmitsukidō member that Urahara had entered the Detention Unit property, claiming he had been given approval to go. Yoruichi couldn't recall when or even if he asked for permission or whether she granted it, but when asked if she wanted him removed, she nonchalantly told her division members not to bother and to allow him to go where he liked. When asked if she remembered the incident in question, Yoruichi plainly said no. Suì-Fēng, becoming distressed, prepared to voice her disapproval, but Yoruichi told her to calm down, as it was Kisuke they were talking about, stating he must have had an idea of some kind.\n \nYoruichi appeared to be on good terms with the members of the Kuchiki noble Clan as she would often visit the Kuchiki Manor to play tag with a teenage Byakuya Kuchiki. On one such occasion, she was asked to train Byakuya by his grandfather Ginrei Kuchiki, the Head of the Kuchiki Clan and the 6th Division captain. Upon seeing the arrival of Yoruichi, Byakuya swung his sword at her, calling her a were-cat. Yoruichi, laughing, began to playfully tease him, calling him \"Little Byakuya\". She complained about receiving such a greeting after coming all the way there to see him. Byakuya yelled at her, saying he didn't want to see the likes of her, and he would be the head of the Kuchiki Clan soon enough, so he had no time to waste on her. While asking if that was the case, she stole the ribbon holding his hair back. Byakuya, quickly turning, swung his sword at her, but she easily dodged it.\n \nYoruichi, laughing at him, exclaimed that if the head of the Kuchiki Clan could get his hair-tie stolen by a girl who is just playing, then the future of the Kuchiki Clan had become bleak, though this was just a ploy to entice him into another game of tag. Not to be defeated so easily, Byakuya told her not to move an inch, but before he could finish, she, telling him he couldn't catch her, used Shunpo to begin the chase. Byakuya stated he could see she wished to incite his wrath, and he promised to make her see the error of her ways, further claiming his Shunpo was far superior to hers.\n \n9 years later, Yoruichi attended an emergency meeting of the captains of the Gotei 13, where the Captain-Commander was giving an intelligence report on the disappearances of the 9th Division Captain Kensei Muguruma, Lieutenant Mashiro Kuna, and the other high-ranking members of their division, stating they had previously been sent out to investigate the disappearance of other division members, and declaring he will choose 5 captains to form an investigation team. When a very winded and frantic Urahara showed up to ask that he be allowed to go with the investigation team, as he had previously sent his Lieutenant Hiyori Sarugaki to the site of the disappearances, he was summarily told no by Captain-Commander Yamamoto. When he protested, he was chastised by Yoruichi, who told him he was acting pathetic and that he should get a grip on himself. She further stated he sent Hiyori himself, and for him to lose his composure like that only insulted her. The Captain-Commander continued naming the members of the investigation team, telling Yoruichi she was to standby for further orders.\n \nThe next day, Urahara and Tessai were arrested under the orders of the Central 46. It immediately became evident they had been set up by Aizen, but were given no right to defend themselves and prove their innocence. As a result, they were quickly given their sentences. For \"committing crimes against researching and invoking forbidden phenomenon\" and \"deceiving and inflicting grievous injury to fellow Shinigami\", Urahara was sentenced to become Human and to be exiled to the Human World. For \"using forbidden Kidō techniques\", Tessai was sentenced to life imprisonment in a Level 3 detention area. Before either of their sentences could be executed, a masked Yoruichi, entering the building, knocked the guards unconscious and rescuing the disgraced former captains, bringing them to a secret underground area.\n \nIn this secluded area, she expounded how mad she was at them for excluding her from their plan. She revealed she had brought the eight Hollowfied Shinigami and the prototype Gigai Urahara was working on. With that epiphany, Urahara resolved to make ten Reiatsu-blocking Gigai to aid him and Tessai. Tessai stated his fear about Yoruichi's safety, but she calmly stated they should not worry about her, as she would escape somehow.\nWhen she left Soul Society, she left behind her titles and positions, and was thus relieved of her high status. She was succeeded as 2nd Division Captain and Commander of the Onmitsukidō by her protégé, Suì-Fēng, at a later date.\nPlot\n\nAgent of the Shinigami arc\n \nYoruichi arrives in Karakura Town in feline form, where Tessai Tsukabishi reveals to Jinta Hanakari she is Kisuke Urahara's best friend. Later, Yoruichi sits outside of Urahara's shop looking at the sky. When Urahara comes out and asks her what she is looking at, Yoruichi talks out loud in a male voice, telling him to stop acting, as he knows full well that \"they\" have already come. After Rukia Kuchiki is taken back to Soul Society, Ichigo begins training with Urahara to regain his Shinigami powers. At the same time, Yoruichi offers to train Orihime Inoue and Yasutora Sado in the use of their powers, warning them his lessons are strict and difficult. They readily accept.\nYoruichi, Orihime and Sado try to recruit Uryū.\nThey track down Uryū Ishida, who is somewhat surprised to see them. Orihime explains they must engage in training lessons if they are to go to Soul Society, to which Uryū asks who their master will be. Orihime tells him, knowing he will be skeptical, their trainer has been standing next to him the entire time. Uryū is surprised, explaining that there can't be a Human that stealthy. Yoruichi speaks up, telling Uryū it is she who will be training them. Uryū predictably freaks out at the notion of a talking cat. After regaining his composure over the issue, Uryū calmly states he can't believe there is such a thing as a talking cat. Yoruichi tells him the issue is not about him, but about the necessary training in order to save Rukia from Soul Society. Though coming around to the idea, Uryū declines to train with them, as he has plans to train on his own, and, rather than saving Rukia, he just wishes revenge on the Shinigami who previously defeated him. Yoruichi resolves that he has no desire to go to Soul Society, and that they must go and train before it is too late.\n \nYoruichi proceeds to train Chad and Orihime in an abandoned warehouse, but they can't call on their powers. Yoruichi exclaims that at this rate, no matter how long they train, they can't go to Soul Society. She states that if they can't find their powers and freely call upon them, they are as good as dead in Soul Society. Urging them both to remember the first time their powers manifested, she reaches the conclusion that their powers were activated when they were put in a position to protect others. Therefore, in order to activate their powers, they should think back on what they were trying to protect at the time. It is through Yoruichi's words that Orihime comes to understand that she wishes to protect Ichigo; this realization brings forth her powers in the form of the \"Shun Shun Rikka\". Yoruichi tells Orihime that the next thing she must learn is to control her powers, as they are now attacking him. Yoruichi turns his attention to Chad, asking him why he wishes to go to Soul Society. Shortly thereafter, Chad, gaining access to his power, uses its ability to punch a huge hole in the wall, much to Yoruichi's surprise. Both Orihime and Chad are glad to have gained free use of their abilities, thus allowing them to go to Soul Society. Yoruichi tells them they have no time to celebrate, as they just damaged property and need to get out of there before they attract attention.\n \nAs the group prepares to go to Soul Society through Urahara's Senkaimon, Yoruichi decides to act as their guide. Once Urahara explains to them the dangers of using the passage, Yoruichi states only those who know what their hearts think will be able to follow him. When Ichigo states everyone gathered is determined to go, Yoruichi reminds him that if he loses, he will never return. Ichigo is firm in his resolve to win, and Yoruichi applauds his response. It is from this point on Yoruichi acts as a guide through the journey in the Dangai, the space between Soul Society and the Human World.\nSoul Society arc\n \nAfter arriving in Soul Society in an ungainly manner, Yoruichi informs them of the seriousness of the situation, and explains their location and the composition of Soul Society. Ichigo runs towards the Seireitei, but a huge wall blocks his path. Ichigo is stopped by a giant, who Yoruichi says to be the Seireimon Gatekeeper Jidanbō, one of the elites in Soul Society and guardian of the west gate. She tells everyone that it won't be easy to get past the guardian and they should prepare a plan, but she is ignored by Ichigo, Chad, and Orihime. Yoruichi and the others witness Ichigo's unlikely victory over Jidanbō. As per the rules, Jidanbō lets Ichigo and his friends pass through the gate, but is surprised by the unexpected arrival of Gin Ichimaru.\n \nAs Gin cuts off Jidanbō's left arm, Yoruichi realizes her mistake, as she had not foreseen the arrival of a captain. She notes that though Ichigo and his friends are powerful, they are no match for a captain, and if they confront him head on, the worst scenario will come to pass. Before Ichigo can react, he, along with Jidanbō, is pushed out the gate by Gin's Shikai.\nAfter it is determined Ichigo is alright, he apologizes to Yoruichi for allowing the gate to close. Yoruichi says there is no need to blame himself, for if they had made it through the gate, the results would have been the same; he would still have to face Gin, so in turn he should be happy he is alive. The souls who live in the Rukongai come out of their dwellings. Yoruichi explains that anyone who is not guided into Soul Society by a Shinigami is considered an intruder, making Ichigo and his friends troublemakers in the eyes of Soul Society. As such, the souls were hiding because they were afraid. While resting among the citizens of Rukongai, Yoruichi discusses his plan to enter into the Seireitei without using the gate. Yoruichi asks Elder-Dono, the citizen whose house they are occupying, where they can locate Kūkaku Shiba, noting she is a drifter and difficult to find.\n \nYoruichi leads the group into the open area outside of the village, exclaiming that Kūkaku prefers open areas and solitude. Yoruichi tells the group that even though the location of the house changes constantly, the house is always the same style and easy to identify. Not long after, they come upon the house. Before arriving, they are stopped by twin guard/servants Koganehiko and Shiroganehiko, who refuse to allow them to pass. After noticing Yoruichi, however, the twins, allowing them passage, lead them underground into the house. Inside, Kūkaku happily greets Yoruichi, who asks Kūkaku if she can help them. Yoruichi explains the situation and plan to Kūkaku, who agrees to go along.\n \nAfter undergoing the necessary training to use Kūkaku's Fireworks cannon to enter the Seireitei, the group prepares to leave. Ichigo asks if they will have to use the orb technique he learned to get through and if Yoruichi, being a cat, can achieve the same results. Yoruichi, telling him to place the orb on the ground, climbs on top of the orb and creates a seamless barrier, stating this sort of thing is like breathing to him. As Kūkaku prepares to shoot the cannon, the group enters the cannon. While inside, Yoruichi tells them to not wander off by themselves once they reach the Seireitei, and they are to run if they encounter a captain-class enemy, as their objective is to rescue Rukia and not to engage in unnecessary risks.\nThe team succeeds in penetrating the barrier protecting the Seireitei, but the destabilization of the spiritual energy powered cannonball causes them to split. As the team begins to separate, Yoruichi assures Ichigo they will find a way to survive, but he must worry about himself first. The group breaks up in four separate directions, with Yoruichi left all by himself. She maintains this way is probably better. Yoruichi finds herself hurtling toward a group of waiting Shinigami, but she bounces back and onto the top of a nearby building before she can be caught.\n \nRunning around in cat form, Yoruichi, keeping track of the progress of all of the others, rescues Ichigo after his fight with 11th Division Captain Kenpachi Zaraki. She takes Ichigo to a secret underground area, where he recuperates. Ichigo, eventually waking up, thanks Yoruichi for saving his life, but, realizing the urgency of helping their friends, gets up too fast, reopening his wounds. Yoruichi, pushing him back down, assures him they all are fine. Yoruichi tells Ichigo that he needs to rest, and that if it were not for the Hollow mask he wore at his torso, he would have sustained a serious injury. Ichigo, surprised at the broken Hollow mask, explains that he had thrown away the mask previously. Yoruichi, surprised, tells Ichigo he will take it for safe-keeping, but Ichigo states he wants to keep it. Yoruichi, becoming angry, demands he give the mask over to him. Ichigo states he is surprised by how strong Yoruichi must be, running around carrying Ichigo all this time without getting hurt. Yoruichi states it was no real problem once she returned to his original form.\n \nYoruichi recalls she has never shown Ichigo his true form, and does so, revealing himself to be a woman. She quips how she loves transforming into her true form, as it always leaves everyone surprised. Taking out an object, she tells Ichigo she will explain how she carried him there, but before she can proceed, Ichigo, becoming frantic, tells her to put on some clothes. She teases Ichigo about him being so innocent, embarrassing him. She shows him the object she used to get him to the secret underground area. She reveals its function and how to use it, claiming it is a unique item in Soul Society. Ichigo, intrigued by Yoruichi's identity, asks who she really is. Before she can answer, they both sense an intense Reiatsu, which Ichigo identifies as belonging to Byakuya Kuchiki. Ichigo immediately rushes off, explaining to Yoruichi he has to save Ganju Shiba and Hanatarō, as they went off in the direction the Reiatsu is coming from. Ichigo, taking out the artifact, uses it to get to his friends faster. Yoruichi, annoyed, tries to stop him, but he runs off anyway. She follows on foot.\n \nIchigo engages in battle with Byakuya, and Yoruichi arrives just in time to stop the release of Senbonzakura's Shikai. Byakuya notes she is the former Commander-in-Chief of the Onmitsukidō, and the former Corps Commander of the Correction Corps. Byakuya states it's been a hundred years since her disappearance, and that everyone thought she was dead. Yoruichi, rushing towards Ichigo, impales his bandaged chest wound with her hand, causing him to pass out.\n \nUkitake speculates that Yoruichi inserted a strong tranquilizer directly into Ichigo's body in an attempt to save him. When Byakuya states she won't be able to get away so easily, Yoruichi says he is talking big, asking him if he ever won even one game of tag against her. The two engage in a test of speed using Shunpo, Yoruichi managing to stay a step ahead of Byakuya despite carrying an unconscious Ichigo. Yoruichi perches upon Byakuya's outstretched arm. She states he can't catch her with that level of Shunpo, and quickly moves to the top of a nearby building. She yells down to Byakuya that in three days, she will make Ichigo stronger than him, and until then, the fight between the two will be on hold. As she uses Shunpo to leave, she tells Byakuya he can follow her if he chooses, but the \"Goddess of Flash\" will not be caught so easily.\nWhen Yoruichi finally gets Ichigo back to the secret underground area, she, looking down at him, tells him to wake up, stating he can get stronger, and that when he wakes up, she will tell him about Zangetsu's real power.\n \nWhen Ichigo awakens, Yoruichi tells him they have no time to wait for his wounds to heal completely, so his wounds will hurt quite a bit. Before she can go, Ichigo asks her why he was the only one she brought back. He expresses his rage, stating he is the only one back there who could have survived. Yoruichi calmly tells him not to think so highly of himself, for no one there, not even Ichigo, would have survived a fight against Byakuya. She adds that to remain able to outrun Byakuya, one person is all she could carry. Yoruichi states she brought him back because, with some training, it may become possible for Ichigo to defeat Byakuya. Yoruichi tells Ichigo that aside from Byakuya, Ukitake was also there; even though Ganju is an intruder and Hanatarō is a traitor, Ukitake will not let them die because they were trying to save Rukia, who is one of his subordinates. She further assures him not to worry because in three days, she will make him strong enough to defeat Byakuya and save everyone.\n \nBefore they begin training, Yoruichi explains that all Zanpakutō have two levels of release: the first one is called Shikai (initial release), and the second is Bankai (final release), and one must achieve both to become a captain. She adds that every captain in the Gotei 13, with the exception of Kenpachi Zaraki, can release Bankai. Moving on, Yoruichi explains to Ichigo that the power and forms of Shikai and Bankai are dependent on the Zanpakutō. They vary according to the wielder's strength and training, but in general, by learning Bankai, one's power can grow 5 to 10 times greater. She explains that even the most gifted Shinigami need at least 10 years of training to master Bankai. Ichigo tells her that he doesn't have that much time, but Yoruichi interrupts him, telling him she is fully aware of that; she will use a different, but more dangerous method to make him achieve Bankai in 3 days.\n \nYoruichi, bringing out a large white doll, states it is a Tenshintai, a rare artifact of the Onmitsukidō, which can forcibly materialize the spirit of a Zanpakutō. Yoruichi goes on to explain what is required in order to achieve Bankai. She notes that materialization means the opposite of entering the Zanpakutō's world; instead, one must summon the Zanpakutō's spirit into the real world. She explains how to use the artifact: Ichigo must stab the doll with his Zanpakutō and it will forcefully materialize the spirit, while Yoruichi will use her power to keep it materialized. Before they start, she warns him that the time limit is three days, and he only has one chance at this. Before time is up, he must force Zangetsu to submit. Ichigo stabs the artifact, causing Zangetsu to materialize. Yoruichi asks Zangetsu if he heard her conversation with Ichigo, to which he responds he has. She tells him he will choose the method of combat, and asks if they can begin immediately. Zangetsu, telling her he will, prepares to battle. As Yoruichi watches the battle between Ichigo and Zangetsu unfold, she thinks about Ichigo's improvement in fighting, noting his amazingly fast growth.\n \nAs the first day of training ends, Zangetsu returns to Ichigo, who relaxes in a hot spring. He becomes agitated when Yoruichi tells him she is going to join him. They get into an argument until she enters in her cat form. While resting, Ichigo tells Yoruichi the underground area they're in is similar to the one under Urahara's shop. Yoruichi tells him the one under the shop was most likely modeled after the area they are in now. She states the underground area was built when she and Urahara were young; Urahara dug the place in secret for their combat training. When they got older and she joined the Onmitsukidō and Urahara joined the Gotei 13, they would train in the secret underground area in order to help each other get stronger. Before she can finish, Ichigo interrupts her, having finally realized Urahara is a former member of the Gotei 13, making him a Shinigami, asking her who Urahara really is. Yoruichi reveals Urahara is the former Captain of the 12th Division of the Gotei 13, and the founder and 1st President of the Shinigami Research and Development Institute.\nWhile Ichigo warms up for another day of training, Yoruichi ponders the possibility of extending his training, noting that Ichigo growth is far faster than a normal Shinigami's, though only his combat techniques are improving while his spiritual energy remains the same. She decides that if his spiritual energy does not increase within the next day, she will go with whatever state Ichigo has developed. She reasons that there isn't enough time for an extension, and it would be too dangerous at that point of training.\n \nYoruichi is present when the secret underground training area is breached by Renji, who tells her and Ichigo Rukia's execution has been moved, taking place at noon the following day. Yoruichi is surprised by this new information, thinking there is no way Ichigo can attain Bankai in that small amount of time. Ichigo, refusing to give up, tells Yoruichi this training method was her idea, and she shouldn't give up before anyone else. Renji, eventually finishing training, asks Yoruichi if Ichigo will make it. She states she is not worried, for she is certain that Ichigo possesses the instinct necessary to learn Bankai. To help Ichigo in rescuing Rukia, she lends him the Tentōken, a cape which allows its user to fly by inserting some spirit power into it.\n \nFollowing the destruction of the Sōkyoku, Yoruichi intercepts Suì-Fēng at Sōkyoku Hill, stopping her from further harming Kiyone Kotetsu, 3rd seat of the 13th Division. Using Shunpo, Yoruichi grabs Suì-Fēng and takes her away with her off the edge of the cliff. Suì-Fēng recognizes her, stating it has been a while since they last saw each other. Landing in a forest, they engage in hand-to-hand combat before putting some distance between themselves. Suì-Fēng comments that even though they have not seen each other in a long time, Yoruichi has not gotten any stronger. Yoruichi states that, on the contrary, she thinks Suì-Fēng has gotten weaker. Suì-Fēng states the Tenshi Heisōban, the Shihōin Clan, has fallen, for if Yoruichi helping the Ryoka is revealed, her clan name will surely be removed from the list of the 4 great families.\n \nYoruichi asks Suì-Fēng why she is talking so much, taunting her by saying she is either excited to see her old mentor, or she is blowing off steam from her position as Commander-in-Chief of the Onmitsukidō. Suì-Fēng warns her not to get cocky and think she is still better than her after all these years. Suì-Fēng states both the Onmitsukidō and the Executive Militia are now under her control, as Yoruichi's era ended long ago. Taking out her Zanpakutō, she proceeds to drive it into the tree she is standing on. Suddenly, Yoruichi is surrounded by a cadre of Executive Militia members. Before any of the Executive Militia can react, Yoruichi uses Shunpo to take out every Executive Militia member in the area within seconds. Yoruichi tells Suì-Fēng to stop looking down on her so much, as there is still one title Yoruichi did not relinquish. Suì-Fēng tells her she will take the title of Goddess of Flash (瞬神, Shunshin) from her.\n \nYoruichi comments on Suì-Fēng's attire, noting she is wearing the battle suit of the Corps-Commander of the Executive Militia. Suì-Fēng attacks Yoruichi, and they begin to fight once again. Suì-Fēng uses Shunpo to appear behind Yoruichi and, holding her Zanpakutō up to Yoruichi's throat, releases her Shikai. They move apart once again and Suì-Fēng warns her to not underestimate her, as it may not have occurred to Yoruichi, Suì-Fēng would use all of her power against her. She states she has become stronger than Yoruichi, and with her death, she will pay the price for staying away from battle for a hundred years.\n \nAs a \"Hōmonka\" appears on Yoruichi's chest, Suì-Fēng goes on to explain the mechanics of her Zanpakutō's Shikai. Appearing behind Yoruichi, she attempts a second strike, but Yoruichi uses Shunpo to escape. After gaining some distance, Yoruichi turns around and goes on the offensive, attacking Suì-Fēng with knives hidden in her boot. Suì-Fēng blocks the incoming knives and manages to land a second strike on Yoruichi, asking her if she now understands Suì-Fēng is stronger than her. Suì-Fēng reveals her new technique, which combines Kidō and Hakuda, exclaiming she has never used it in battle and has only recently invented it. Yoruichi, however, tells her it has a name: Shunkō. Yoruichi uses the same technique, but at a more advanced level than Suì-Fēng's, explaining the mechanics behind the technique in detail. Yoruichi further states she wasn't planning on using Shunkō against her, but warns Suì-Fēng to be careful, as she also has not mastered it, before sending a wave of condensed Reiatsu toward her.\n \nWhen the smoke clears, the land between them is torn and scorched. Yoruichi asks Suì-Fēng if she now understands why she never showed her this technique, as it is too dangerous. Suì-Fēng starts to use Shunkō to attack her, but Yoruichi, nullifying it with Hanki, tells her to stop, as it is too soon for her to be using the technique in combat. Suì-Fēng, yelling that she should have been able to surpass Yoruichi in all these hundreds of years, continues to attack her, but Yoruichi dodges her attacks effortlessly. Yoruichi stops the attacks by initiating a Shunkō powered punch, but stops short of actually hitting Suì-Fēng. Upset and unwilling to fight anymore, Suì-Fēng breaks down and cries, asking why Yoruichi did not take her with her. She bows down to Yoruichi in defeat.\nYoruichi is with Suì-Fēng when Isane Kotetsu broadcasts the news of Sousuke Aizen's treason. They are among the first to arrive on the scene at Sōkyoku Hill to stop Aizen. Yoruichi stops Aizen from releasing his Zanpakutō, while Suì-Fēng holds her Zanpakutō to his neck. She tells him not to move a muscle, as Suì-Fēng says she will decapitate him if he does. Yoruichi is noticeably surprised by the arrival of three of the Gatekeepers, as they have betrayed Soul Society to join Aizen's forces, but later sees that Kūkaku and Jidanbō have arrived to combat them. Once his cohorts have been subdued, Yoruichi tells Aizen that it is the end, as there is nowhere for him to escape, for he has been completely surrounded by the Gotei 13. The overall attempt to stop him, however, is thwarted by the arrival of Gillians, who use their Negación to aid in Aizen's escape from Soul Society, with Yoruichi telling Suì-Fēng to jump away just in time. Yoruichi later returns to the Human World with the others.\nOn their way back to the World of the Living, Yoruichi and the others, while passing through the Dangai, are chased by the Kōtotsu once again, and are forced to flee from it. Upon entering the Human World, they are greeted by Urahara, Tessai, Jinta, and Ururu, who carry them home on Urahara's flying mat. After Ichigo and his friends have been dropped off, Urahara and Yoruichi talk about the future war. They both realize the battle isn't over, and that very soon, he and the other Shinigami will have to rely on Ichigo's group and their strengths more than ever.\nArrancar arc\n \nOne night, while Urahara is standing in front of his shop and displaying concern about what is going on in Karakura Town, Yoruichi approaches him. When the Espada Ulquiorra Cifer and Yammy Llargo begin to terrorize Karakura Town, Urahara and Yoruichi show up to save Ichigo from Yammy. After Urahara blocks his punch with his Chikasumi no Tate, Yoruichi easily dispatches Yammy, only for the enraged Arrancar to try to attack her from behind as she goes to help an injured Orihime. Yoruichi, turning around, brutally attacks Yammy, literally pounding him into the ground. As Yoruichi goes back to helping Orihime, Yammy gets up, enraged, and attempts to hit her with a point blank Cero, but Urahara counters it with a similar attack to nullify it. When Yammy becomes confused at the concept of this, Urahara, deciding to show off, fires a blast of spiritual energy from his Zanpakutō at Yammy, which is deflected by Ulquiorra with his bare hand. Ulquiorra, incapacitating Yammy for his rash actions and brutishness, proceeds to explain to him who he is fighting. The two Espada return to Hueco Mundo.\nLater, while at Urahara's shop, Yoruichi recuperates from an injured left arm and leg. When Urahara expresses concern about her state, Yoruichi admits she was foolish to fight him without using Shunkō, though she didn't think the Arrancar's skin would be so hard. She confirms the Arrancar are tougher than either she or Urahara had anticipated.\nShe appears again to take Orihime Inoue into the training room under Urahara's shop so he may speak to her about the upcoming battle.\nFake Karakura Town arc\n \nWhen Urahara and Isshin Kurosaki immobilize Aizen, Yoruichi appears, wearing armor on her arms and legs, and attacks Aizen from above. She smashes into his back with such force that it destroys the surrounding area, and lands a direct punch with even more force, causing damage to an entire block. Urahara yells for Yoruichi to move away. Aizen quickly recovers, and before Yoruichi can fully dodge his counterattack, he destroys the armor on Yoruichi's left leg. As Aizen emerges from the rubble with his new form severely cracked, he asks them if this is all they have, stating that they better hurry up and make the next move, as he plans to crush them all, one by one, into tiny fragments, down to the very last remnant.\nWhen Urahara expresses his surprise at how the armor he created was destroyed by Aizen with one blow, Yoruichi tells him off for not building the armor properly. Urahara warns Yoruichi to keep away as they prepare to face the next attack, but she remarks that she will be fine as long as Aizen does not attack her exposed leg. Aizen's next blow takes her completely by surprise. Managing to escape Aizen's assault at the cost of her right arm-guard, Yoruichi complains to Kisuke when he asks if she is alright. She tells him she was able to block the attack because of the \"half-finished\" armor, but she would have simply dodged it without the armor. After they stop arguing, Kisuke launches a Kidō blast at Aizen. Yoruichi, taking advantage of this, attempts to attack Aizen, but he, anticipating their ploy, blocks her attack. She follows up with a Shunkō assault, knocking him to the ground, but Aizen blocks her next attack. Urahara interrupts by immobilizing Aizen with Benihime. Yoruichi, along with Kisuke and Isshin, are defeated by Aizen, who leaves for the real Karakura Town in Soul Society.\nThe Lost Substitute Shinigami arc\nWhen Ichigo regains his powers, he notices Yoruichi's power was used to help restore his own. She is in her cat form, perched atop Kisuke Urahara's head, when Ichigo returns from Soul Society after collecting Kūgo Ginjō's body.\nThe Thousand-Year Blood War Arc\n \nDuring the second Wandenreich invasion, while Ichigo and his friends are preparing to return to the Soul King Palace via a replica of Kūkaku's cannon, Yoruichi appears when Orihime is feeling self-conscious about her new outfit and slaps Ichigo before scolding him for stating Orihime is showing too much, as it is clear she was deceived by a maniac and does not want to wear it. When Urahara welcomes her and asks her what happened, Yoruichi reveals a set of bottles underneath her cloak, prompting Urahara to explain to the others how she joined Hiyori's team and collected the large amount of energy created by closing the distortion between the worlds. Yoruichi later accompanies Ichigo, Orihime, Sado and Ganju as they are launched towards the Soul King Palace. When Orihime mentions how similar it is to the time they rescued Rukia Kuchiki, she comments on Yoruichi being a cat at the time, prompting Yoruichi to say that she can still transform into a cat.\n \nLater, Yoruichi and the others arrive at the palace, where Yoruichi has her fall cushioned by Orihime's Santen Kesshun. Yoruichi notices Ichibe'e Hyōsube's head lying on the ground and rushes toward the main palace alongside the others after he revives himself and explains the situation. Eventually, Yoruichi and the others arrive at the main palace, where they confront Yhwach. Soon afterward, Yoruichi expresses shock when Ichigo's right side is enveloped in Blut Vene veins upon touching Yhwach's sword.\n \nWhile Yhwach is explaining what happened to Ichigo, Yoruichi takes advantage of his distraction to envelop him in a wire cage. She then orders Orihime to use her powers to restore the Soul King, and looks on as Orihime fails in her attempt to do so. When Mimihagi arrives to stabilize the Soul King, Yoruichi looks at it in shock. After Ichigo prevents Yhwach from destroying both of them, Yoruichi leaps to the Soul King and creates a barrier around it by placing three talismans on the ground. Yoruichi notes that Mimihagi has stabilized the king before proclaiming that they will simply have to replace the king.\n \nHowever, Yoruichi is caught off-guard when she is shot in the shoulder with a Heilig Pfeil by Uryū, who has arrived at the scene of the battle. Due to her momentary lapse in concentration, the barrier shatters, sending the top half of the Soul King flying toward Yhwach, who catches it. Yoruichi begins throwing spheres at Yhwach in an attempt to injure him, but Yhwach has Pernida Parnkgjas warp her arm before throwing her out of the palace.\n \nYoruichi manages to remove her useless arm and lands on one of the floating cities nearby before catching Ichigo and his friends, who are falling on top of Orihime's Santen Kesshun, with two black arrows tied to a nearby post. After waking Ichigo up with a kick and having her arm restored by Orihime, Yoruichi asks the others if it is time to counterattack before having Grimmjow Jaegerjaquez arrive via Garganta. After everyone enters the modified Valley of Screams created by Riruka Dokugamine and Yukio Hans Vorarlberna, Yoruichi explains to Ichigo how they are going to infiltrate the palace using a Garganta and the Valley of Screams.\nAs the Valley of Screams begins moving along the track, Yoruichi tells the others that they will keep moving until they reach the palace because she put a nail near the Soul King when the barrier around him was collapsing. When Sado asks her what power Pernida has, Yoruichi admits that she only knows that her arm broke before telling the others to not go near it. As the group approaches the Royal Realm, Yoruichi asks them if they are ready. When they reach the palace, Yoruichi exits the Valley of Screams alongside the others and is confused by the presence of the Wandenreich city, only to see the stake she placed in the palace nearby, which prompts her to realize that Yhwach has reshaped the entire palace.\nNoting that they were spared from the reshaping process because they were in the Garganta the whole time, Yoruichi notices her little brother's Reiatsu and informs the others of whom it belongs to before questioning Ichigo's desire to know why she had not told him of this before. Upon noticing her companions trying to envision her brother, Yoruichi informs them that they look very much alike, prompting Ichigo and the others to imagine Yūshirō as a cat, to Yoruichi's irritation. As she and the others run toward the center of the palace, Yoruichi claims that Ichigo is very much like Yūshirō for having tried and failed to make Reishi platforms in the palace.\n \nLater on, after Askin Nakk Le Vaar incapacitates Ichigo, Sado, and Orihime, Yoruichi confronts him while questioning why he does not use this opportunity to simply strangle them, which prompts Askin to attack her. When Yoruichi wonders if he believes his opponents are beneath him, Askin claims that poisoning people is elegant while strangling is more suited for people like Yoruichi and Bambietta Basterbine. Hearing this, Yoruichi activates her Shunkō and states that Askin is trying to describe how the beautiful do things before catching one of his Heilig Pfeil and hitting Askin in the shoulder with it. After claiming that Askin is going to have to let them through, Yoruichi activates Shunkō: Raijin Senkei before engulfing Askin in an enormous blast.\n \nAs the blast decimates the nearby area, Yoruichi grabs Orihime and tells her to heal herself, Sado, and Ichigo before going ahead. Telling Orihime that she will be fine, Yoruichi is interrupted when Yūshirō comes flying toward her. When Yoruichi dodges him, Yūshirō quickly wraps himself around her leg, but Yoruichi headbutts him and asks him why he is not with Urahara. Yūshirō replies that with all the Captain-class Shinigami running around, he thought he could come to her rescue, which amuses Yoruichi. She sarcastically tells him that he became a lot stronger, but Yūshirō takes it seriously, to her exasperation. When Askin emerges from the smoke, and Yoruichi tells a healed Ichigo to head off with the others. Ichigo tells her to watch herself, but Yoruichi says it will take a lot more to slow her down as he runs off with Sado and Orihime. Askin watches them run away, and reflects that Yhwach would be angry at him. Askin mocks her attack, causing Yūshirō to fly at him in a rage. Yūshirō uses Shunkō on Askin, and Yoruichi reluctantly commends him for learning a powerful technique in such a short time. However, Askin survives the attack, shocking Yoruichi and Yūshirō, as he says that their Reiatsu could no longer kill him.\nYoruichi notices that Askin's wounds are all healing as he reveals that he has become immune to their Reiatsu attacks. Yūshirō reactivates Shunkō and rushes toward Askin despite Yoruichi telling him not to. However, Yūshirō is impaled by Reishi arrows and collapses, and Yoruichi rushes to catch her brother. Askin tells her that it took them far too long to realize what his power is.\nAskin blasts Yoruichi with a Gift Ball containing Reishi, oxygen, and nitrogen, causing her to become weakened and struggle to keep herself up. Yoruichi does not know what to make of Askin toying with her, but he replies that he was trying his best to kill her. Yoruichi looks at the fallen Yūshirō, knowing that he could not last much longer in that state but she is too weak to heal him. Suddenly, Askin appears right in front of her, saying that if it took this long for her to react, then she was as good as dead.\n \nSuddenly, Kisuke appears and injects an immunity strengthening drug into her rear end, causing Yoruichi to kick him in the jaw. As Kisuke faces Askin, the drugs take effect and Yoruichi leaps up into the air. She asks Kisuke what he injected into her, but quickly deduces what it was, and Kisuke tells her that it will only last about five minutes due to its production being rushed. Yoruichi says that that is enough time as she activates Shunkō: Raijin Senkei. Kisuke suggests that Yoruichi use another technique, which she immediately rejects due to not wanting to take on that form again. The two dodge a Heilig Pfeil fired by Askin, and Yoruichi rushes toward the Quincy. However, Askin dodges her attacks and punches her in the stomach, causing her to fall to the ground. Kisuke calls out to Yoruichi, revealing she will go into the form he suggested if he rips off a piece of paper. Kisuke does so, forcing Yoruichi to activate a new form.\n \nAskin wonders what Yoruichi has become, but she is now unable to understand him as Kisuke reveals she has activated Shunkō: Raijū Senkei: Shunryū Kokubyō Senki. Yoruichi leaps toward Askin and slashes him in the shoulder while engulfing him with her Reiatsu. Due to now having frequent changes in mood, Yoruichi ignores Askin and licks herself, but quickly returns to punch Askin far away. She then engulfs him in a large bolt of Reiatsu, and leaps to Kisuke when he calls her. Yoruichi licks him and rests on his lap, but the immunity drug begins wearing off, causing her to whimper in pain. Suddenly, Askin engulfs Yoruichi and Kisuke in Gift Ball Deluxe and approaches them with his Quincy: Vollständig activated.\nEquipment\n \nRyūkotsujō (竜骨杖, Dragon Bone Jō): A long, beige, bone wand-like artifact, with a small, white, bird-shaped skull, and four protrusions, similar to finger bones, extending from the back of the skull. By channeling Reiryoku into the wand, it produces a tentacle, which acts a harness, and a single bat-like wing manifests from the four bone protrusions, which acts as a one-handed hang-glider. No skill or previous experience is required to use it.\nTentōken (天踏絢, Heaven-Stepping Adornment): It is a brown mantle, with a large drawstring closure at the collar and a large brooch displaying the Shihōin Clan crest. Like the wand, the Tentōken requires no skill or previous experience to use. It appears to be superior to the wand, since it allows one to hover in mid-air, and does not immobilize one of the user's hands.\nAnken (暗剣, Dark Blade; Viz \"Dark Sword\"): Small knives which Yoruichi hides in her boots. She can launch them at a target with a swing of her leg.\nAnti-Hierro Armor: A set of metal gloves and boots, invented by Kisuke Urahara, designed specifically to counter an Arrancar's Hierro during hand-to-hand combat. They are exceptionally durable, protecting the wearer's limbs even during the moment of their destruction.\n \nTenshi Heisō: Hissaki Kumoi (天賜兵装・引っ裂き蜘蛛網, Heavenly Gifted Armament: Shredding Spider's Web): One of the Shihōin Clan's treasures, appearing as razor-sharp, yellowish-orange wires that Yoruichi carries on her person. She can trap an opponent in a field of it almost instantaneously, and according to her, it can harm someone as powerful as Yhwach should he try to move through it.\nSankotsu no Jufu (三骨呪符, Three-Bone Talismans): Three paper talismans that, when set around a target, form an inner and outer barrier around them, allowing for stabilization. According to Yoruichi, these are potent enough to let even the Soul King himself be replaced by a sufficient candidate.\n \nDestructive Spheres: Somewhat small, light-colored spheres attached to each other by a string that Yoruichi throws at her opponent. According to her, once a sphere hits her opponent's body, a second sphere hitting that same area will destroy it.\nPowers & Abilities\nFeline Transformation: Yoruichi possesses the unique ability to shapeshift into a black cat at will. While unknown how she obtained this ability, she has possessed it for well over 100 years. She apparently has no set time limit on the transformation, as she had been in this form for over 100 years. In cat form, Yoruichi can still channel her spiritual energy and move at incredible speeds, though she is physically limited. Her transformation, which releases a thin cloud of mist or steam when reverting to her default form, grants her a complete disguise, as her voice in this form is deep enough to lead most to assume she is a male.\n \nShunpo Master: Widely regarded as the most proficient master of Hohō in all of Soul Society, Yoruichi holds the title of \"Flash Goddess\" (瞬神, Shunshin; Viz \"Flash Master\"). Her prowess in Shunpo is so formidable that she can appear in several places at once, enough to wipe out an entire squadron of Onmitsukidō members in seconds. She can easily close tremendous gaps of distance in the blink of an eye while remaining undetected, and can surprise Byakuya, who is also one of the most proficient Shunpo masters. She has mastered countless Hohō techniques and even created some of her own. The full extent of her abilities remain unclear but, despite being a century out of practice, she was able to outrun Byakuya while carrying an unconscious Ichigo over her shoulder, performing around 300 steps before feeling tired. Suì-Fēng, another stellar Shunpo master and her former mentee, was able to strike Yoruichi multiple times in their battle, but failed to hit her in the same spot twice with her Zanpakutō for its ability to take effect.\nUtsusemi (空蝉, Cast-Off Cicada Shell) Way of Onmitsu, 3rd of the Shihō: Created by Yoruichi herself, it allows for movement of such sudden and great speed, leaving at least one tangible after-image behind. Byakuya Kuchiki states Yoruichi taught it to him.\nHakuda Master: As former Commander-in-Chief of the Onmitsukidō, Yoruichi is one of the most—if not the most—skilled Hakuda masters in Soul Society. Her mastery of the art is such that she could be described as a Hakuda specialist, forgoing her Zanpakutō altogether. Despite having been out of action for a hundred years, she was able to take down nearly 50 Onmitsukidō members with ease, kept pace with and ultimately defeated a fellow Hakuda master in Suì-Fēng, Captain of Second Division. She is able to effortlessly take on Espada-level Arrancar, as demonstrated when she brutally defeated Yammy, and was deemed by the 4th Espada Ulquiorra Cifer to be highly dangerous.\nTaketonbo (竹蜻蛉, Bamboo Dragonfly): A Hakuda technique which involves a simple, yet effective, throw which suddenly and violently flips an opponent upside down.\nRaiōken (雷王拳, Thunder King Fist): A Hakuda technique involving a series of ultra-high-speed punches delivered using both arms. When performing this technique while wearing Anti-Hierro Armor, Yoruichi severely cracked Aizen's first form, destroying the surrounding portion of Karakura Town in the process.\n \nShunkō (Lightning) (瞬閧, Flash War Cry): An advanced technique which combines Hakuda with Kidō. This technique surrounds her back and arms with pressurized Kidō based on the element of lightning. The keisen uniform has no back or sleeves because they will rip apart when it is activated. Apart from enhancing her arms and legs for combat, the technique allows her to instantly neutralize an opponent's movement. The Kidō itself can be controlled and fired at opponents from her body, which creates massive explosions. Yoruichi's version of the technique was developed and studied by her a century ago; therefore, the technique is complete and the compressed Kidō is visible. While using this technique, her Reiatsu takes the form of white lightning. Her skill and control in its usage has progressed to the point of activation taking the form of a pair of lightning wings generated from her back.\nShunkō: Raijin Senkei (瞬閧 雷神戦形, Flash War Cry: Thunder God Battle Form): The lightning emitted from Yoruichi's back creates a circle of electrical energy in the shape of Raijin's drums behind her as Yoruichi unleashes a giant column of concentrated electrical energy to engulf her opponent.\n \nShunkō: Raijū Senkei: Shunryū Kokubyō Senki (瞬閧 雷獣戦形 瞬霳黒猫戦姫, Flash War Cry: Thunder Beast Battle Form: Flash God Black Cat Warrior Princess): While Shunkō: Raijin Senkei is already activated, Yoruichi can transform her mind and body even further. Upon release a huge column of electrical energy is released. When the energy disappears Yoruichi has taken on the form of a hybrid of Shunkō and her feline form. Her feet become clawed cat paws, this form clads her arms and legs in electricity covering her forearms past the elbow and her legs up to her thighs, each ending with claws made of electrical energy. The energy forms her hair into the form of cat ears and she grows a tail. This form sheaths her in an aura of electrical energy. This form gives her the mentality of a cat and allows the cat nature of \"fickleness\" to manifest in her Reiatsu. While Yoruichi is naturally moody, she is even more so in this form; her Reiatsu is directly responsive to her changes in mood, and therefore becomes reliably unstable by changing 48 times per second. Kisuke Urahara is the only one who can control her in this form.\nKidō Master: Yoruichi is well-versed and highly skilled in Kidō. Though she commonly employs Shunpo and Hakuda in battle, she often uses Kidō to further her capacity in combat, often mixing it with other fighting techniques. She has used mid to high-level binding and destruction spells with no incantation with expert skill. Her skill is great enough to effortlessly learn new variations of Kidō with only simple instructions, such as activating Kūkaku Shiba's Reishukaku.\nKaidō(回道, Turn Way): Yoruichi also has a degree of proficiency in healing Kidō.\nHanki (反鬼, Reverse Demon): This technique is used by Yoruichi during Shunkō. It nullifies an opponent's Kidō by hitting it with a Kidō of perfectly opposite speed and energy. The technique can neutralize an opponent's movements.\nMaster Assassin: As the former Commander-in-Chief of the Onmitsukidō, Yoruichi is one of the foremost masters of the art of assassination. She has repeatedly shown impressive skill in staying hidden and unseen. When necessary, she can effectively exploit having an advantage against an opponent or hiding her presence. Even Aizen was taken completely by surprise, and just as easily subdued.\nMaster Strategist & Tactician: As the former head of her clan and ex-commander of the Onmitsukidō, Yoruichi is an excellent leader. She has repeatedly proven to be insightful and crafty, capable of quickly understanding any situation that presents itself and adjusting to it effectively. Upon learning Ichigo would go to save Rukia no matter what, Yoruichi began making preparations of her own by training Orihime and Chad.\nImmense Spiritual Power: As former captain of the 2nd Division and Commander-in-Chief of the Onmitsukidō, as well as a former head of one of the four Noble Houses, Yoruichi possesses immense amounts of spiritual power. During Ichigo's Bankai Training, she kept the Tenshintai active for an extended period of time with her Reiryoku. The reputation of her power is enough to make 4th Espada Ulquiorra Cifer wary to engage in combat with her, even with the help of 0 Espada Yammy Llargo. Her Reiatsu is red.\nEnhanced Strength: Despite her slender appearance, Yoruichi has incredible physical strength in her Shinigami form. She could still easily use Shunpo while carrying around an unconscious Ichigo to outrun a fellow Shunpo Master. She easily caught a direct punch from Yammy Llargo, and simultaneously threw him several feet away. She easily injured him, despite his thick Hierro, with various unarmed moves, but is injured by his Hierro. Though she admits she wasn't expecting his skin to be that hard, she states she could have avoided taking any damage if she had Shunkō activated. A concentrated blow from Yoruichi can destroy an entire city block.\nEnhanced Endurance: Despite her own admission of being out of shape, Yoruichi is an incredibly resilient warrior. Both when out of breath from prolonged running against Byakuya and sustaining fractures from Yammy's Hierro, Yoruichi was still able to fight effectively while showing no signs of weakening. Even when her arm started to twist rapidly due to Pernida Parnkgjas's The Compulsory, Yoruichi didn't show any signs of being in pain and was more wondering the nature of the power. Likewise, Yoruichi showed a resistance to Askin Nakk Le Vaar's The Deathdealing, able to survive exposure to lethal doses of several substances and retain consciousness, impressing Askin.\nZanpakutō\n \nAs a former captain of the Gotei 13, it is known that Yoruichi possesses a Zanpakutō and has achieved Bankai, but she relies nearly exclusively on Hohō and Hakuda. Although she doesn't carry it at all in the current time, she wore it in the past. It resembles a kodachi or wakizashi which she kept sheathed horizontally behind her on her lower back, similar to how Suì-Fēng carries hers in the present day.\nShikai: Not Revealed\nBankai: Not Revealed\nAppearances in Other Media\nVideo Game Appearances\nBlade Battlers\nBlade Battlers 2nd\nThe Blade of Fate\nBleach: Dark Souls\nThe 3rd Phantom\nFlame Bringer\nTasogare ni Mamieru Shinigami\nShattered Blade\nVersus Crusade\nHeat the Soul\nHeat the Soul 2\nHeat the Soul 3\nHeat the Soul 4\nHeat the Soul 5\nHeat the Soul 6\nHeat the Soul 7\nSoul Carnival\nSoul Carnival 2\nHanatareshi Yabou\nBleach Advance: Kurenai ni Somaru Soul Society\nErabareshi Tamashii\nSoul Resurrección\nJ-Stars Victory Vs\nBrave Souls\nParadise Lost\nJump Force\nRebirth of Souls\nMovie Appearances\nMemories of Nobody\nThe DiamondDust Rebellion\nFade to Black\nThe Hell Verse\nLive-Action Film\nBURN THE WITCH\nNovel Appearances\nLetters From The Other Side\nThe Honey Dish Rhapsody\nSpirits Are Forever With You\nThe Death Save The Strawberry\nWE DO knot ALWAYS LOVE YOU\nCan't Fear Your Own World\nNovels\nIn Ryōgo Narita's novel Bleach: Can't Fear Your Own World, Yoruichi mentions that she never uses her Zanpakutō because she is stronger when using Shunkō. However, due to this she has to comfort her upset Zanpakutō Spirit every day.\nVideo Games\n \nIn The 3rd Phantom, she is capable of using both Shunkō and Shunshinraijin (瞬神雷神, Flashing Lightning God), as well as using other Kidō, such as Hadō #4. Byakurai, and is a Speed-type character.\nIn Soul Carnival, she has a technique called Shunretsugeki (瞬烈撃, Flashing Fierce Strike).\nYoruichi appears again in Soul Resurrección in her arm and leg armor that she used against Aizen. In this game, she can use Musō Renbu (無双連舞, Matchless Serial Dance), where she unleashes a barrage of rapid punches against her opponent. Her Ignition Attack is Shunkō Raigeki (瞬閧雷撃, Flash War Cry Thunder Strike), where she generates a javelin of white energy before throwing it at her opponent.\n \nIn Bleach: Brave Souls, various versions of Yoruichi are playable, including one drawing from her appearance during the Thousand Year Blood War arc. In this form, Yoruichi is a melee strong attack character with the \"Speed\" Attribute and the \"Hollow Killer\" ability who has a chance to inflict Paralysis with every attack. Her unlockable skills are \"Bruiser +20%\", \"Debilitator +5 secs.\", \"Devastation +40%\", \"Frenzy +1\", \"Long Reach +20%\", and \"Sprinter +1\", while her Soul Trait is \"Strong Attack Damage +20%\"; meanwhile, her Arena Traits are \"Strong Attack Recharge Time -7%\" and \"Spiritual Pressure +90\", while her Arena Abilities other than \"All Stats +5%\" are \"Paralysis Duration -100%\" at level 5 and \"Strong Attack Damage +30%\" at level 10. Yoruichi's special is Shunkō: Raijū Senkei - Shunryū Kokubyō Senki (瞬閧　雷獣戦形『瞬霳黒猫戦姫』, Flash War Cry: Thunder Beast Battle Form: Flash God Black Cat Warrior Princess), where she becomes clad in lightning-like Reiatsu and attacks with incredible speed, inflicting immense damage and Paralysis; after doing so, Yoruichi remains in this form for a brief period of time.\n \nYoruichi is also playable as an alternate-reality version of herself from a technology-oriented Soul Society known as the Machine Society. In this form, Yoruichi is a melee strong attack character with the \"Power\" attribute and the \"Hollow Killer\" ability who has a chance to inflict Burn with every attack except for her second strong attack, which is a boost move. She has the \"Poison Resistance\" and \"Read Hollow Dodges\" Innate Abilities built in at ★5 and her unlockable skills are \"Berserker +20%\", \"Bruiser +20%\", \"Debilitator +2 secs.\", \"Devastation +40%\", \"Enhancer +10 secs.\", \"Frenzy\", \"Guard Break\", \"Havoc +20%\", and \"Sprinter +1\", while her Soul Trait is \"Strong Attack Recharge Time -12%\". Yoruichi's special is Twilight Strike (宵煌ストライク, Shōō Sutoraiku; Japanese for \"Dusk-Brightening Strike\"), where she combines magic and steam power in a tail strike that inflicts immense damage and Burn.\n \nAdditionally, Yoruichi is playable in her usual attire, drawing from her and Kisuke Urahara's confrontation with Ulquiorra Cifer and Yammy Llargo in Karakura Town. In this form, Yoruichi is a melee normal attack character with the \"Speed\" attribute and the \"Espada Killer\" ability. Her unlockable skills are \"Team/Party Speed Attribute Soul Reaper Normal Attack Damage +20%\", \"Berserker +50%\", \"Bruiser +40%\", \"Devastation +40%\", \"Flurry\", \"Poise\", and \"Sprinter +1\", while her \"Soul Trait\" is \"Damage Taken -20%\". Yoruichi's special is Thunder Strike (瞬撃, Shungeki; Japanese for \"Flash Beat\"), where she performs a flying ax kick that inflicts immense damage.\n \nYoruichi is also playable in a form drawing from her time as the captain of the Second Division. In this form, Yoruichi is a melee strong attack character with the \"Technique\" Attribute and the \"Arrancar Killer\" ability. Her unlockable skills are \"Devastation +30%\", \"Frenzy\", \"Long Reach +15%\", \"Long Stride\", and \"Sprinter +1\", while her Soul Trait is \"Normal Attack Damage +20%\"; when resurrected, her unlockable skills are \"Bruiser +20%\", \"Devastation +40%\", \"Frenzy\", \"Havoc +20%\", \"Long Reach +20%\", \"Long Stride\", and \"Sprinter +1\", while her Soul Traits are \"Normal Attack Damage +20%\" and \"Poison Duration -55%\". Yoruichi's special is Raiōken (雷王拳, Thunder King Fist), where she unleashes a high-speed Hakuda attack with both arms that inflicts immense damage to anything it hits.\n \nAdditionally, Yoruichi is playable in her normal Shinigami attire, drawing from her game of tag with a young Byakuya Kuchiki. In this form, Yoruichi is a melee strong attack character with the \"Heart\" Attribute and the \"Shinigami Killer\" ability whose second Strong Attack is a Boost Move. Her unlockable skills are \"Bruiser +20%\", \"Devastation +40%\", \"Enhancer +10 secs.\", \"Frenzy\", and \"Sprinter +1\", while her Soul Trait is \"Strong Attack Recharge Time -14%\". Yoruichi's special is Flash Master Hakuda Flurry (瞬神・白打の連撃, Shunshin: Hakuda no Rengeki; Japanese for \"Flash Goddess: Continuous Hakuda Attack\"), where she performs an uncountable number of Flash Steps and Hakuda attacks that inflict immense damage.\n \nYoruichi is also playable alongside Suì-Fēng as a team unit, only the second such unit to be added to the game. In this form, Yoruichi and Suì-Fēng are a melee strong attack unit with the \"Mind\" Attribute and the \"Hollow Killer\" and \"No Affiliation Killer\" abilities, with Yoruichi's normal attacks having a chance to inflict Lacerate and her Strong Attacks having a chance to inflict Poison while all of Suì-Fēng's attacks have a chance to inflict Poison. They have two Innate Abilities built in at ★5: \"Fire Duration -100%\" and \"Freeze Duration -100%\", and their unlockable skills are \"Combo Bonus Increased CPU Double-Team Character Damage +1\", \"Berserker +20%\", \"Bruiser +20%\", \"Debilitator +5 secs.\", \"Devastation +40%\", \"Frenzy\", \"Guard Break\", \"Sprinter +1\", and \"Strong Attack Recharge Time -12%\", while their Soul Trait is \"Damage Inflicted At Full STA +20%\"; meanwhile, their Arena Traits are \"Slow Duration -65%\", and \"Focus +30\", while their Arena Abilities other than \"All Stats +5%\" are \"Strong Attack Damage +10%\" at level 5 and \"Strong Attack Damage +20%\" at level 10. Yoruichi and Suì-Fēng's special is Heartfelt Duet (心頼の二重奏, Kokorodano no Nijūsō; Japanese for \"Heartfelt Duo\"), where they activate Shunkō and attack with kicks that inflict immense damage and Poison.\n \nAdditionally, Yoruichi is playable as an alternate-universe version of herself from the Cacao Society. In this form, Yoruichi is a ranged strong attack character with the \"Speed\" Attribute and the \"Hollow Killer\" ability whose third Strong Attack can inflict Paralysis. Her unlockable skills are \"Bruiser +20%\", \"Debilitator +5 secs.\", \"Devastation +40%\", \"Frenzy +1\", \"Long Reach +20%\", and \"Sprinter +1\", while her Soul Trait is \"Strong Attack Damage +20%\"; when Resurrected, her unlockable skills are \"Berserker +20%\", \"Bruiser +20%\", \"Debilitator +5 secs.\", \"Devastation +40%\", \"Frenzy +1\", \"Long Reach +20%\", and \"Sprinter +1\", while her Soul Traits are \"Strong Attack Damage +20%\" and \"Normal Attack Damage +16%\". Meanwhile, her Arena Traits are \"Strong Attack Recharge Time -7%\" and \"Spiritual Pressure +45\", while her Arena Abilities other than \"All Stats +5%\" are \"Strong Attack Damage +10%\" at level 5 and \"Strong Attack Damage +20%\" at level 10. Yoruichi's special is Milk Chocolate Slash (ミルクショコラ・スラッシュ, Miruku Shokora Surasshu), where she performs a mesmerizing flurry of movement and strikes that inflicts immense damage and Paralysis.\n \nYoruichi is also playable in a swimsuit form. In this form, Yoruichi is a ranged strong attack character with the \"Power\" Attribute and the \"No Affiliation Killer\" ability who has a chance to inflict Weaken with every attack. Her unlockable skills are \"Bruiser +20%\", \"Debilitator +5 secs.\", \"Devastation +40%\", \"Frenzy\", \"Slow Duration -100%\", and \"Sprinter +1, while her Soul Trait is \"Strong Attack Recharge Time -12%\". Yoruichi's special is Summer Spike (サマーアタック, Samā Atakku; lit. \"Summer Attack\"), where she performs a brutal beach volleyball attack that inflicts immense damage and Weaken.\n \nAdditionally, Yoruichi is playable in a Christmas form. In this form, Yoruichi is a ranged strong attack character with the \"Power\" Attribute and the \"Quincy Killer\" ability who has a chance to inflict Paralysis with every attack other than her second Strong Attack, which is a healing + boost move. She has three Innate Skills built in at ★5: \"Guard Break\", \"Medic\", and \"Sprinter +1\", and her unlockable skills are \"Berserker +40%\", \"Booster +30%\", \"Debilitator +5 secs.\", \"Devastation +40%\", \"Enhancer +10 secs.\", \"Frenzy +1\", \"Strong Attack Recharge Time -12%\", and \"Technique Link Slot Potions +5\", while her Soul Trait is \"Technique Droplet Drop +30%\"; meanwhile, her Arena Traits are \"Strong Attack Recharge Time -7%\" and \"Spiritual Pressure +45\", while her Arena Abilities other than \"All Stats +5%\" are \"Strong Attack Damage 10%\" at level 5 and \"Strong Attack Damage +20%\" at level 10. Yoruichi's special is Holy Parade (ホーリー・パレード, Hōrī Parēdo), where she leads a magical orchestra to deliver presents, inflicting immense damage and Paralysis.\n \nYoruichi is also playable as an alternate-universe version of herself introduced as part of the Bleach: Spirits Are Forever With You tie-in event who gained a power beyond Bankai.\nThis version of Yoruichi wears a modified version of the golden robe she donned as the leader of the Shihōin Clan with a white undersection and large red-white tassels tying the sides of the long sleeves together alongside a large golden comb that bears long red-white tassels pinning her hair up atop her head, a long and thin golden rod with six small chimes on either end inserted through the bun, a white undergarment lined with thick red borders underneath her robe that stops at her thighs, an orange sash patterned with yellow stars around her waist over a brown garment hemmed in gold that bears the Shihōin Clan crest, and form-fitting thigh-high black footwear that curves downward toward her inner legs. In her right hand, she wields a golden sword comprised of a double-edged blade, a circular hilt with a spike on either side and the Shihōin Clan crest engraved in its center, a handle wrapped in purple cloth, and a purple tassel with three white beads attached to one side of the hilt.\nIn this form, Yoruichi is a melee strong attack character with the \"Heart\" Attribute and the \"Arrancar Killer\" ability who has a chance to inflict Weaken with every attack. She has three Innate Skills built in at ★5: \"Party Recover 20% Stamina\", \"Marauder\", and \"Sprinter +1\", while her unlockable skills are \"Ailment Reversal\", \"Berserker +40%\", \"Damage inflicted at full STA +20%\", \"Debilitator +5 secs.\", \"Devastation +40%\", \"Frenzy +1\", \"Havoc +20%\", \"Increased Status Ailment Chance Against Mind Attribute Enemies +10%\", and \"Status Ailment Spiritual Pressure Boost +80%\", while her Soul Trait is \"Strong Attack Recharge Time -12%\". Meanwhile, her Arena Traits are \"Strong Attack Damage +13%\" and \"Spiritual Pressure +45\", while her Arena Abilities other than \"All Stats +5%\" are \"Strong Attack Damage +10%\" at level 5 and \"Strong Attack Damage +20%\" at level 10. Yoruichi's special is Tenshi no Mai (天賜の舞, Dance of the Heavenly Granted), where she performs a magnificent leaping attack that inflicts immense damage and Weaken.\n \nYoruichi is a playable character in the crossover fighting game Jump Force; and was added in one of the game's DLC; and appears as her Quincy Blood War self. Her strongest move consists of her using her Shunkō: Raijū Senkei: Shunryū Kokubyō Senki form.\nMusic\nYoruichi features in the third volume of Bleach \"B\" Station's first season, as well as the fifth season's fifth volume.\nBuriCon - Bleach Concept Covers features Yoruichi performing \"Houkiboshi\" in a duet with Suì-Fēng.\nYoruichi appears in the third through to eighth editions of the Rock Musical Bleach, where she is played by Kumiko Saitō.\nCensorship\nWhen Yoruichi injected Ichigo with an anesthetic, her hand wasn't shown impaling him as much in the anime, nor was it covered in the latter's blood, compared to the manga.\nIn the manga while rescuing Ichigo from Byakuya and using Utsusemi to evade him, her afterimage had its arm sliced off. In the anime, the afterimage just had massive injuries on it.\nWhen Yoruichi was about to get into the hot spring with Ichigo, her bare hips weren't shown as much in the anime compared to the manga.\nIn the anime, after Yoruichi and Sui-Feng both landed a hit on each other, Yoruichi wasn't bleeding from her mouth as much, as she was in the manga.\nWhen Yoruichi was stung by Sui-Feng's Suzumebachi after the first 2 strikes, she wasn't bleeding in the anime, as she was in the manga.\nThe appearance of the Onmitsukidō commander outfit that Suì-Fēng and Yoruichi wear, has slight changes from the manga in order to make it less revealing. In the manga the uniform reveal the entirety of Suì Fēng and Yoruichi's backs, as well as small portions of the sides of their breasts. In the anime, the outfit has been redesigned to feature a white undershirt that covers the lower back, and the sides of the upper abdomen. It also does not reveal a portion of Suì-Fēng's thighs as it did in the manga.\nIn the manga, after she attacked Yammy Llargo, a couple of his teeth were broken, but in the anime Yammy's teeth are unscathed.\nTrivia\nThe theme song that Kubo chose for Yoruichi is \"雲路の果て\" by the artist Cocco.\nYoruichi was voted the 15th most popular character in the first character popularity poll, 19th in the second, 7th in the third, 28th in the fourth, and 20th in the fifth. In the tenth poll, she ranked 10th.\nIn the first best bout poll, Yoruichi's fight with Suì-Fēng ranked 9th; in the second, it ranked 7th while Yoruichi's fight alongside Kisuke Urahara and Isshin Kurosaki against Sousuke Aizen ranked 38th and her fight with Byakuya Kuchiki ranked 68th.\nYoruichi's gigai has a tribal tattoo on the outside of its left thigh, as seen in filler Episode 228, which was based on a picture of her drawn by Tite Kubo in Volume 26.\nIn the 19th edition of Tedious Everyday Tales Colorful Bleach, Yoruichi is colored with purple eyes. In the following releases, however, her eyes are golden again.\nWhen Yoruichi was explaining how Urahara was a former member of the Gotei 13, she was still in her cat form. In the anime, however, she transformed back into her original and explained who Urahara was.\nIn the anime, the three guardians whom Aizen summoned to Sōkyoku Hill were not shown. Instead, Kūkaku Shiba arrived with Jidanbō Ikkanzaka and used Raikōhō to attack Aizen before he was subdued by Yoruichi and Suì Feng.\nKlub Outside Trivia\nAccording to Q&A #331 by Tite Kubo on his fansite \"Klub Outside\", Yoruichi initially developed the ability to turn into a cat so she could sneak out her family's mansion.\nAccording to Q&A #465 by Tite Kubo on his fansite \"Klub Outside\", Yoruichi's ability to become a cat is a quirk from her Shihōin heritage; occasionally Shihōin members are born with the ability to transform into a specific animal.\nAccording to Q&A #552 by Tite Kubo on his fansite \"Klub Outside\", by the time of NO BREATHES FROM HELL, Yoruichi is the new Chairwoman of the Shinigami Women's Association, succeeding Retsu Unohana.\nQuotes\n(To Orihime Inoue and Yasutora Sado) \"People discover their true, inner powers when they want to protect something. Their own lives, status, honor, loved ones, a principle...a fierce desire to protect is the key.\"\n(To Orihime and Sado) \"The heart and soul are closely linked. Your heart reveals what is most precious to you.\"\nReferences\n↑ 1.0 1.1 1.2 1.3 Bleach Official Character Book Souls, page 151\n↑ Bleach manga; Chapter 628, page 7\n↑ Bleach manga; Chapter 116, page 21\n↑ Bleach manga; Chapter 116, page 24\n↑ Bleach manga; Chapter 116, pages 24-25\n↑ Bleach manga; Chapter 118, page 15\n↑ Bleach manga; Chapter 118, page 18\n↑ Bleach manga; Chapter 153, pages 17-18\n↑ Bleach manga; Chapter 153, page 18\n↑ Bleach manga; Chapter 656, page 10\n↑ 11.0 11.1 Bleach manga; Chapter 116, pages 21-24\n↑ 12.0 12.1 Bleach manga; Chapter 159, page 10\n↑ 13.0 13.1 13.2 13.3 13.4 Bleach anime; Episode 206, only shown in the anime.\n↑ 14.0 14.1 Bleach manga; Chapter -107, page 8\n↑ 15.0 15.1 Bleach manga; Chapter 130, page 10\n↑ Bleach manga; Chapter 116, page 26\n↑ Bleach manga; Chapter 83, pages 10-11\n↑ Bleach manga; Chapter 159, page 7\n↑ Bleach manga; Chapter -101, page 8\n↑ Bleach manga; Chapter 130, pages 9-10\n↑ Bleach manga; Chapter 159, page 9\n↑ Bleach manga; Chapter -106, page 4\n↑ Bleach manga; Chapter -107, page 4\n↑ Bleach manga; Chapter 299, page 18\n↑ Bleach manga; Chapter -107, pages 3-4\n↑ Bleach manga; Chapter -106, pages 1-2\n↑ Bleach manga; Chapter -105, pages 11-12\n↑ Bleach manga; Chapter -105, pages 13-14\n↑ Bleach manga; Chapter -102, pages 2-6\n↑ Bleach manga; Chapter -97, pages 6-10\n↑ Bleach manga; Chapter -97, pages 11-14\n↑ Bleach manga; Chapter -97, pages 15-17\n↑ Bleach manga; Chapter 154, pages 11-13\n↑ Bleach manga; Chapter 51, page 11\n↑ Bleach manga; Chapter 51, page 17\n↑ 36.0 36.1 Bleach manga; Chapter 60, page 19\n↑ Bleach manga; Chapter 61, pages 4-10\n↑ Bleach manga; Chapter 62, pages 9-16\n↑ Bleach manga; Chapter 67, page 19\n↑ Bleach manga; Chapter 70, pages 7-16\n↑ Bleach manga; Chapter 71, pages 14-20\n↑ Bleach manga; Chapter 71, pages 24-27\n↑ Bleach manga; Chapter 72, pages 5-7\n↑ Bleach manga; Chapters 74-75\n↑ Bleach manga; Chapter 75, page 6\n↑ Bleach manga; Chapter 75, pages 10-17\n↑ Bleach manga; Chapter 76, pages 3-5\n↑ Bleach manga; Chapter 76, pages 14-17\n↑ Bleach manga; Chapter 78, pages 9-16\n↑ Bleach manga; Chapter 84, pages 1-5\n↑ Bleach manga; Chapter 85, pages 6-17\n↑ Bleach manga; Chapter 86, page 3\n↑ Bleach manga; Chapter 115, page 3\n↑ Bleach manga; Chapter 116, pages 15-21\n↑ Bleach manga; Chapter 116, pages 21-28\n↑ Bleach manga; Chapter 117, pages 18-19\n↑ Bleach manga; Chapter 118, pages 7-12\n↑ Bleach manga; Chapter 118, pages 12-19\n↑ Bleach manga; Chapter 119, pages 19-20\n↑ Bleach manga; Chapter 120, pages 1-6\n↑ Bleach manga; Chapter 120, pages 7-9\n↑ Bleach manga; Chapter 120, pages 10-11\n↑ Bleach manga; Chapter 127, pages 1-9\n↑ Bleach manga; Chapter 129, page 15\n↑ Bleach manga; Chapter 130, pages 1-12\n↑ Bleach manga; Chapter 132, pages 14-18\n↑ Bleach manga; Chapter 133, pages 11-17\n↑ Bleach manga; Chapter 137, page 21\n↑ 69.0 69.1 Bleach manga; Chapter 154, page 10\n↑ Bleach manga; Chapter 153, pages 16-18\n↑ Bleach manga; Chapter 154, pages 8-17\n↑ Bleach manga; Chapter 157, pages 7-19\n↑ Bleach manga; Chapter 158\n↑ Bleach manga; Chapter 159\n↑ Bleach manga; Chapter 172, pages 8-9\n↑ Bleach manga; Chapters 177-181\n↑ Bleach manga; Chapter 182, page 1\n↑ Bleach manga; Chapter 182, pages 2-16\n↑ Bleach anime; Episode 63\n↑ Bleach manga; Chapter 185, page 5\n↑ Bleach manga; Chapter 194, pages 1-17\n↑ 82.0 82.1 Bleach manga; Chapter 195, pages 2-3\n↑ Bleach manga; Chapter 226, pages 4-5\n↑ Bleach manga; Chapter 403, pages 14-19\n↑ Bleach manga; Chapter 403, pages 6-9\n↑ Bleach manga; Chapter 405, pages 6-15\n↑ Bleach manga; Chapter 406, pages 13 & 17\n↑ Bleach manga; Chapter 461, page 11\n↑ Bleach anime; Episode 366\n↑ Bleach manga; Chapter 589, pages 5-9\n↑ Bleach manga; Chapter 598, pages 5-7\n↑ Bleach manga; Chapter 611, pages 9-10 & 15\n↑ Bleach manga; Chapter 613, page 12\n↑ Bleach manga; Chapter 614, page 15\n↑ Bleach manga; Chapter 615, pages 15-16\n↑ Bleach manga; Chapter 617, page 6\n↑ Bleach manga; Chapter 618, pages 11-12\n↑ Bleach manga; Chapter 619, pages 7-14\n↑ Bleach manga; Chapter 624, page 11\n↑ Bleach manga; Chapter 624, pages 8 & 14-17\n↑ Bleach manga; Chapter 625, pages 11-15\n↑ Bleach manga; Chapter 626, pages 2-3\n↑ Bleach manga; Chapter 627, pages 1, 11-12, 16-17\n↑ Bleach manga; Chapter 628, pages 6-8\n↑ Bleach manga; Chapter 629, page 12\n↑ Bleach manga; Chapter 656, pages 9-17\n↑ Bleach manga; Chapter 657, pages 1-17\n↑ Bleach manga; Chapter 658, pages 1-7\n↑ Bleach manga; Chapter 662, pages 3-5\n↑ Bleach manga; Chapter 662, pages 6-8, 11-17\n↑ Bleach manga; Chapter 663, pages 1-2, 4-16\n↑ Bleach: Brave Souls\n↑ Bleach manga; Chapter 116, page 25\n↑ Bleach manga; Chapter 158, page 9\n↑ Bleach manga; Chapter 404, pages 5-6\n↑ Bleach anime; Episode 394\n↑ Bleach manga; Chapter 615, page 15\n↑ Bleach anime; Episode 396\n↑ Bleach manga; Chapter 618, pages 11-12\n↑ Bleach manga; Chapter 619, page 12\n↑ Bleach manga; Chapter 154, pages 12-15\n↑ 122.0 122.1 Bleach manga; Chapter 118\n↑ Bleach manga; Chapter 118, pages 13-19\n↑ Bleach manga; Chapter 119, page 19\n↑ Bleach manga; Chapter 158, pages 4-13\n↑ Bleach manga; Chapter 118, pages 17-18\n↑ Bleach manga; Chapter 299, page 18\n↑ Bleach manga; Chapter 154, pages 12-14\n↑ Bleach manga; Chapter 194, page 15\n↑ Bleach Official Character Book UNMASKED; page 157\n↑ Bleach manga; Chapter 120, pages 3-4\n↑ Bleach Official Character Book UNMASKED; page 151\n↑ Bleach manga; Chapter 403, page 18\n↑ Bleach Official Character Book Souls, page 198\n↑ Bleach anime; Episode 57\n↑ Bleach manga; Chapter 656, page 14\n↑ Bleach manga; Chapter 656, pages 15-16\n↑ Bleach manga; Chapter 662, page 16\n↑ Bleach manga; Chapter 663, pages 9-11\n↑ Bleach manga; Chapter 663, page 15\n↑ Bleach anime; Episode 247\n↑ Bleach anime; Episode 318\n↑ Bleach manga; Chapter 84, pages 1-2\n↑ Bleach manga; Chapter 662, page 4\n↑ Bleach manga; Chapter 159, page 3\n↑ Bleach manga; Chapter 177, pages 6-7\n↑ Bleach manga; Chapters 127-129\n↑ Bleach manga; Chapter 194, pages 1-4\n↑ Bleach anime; Episode 25\n↑ Bleach manga; Chapter 194, pages 1-14\n↑ Bleach manga; Chapter 403, pages 14-16\n↑ Bleach manga; Chapter 119, page 19\n↑ Bleach manga; Chapter 118, pages 13-18\n↑ Bleach manga; Chapter 194, pages 5-7\n↑ Bleach manga; Chapter 619, page 13\n↑ Bleach manga; Chapter 662, pages 3-4\n↑ Bleach video game; Bleach: The Third Phantom\n↑ Bleach video game; Bleach: Soul Carnival\n↑ Bleach video game; Bleach: Soul Resurrección\n↑ Bleach anime; Episode 42\n↑ Bleach manga; Chapter 118, pages 10-11\n↑ Bleach manga, chapter 118, page 18\n↑ Bleach anime, episode 42\n↑ 164.0 164.1 Bleach anime; Episode 47\n↑ Bleach manga; Chapter 130, page 8\n↑ 166.0 166.1 166.2 Bleach anime; Episode 56\n↑ Bleach manga; Chapter 157, page 15\n↑ Bleach manga; Chapter 157, page 19\n↑ Bleach manga; Chapter 158, page 7\n↑ Bleach manga; Chapter 157, page 19\n↑ Bleach manga; Chapter 194, page 9\n↑ Bleach anime; Episode 114\n↑ http://www.j-bleach.com/special/\n↑ Bleach manga; Volume 8\n↑ Bleach manga; Volume 13\n↑ Bleach manga; Chapter 209\n↑ Bleach manga; Chapter 307\n↑ 13 BLADEs., page 253\n↑ https://www.viz.com/blog/posts/bleach-popularity-poll-results-sept-2022?wpsrc=Twitter&utm_campaign=CAR_BleachOctPollResultsTwitterLinkclick_vizwebsite&utm_source=Twitter&utm_medium=social\n↑ Bleach manga; Chapter 392, page 1\n↑ 13 BLADEs., page 255\n↑ Bleach: Official Bootleg KaraBuri+, pages 36-37\n↑ Bleach manga; Chapter 130, page 11-12\n↑ Bleach anime; Episode 62\n↑ 185.0 185.1 185.2 Klub Outside official site\n↑ Bleach manga; Chapter 62, page 9\n↑ Bleach manga; Chapter 62, page 11\nTitles\nPreceded byNew Creation\nGoddess of Flash? -Present\nSucceeded byIncumbent\nPreceded byChika Shihōin\n22nd Head of the Shihōin family? - ?\nSucceeded byYūshirō Shihōin\nPreceded byChika Shihōin\nCaptain of the 2nd Division? -1900 A.D.\nSucceeded byEventually Suì-Fēng\nPreceded byUnknown\nCommander-in-Chief of the Onmitsukidō? - 1900 A.D.\nSucceeded byEventually Suì-Fēng\nPreceded byUnknown\nCorps Commander of the Corrections Corps of the Onmitsukidō? - 1900 A.D.\nSucceeded byUnknown\nPreceded byUnknown\nCorps Commander of the Executive Militia of the Onmitsukidō? - ?\nSucceeded byEventually Suì-Fēng\nNavigation\n"
}