{
  "requested_name": "Yukino Yukinoshita",
  "resolved_title": "Yukino Yukinoshita",
  "url": "https://oregairu.fandom.com/en/wiki/Yukino_Yukinoshita",
  "summary": "SPOILER ALERT!",
  "full_text": "Yukino Yukinoshita\nSPOILER ALERT!\nInformation below contains some spoilers!\n“\nPeople who don’t work hard don’t have the right to be envious of the people with talent. People fail because they don’t understand the hard work necessary to be successful.\n”\n—Yukino Yukinoshita, My Teen Romantic Comedy, SNAFU!\nYukino Yukinoshita (雪ノ下 雪乃, Yukinoshita Yukino) is the deuteragonist of Yahari Ore no Seishun Love Come wa Machigatteiru. She is a student of Class 2J of Sobu High School and the founding president of the Service Club. She was the only member until Hachiman Hikigaya joined her.\nYukino is quite popular. Hachiman, who doesn't recognize the people from his class, recognized Yukino the moment they met in the Service Club.\nAppearance\nYukino is a beautiful teenage girl of average height and slim build. She has fair skin, long black hair that spills over her shoulders and down to her hips, and an ahoge that lays flat atop her head. Adorning her hair are two red ribbons just above each shoulder. Her most striking feature is a pair of large, piercing blue eyes. \nYukino is mainly seen in her school uniform: a black blazer with a white shirt, a red ribbon tie, and a plaid skirt. With her uniform she wears black thigh high socks that are embellished with white stripes, and is sometimes seen with a blue scarf in winter. She occasionally wears a pair of blue-light blocking glasses, given to her by Hachiman, while working on a computer.\nPersonality\nYukino is prideful, talented and extremely smart, but has a tendency to be blunt and point out faults in other people without consideration. She believes that it is the duty of the \"exceptional\" (a.k.a. herself) to help the less fortunate, which Hachiman Hikigaya refers to as her twisted nobility. In the beginning she has a very cold and unfriendly demeanor, earning her the nickname of Ice Queen, although this changes with her character development as she genuinely becomes kinder and friendlier.\nHer personality can be seen as exceedingly haughty to some people. Despite this, she still attempts to understand other people and is kind and compassionate in her own twisted way; she's also better than Hachiman at understanding the emotional side of other people. According to Hachiman, she is peerless in skills and personality.\n \nOn a more personal level, Yukino hates to be pointed out to have a smaller chest than other female characters. She always tries to maintain an elegant and dignified appearance, which is strongly evident when she covered her laughter after Hachiman had presented his cultural festival slogan.\nYukino is a competitive person, willing to win any competition officially and unofficially to prove herself. There are a number of examples of this in the series, such as when she accepted Shizuka Hiratsuka's challenge when asked if she was afraid of losing. Her main driving force is her wish to surpass her sister, going as far as doing what her sister had done in order to show that she could do it just as well.\n \n Despite all of this, Yukino's icy exterior slowly fades throughout the series, revealing her vulnerable side to those close to her. She is a big fan of Pan-san, a panda character. She even has the real manuscript of the story and its stuffed toy, which Hachiman finds surprising.\nYukino also showed her \"cold face\" when Yumiko expressed her idea of Pan-san not being cute. She also asked her friends to be quiet in time of Pan-san bamboo fight. Her obsession for Pan-san is known by both Yui Yuigahama and Hachiman. Yukino is almost always attracted to spots were Pan-san is displayed. Despite her efforts to hide her love for Pan-san, she occasionally slips up and show the fan side of her.\n \nYukino is also fond of cats and anything cat-related. This is shown throughout the anime series and was focused greatly in the Light novels. She even meowed with Hachiman's cat, Kamakura, causing him to ask her about it in a tone that suggested that he was dubious of her sanity. In Drama CD, it was mentioned by Haruno Yukinoshita that Yukino has a hobby of hugging her Pan-san doll and watches cat videos on her computer. Another instance was during a visit at the aquarium, where she was deeply intrigued by the catsharks due to the word \"cat\" being in their name.\n \nAccording to Hachiman, she attracts airheads (Yui and Komachi) and most boys. Even though she doesn't lie, she sometimes beats around the bush of the topics.\nDespite her calm and reserved demeanor, Yukino has a somewhat frightening side. Hachiman describes that she emits an \"evil aura\" when she is seriously angry and expressing her loathing about a certain individual. This can be seen when she expressed her opinion on chain messages senders and the belief that they should be eliminated. It should be noted that she made certain individuals like Sagawa and Shimoda expelled from during her middle school due to chain messages harassment directed to her. She even claimed that she would crush her enemies face-to-face.\nAnother incident was when Hachiman asked her for meowing with Kamakura session. She admonished Hachiman in a way that made Hachiman felt if he spoke another word, she would kill him on the spot. At Chiba Village summer camp, she had a serious argument with Yumiko which reduced the latter to tears.The same was witnessed by Yui and Hachiman when Iroha Isshiki questions of the rumors of Hayama and Yukino.\nYukino sometimes blushes in front of Hachiman, who occasionally sees her excited over little things like going to Destiny Land. In spite of all her \"perfections\", she is incredibly bad at directions as pointed out by Hachiman.\nUltimately, despite her massive pride and her initially cold and haughty demeanor, Yukino is very kind and selfless, and has a genuinely good heart. She's a person who is always ready to help everyone in need, even the ones she doesn't know and the ones who mistreat her.\nHistory\nIn Volume 12 and the drama CD, Yukino mentions that it snowed at the time of her birth, so her parents named her Yukino, which literally means snow in Japanese. Her family is on good terms with Hayato's family. Their families' relationship is not known by many in the school. During her childhood, Haruno would watch over both Hayama and her when their parents were on a business trip. It was also mentioned that the trio has been to the amusement park where Haruno would mess with them, resulting in the fear of rides for Yukino.\nYukino studied with Hayama in elementary school. It was mentioned that in elementary school her indoor shoes were stolen from her about sixty times, but fifty of those times were done by girls in her class. Her upperclassmen harassed her frequently—all of this due to the fact that she is beautiful and popular among boys, thus attracting unpleasant attention. Generally, boys who approached her did so because of their feelings for her, which began from her final year of elementary school.\nIn middle school, she returns abroad to Japan. She transfers into an unnamed school, where all the girls in her class, or rather, the school are desperate to eliminate her. However, none of them attempts to improve themselves in order to best her, to whom she refers as imbeciles with the utmost loathing. \nIn the light novel, Yukino mentions that there were fellow peers whom she thought to be friends asked her for love advice, which Yukino describes as a pretext of girls setting their boundary on male, so that other girls would be conscious of it and anyone who crosses the boundary will be excluded from the circle. Yukino received the same treatment of a thieving cat, even though she was on the receiving end of the confession leading to most gossip.\nIn Volume 7, Yukino describes her experience of being confessed by a boy in a girl's point of view. Yukino states it to be a like a public humiliation and finds it bothersome. She also adds on that it can be known in advance of who is going to confess, based on how \"noisy\" people are around you.\nIt is hinted that Yukino once experienced chain messages harassment, due to her fierce hatred towards those who perpetrated it. She even believes that those kind of people need to be eliminated, which she claimed she did to the two perpetrators never fully introduced to the audience, Sagawa-san and Shimoda-san.\nYukino was constantly bullied for her excellence which is mentioned throughout the series and was also pointed out by Haruno at firework festival. Yukino had compared the facial reaction of Yumiko in the tennis match to be similar to the ones who bullied her in the past. Hayama, who was her classmate all the way from elementary school to the present was unable to solve her bullying problem. Hayama believes that if Hachiman was in the same school as them, things would have been different. In middle school, false rumors about Hayama and Yukino being a couple spread throughout the school, causing a strain in their friendly relationship.\n \nAccording to Haruno, Yukino is mentioned to be relying on others more frequently in the past which is mentioned in Episode 11 of the second season. In the light novel, Haruno mentions that Yukino used to be a cry-baby in the past, but Yukino denies it. In Episode 11 of Season 1 when Minami went missing before the closing ceremony of the Sobu High cultural festival, Haruno offers to help Yukino buy some time in finding Minami, stating that it was the first time she was asking for help, but Yukino expresses that she would just be indebted to Haruno and not a favour surprising her.\nIt is mentioned by Haruno in Episode 12 of Season 2 that Yukino gave chocolate to Hayama on Valentine's Day in the past, but Hayama adds on that Yukino gave chocolate to both himself and Haruno. Yukino also explains that the reason Hayama is reluctant to take any Valentine chocolates was because in junior high, it left an unpleasant amount of attention onto himself after Valentine's Day, to which it has never been elaborated on.\nIn Volume 13, Yukino disbands the Service Club following the conclusion of the contest assigned to Yukino and Hachiman by Shizuka in Volume 1. However, it is later reformed in Volume 14 by Komachi as the Club President with Yukino and Hachiman as members. \nPlot\nFurthermore, it was Yukino's car that had hit Hachiman Hikigaya, from which he saved Yui Yuigahama's dog, on the first day of school. It was mentioned by Haruno Yukinoshita that Yukino was in the back seat at the time of the accident, but Yukino never spoke of the incident to anyone.\nIt was mentioned that Yukino is as popular as Hayato Hayama and Yumiko Miura in Sobu High School.\nStrangely, Yukino lives alone in an apartment bought by her father against her mother's disapproval.\nYukino started bringing cookies, cakes, purchased snacks and tea prepared by herself for her club mates and distributed it with them. Yukino chooses International Liberal art course as her future career path which indicates that she gives up in following her older sister's shadow.\nHaruno schemed to bring Yukino to their family's New Year feast by holding Hachiman and Yui, who were out buying presents for Yukino's birthday. Yukino was hesitant to go with her mother. but did so. This incident was witnessed by someone and resulted in a rumor of Yukino dating Hayato, who was with them along with Haruno to be in a family feast.\nLater, in Season 2 Episodes 11 (adaptation of Volume 11), she tries to give Hachiman her handmade cookies, but fails because of her nervousness and her awareness of Yui's feelings towards Hachiman.\nAbilities\n \nYukino is very good at sports, but has no confidence in her stamina (refer to Episode 3 of the anime); she is ranked 2nd after Hayato Hayama. She is often exhausted after long walks and time spent in crowds. She also can see through people's personality (refer to Episode 4 of the anime) and is always honest with her words, though they are often harsh. In addition, she shows good leadership as seen when she successfully handled the festival committee in Sagami's stead.\n \nYukino's athletic abilities are showcased in Episode 13. She excels at academics, where she's ranked 1st, and is also good extra-curricular activities. Volume 4 mentions that she stands first in all subjects throughout the school. She secured first place in Japanese language, followed by Hayama in second place and Hachiman in third place, an order to which Hachiman referred to as unchanging.\n \nShe also won a match in a judo competition as a substitute for Hayato Hayama on his team using her acrobatic skills. She can also sing and play guitar which is shown in Episode 12, despite the fact that she doesn't like to stand in front of others.\nYukino is good at cooking and is capable of teaching others how to cook, as shown in Episode 1, when she taught Yui Yuigahama how to make cookies, or when she taught others to make chocolate and cookies in episode 12 of Season 2. Yukino also made paella in the OVA episode of Season 1 to demonstrate her cooking skills.\nYukino is also good in playing musical instruments and is capable of singing in front of a crowd which she normally hates to stand in front of. In Episode 12 (adaptation of Volume 6), Yukino was shown playing a guitar and singing. In Drama CD, it was mentioned by Haruno that Yukino loves to play piano.\nAddressed/Nicknames\nYukinon by Yui Yuigahama\nChibapedia, Yukipedia, Catipedia, Ice Cold Princess, Demon Superwoman, Angularnoshita-san' - by Hachiman Hikigaya\nYukino-chan by Haruno Yukinoshita\nGallery\nMain article: Yukino Yukinoshita/Gallery\nVolume 2Volume 3Anime Episode 8Haruno and Yukino\nQuotes\n\"People who don't work hard don't have the right to be envious of the people with talent. People fail because they don't understand the hard work necessary to be successful.\" Yukino to Yui\n\"I think it's important to challenge yourself. It helps make you a better person.\" Yukino to Hachiman\n\"Must I spell it out? That if you’re only capable of inhaling air and spitting it back out, then that air con over there is superior to you? In other words, I’m allowing you to pretend to be my boyfriend, just for today.\" Yukino to Hachiman\n\"You're in the same class and even she can't remember your face. Only you Hikigaya-kun.\"\n\"You simply feel you're being looked down upon because you're aware that you're inferior.\" Yukino to Yumiko\n\"As always, no one can beat you when it comes to underhanded methods.\" Yukino to Hachiman\n\"Nya~ Nya~ Nya~ Nya~\" Yukino to Kamakura (Hikigaya's pet house cat)\n\"Sha~ Sha~\" Yukino to catsharks in the aquarium\n\"Please give me your life.\" Yukino to Hachiman \n\"I don't know any other way to say it, so deal with it.\" Yukino to Hachiman \nEtymology\nThe name Yukino means \"snow\" (雪) (yuki) and \"from\" (乃) (no), which probably shows her cold personality.\nYukino's surname Yukinoshita means \"snow\" (雪) (yuki) and \"under, below\" (下) (shita).\nYukinoshita seems to be based on an area in Kamakura (city), of the Kanagawa Prefecture. Yukinoshita is a location in Kamakura city, where Tsurugaoka Hachimangu Shrine and Komachidori are located.\nTrivia\nYukino's first name is also in present in her family name (Yukinoshita).\nThe four other characters that share this characteristic are:\nYui Yuigahama (Yuigahama)\nSaki Kawasaki (Kawasaki)\nRumi Tsurumi (Tsurumi)\nMeguri Shiromeguri (Shiromeguri)\nYukino is the first and only person in the series to whom Hachiman officially tried to befriend, twice.\nYukino tasted her first ramen with Hachiman Hikigaya and Shizuka Hiratsuka in Kyoto.\nYukino is scared of dogs.\nYukino loves the character named Pan-san to the extent of having an in-depth knowledge of the item and a year passport for the place where the item is usually bought.\nYukino drinks tea in the volunteer club in a fancy porcelain cup with its own dish.\nIn many ways, both Hachiman and Yukino are similar:\nBoth of them were ostracized by their classmates.\nBoth of them have experienced harassment of some sort.\nBoth of them at one point gave harsh criticism to someone (Minami Sagami for Hachiman/Yumiko Miura for Yukino), causing both of them to break down.\nBoth of them prefer to distance themselves from society, and have their own perception on them.\nYukino is a cat-lover as she takes in things which are mostly related to cats which also include coloring books, picture book, and etc. She is often seen reading a book with a black cat on its cover.\nYukino has won an award as Best Female Character Award at the 2015 NewType Awards held in Japan on October 10th, 2015.\nHowever, Saori Hayami (Yukino's voice actress) was only nominated as Best Voice Actress.\nIt is widely theorized by fans that Hayato's \"Yu\" is Yukino herself. At the summer camp, Hayato tried to talk with Hachiman about someone whose name started with \"Yu\" before being interrupted. Furthermore, he also mentioned that an anonymous \"she\", is keeping an eye on Hachiman and it should also be noted that they were once close friends.\nThe song Yukino performed with Yuigahama, 'Bitter Bitter Sweet' as well as the ending song of the \"Kanojotachi no, We Will Rock You♡\" drama CD subtly hints it is directed towards Hachiman.\nYukino's character song \"Kimi Ni Crescendo\" strongly suggests her feelings for Hachiman throughout the series.\nReferences\n↑ Volume 14, Chapter 10: Isshiki took a deep breath and slowly closed the door. She walked up to us and presented a single slip of paper. The paper was filled with details on the establishment of a club along with the words “Service Club” on it. Furthermore, the club president column had “Hikigaya Komachi” written in. Below were Yukinoshita's name and mine. The required details were all filled along with the stamp of approval from the student council. “As you can see, starting today, this room will now serve as the base of operations for the Service Club.”\n↑ 2.0 2.1 Season 3, Episode 11"
}