{
  "requested_name": "Zero Two",
  "resolved_title": "Zero Two",
  "url": "https://darling-in-the-franxx.fandom.com/en/wiki/Zero_Two",
  "summary": "Zero Two (ゼロツー, Zero Tsū) is the main heroine and deuteragonist of DARLING in the FRANXX. She is a human-klaxo sapien hybrid and a member of the APE Special Forces, primarily fighting on the front lines. As an elite Parasite with the codename \"002\", also known as the \"Partner Killer\", Zero Two had always accepted solitude due to her horns and Klaxosaur blood. Despite having no regard for human life or her own and being accustomed to fighting solo, she took interest in Hiro and offered an opportunity to pilot with her, making him her new partner and \"darling\". After Hiro was able to ride with her more than three times, the pair became the 13th Plantation's newest members, piloting the powerful FRANXX Strelizia",
  "full_text": "Zero Two\nZero Two (ゼロツー, Zero Tsū) is the main heroine and deuteragonist of DARLING in the FRANXX. She is a human-klaxo sapien hybrid and a member of the APE Special Forces, primarily fighting on the front lines. As an elite Parasite with the codename \"002\", also known as the \"Partner Killer\", Zero Two had always accepted solitude due to her horns and Klaxosaur blood. Despite having no regard for human life or her own and being accustomed to fighting solo, she took interest in Hiro and offered an opportunity to pilot with her, making him her new partner and \"darling\". After Hiro was able to ride with her more than three times, the pair became the 13th Plantation's newest members, piloting the powerful FRANXX Strelizia.\nOver time, Zero Two developed romantic feelings towards Hiro. However, her animalistic determination to become fully human, along with Hiro's apparent fear of her increasing feral characteristics resulted in the couple briefly drifting apart. When their relationship as partners began to take a turn and slowly crumble, they realized their forgotten memories of their meeting during childhood. The two chose to sacrifice their lives in order to safeguard and ensure the survival of humankind.\nA thousand years later, Hiro and Zero Two's souls reincarnate as a pair of children that meet each other again and rekindle their romance.\nAppearance\nAs a child, Zero Two looked much more like a monster, with red skin, long sharp nails, and fanged teeth. While her eye colour was the same, her sclera was red instead of white. Her horns were also much larger in comparison to her head, and her hair was a lighter shade of pink. In terms of clothes, all she was given was a dark grey cloak and white wrappings from Hiro that substituted for shoes.\n \nGrowing up, Zero Two developed a fair complexion. She had a slender and athletic figure; she was the tallest girl in the squad and even taller than most of the boys as well. She had waist-length, long pink hair with straight bangs covering her forehead and a pair of red horns on her head and a white limiter headband over her horns. She had sharp, turquoise eyes with rings around the pupils and pinkish-red markings on the canthi. \nZero Two's full ensemble was composed of a white military cap with matching overcoat and boots. She was often seen wearing her signature red military uniform, black leggings, and white boots. Zero Two's originally wore the 9's pistil suit: a red bodysuit with white accents. After being assigned to Squad 13, she adopted the squad's standard Pistil uniform: a white bodysuit with red accents.\nAs side effects of aggressively riding Strelizia, Zero Two's fangs and horns can grow at an alarming rate. Her eyes shine red when angered, even while wearing her limiter headband. It once got to the point when her face was deathly pale and her eyes blood red. Her horns could also branch out to the point of being able to touch the ceiling, and her skin color could also revert back to her original red color.\nIn Episode 17, Zero Two was given a flower headband by Miku, which was worn for the rest of the episode.\nIn Episode 21, Zero Two removes her limiter in order to save Hiro, which causes her skin to turn red similarly to her as a child, and her horns to grow and stretch across the room similarly to tree branches.\n \nIn Episode 23, Zero Two merged with her FRANXX and transformed into Strelizia's True Apus form. In this form, its faceplate was replaced by Zero Two's face, in which she appeared with more pronounced lips and pinkish lip color. She had a white helmet with red lines with a blue horn-like weapon on top of it. There was also a veil-like sheet of light behind Apus' helm. Strelizia True Apus' legs changed into a semblance of a white, shoulder-less, and bare-back dress with green accents. In one of the MATO comics, Strelizia True Apus is considered to be Zero Two's wedding dress.\nPersonality\nSince childhood, Zero Two had been alone due to her Klaxosaur blood, always being seen as a \"monster\". The way people treated her as a child made her lose faith in people which is especially seen when she was a child: being very defensive or aggressive when people tried to interact with her. Besides that, Zero Two acted like a wild animal or a feral child, eating with her hands, growling, making other vocal noises instead of speaking and chasing after mice that were near her. However, Zero Two was also shown to a fairly cheerful, curious, and happy girl, and it was during her time with Hiro that shaped much of her personality and quirks in the present, such as her sweet tooth, the way she referred to herself as (\"Boku\"), and the nickname she had for Hiro, \"Darling\". Because Hiro treated her as he would anyone else, whereas others didn't treat her as a human for one reason or another, Zero Two developed a deep admiration and liking towards him. Despite having her memories of the darling from her childhood erased, Zero Two retained some fragmented memories which was why she strived to become human no matter what.\nAs she grew up, Zero Two's personality was rumored to be dangerous, cold, and alluring. She was an elite pilot with the pseudonym \"Partner Killer\", given the mysterious cases of her co-pilots dying after only three sorties FRANXX rides. However, she appeared to be playful towards Hiro and sometimes showed humor; which is evident during their first meeting, in which she teased him and called him a \"pervert\". However, she prioritized her duty as a Parasite more than anything, not because she wanted to protect Papa and the others, but because she wanted to \"become human\". Her outlook on life was quite cynical which is why she didn't bother with a name since they were all meant to fight and die. She had also been a prized military asset of APE and sent to fight on the front lines for so long that she had no regard for human life or her own since they all would become a statistic when they died anyway. When people around her died, she hardly batted an eye at it because, to her, it was just a fact of life that everyone dies. Zero Two always kept people at arm's length with mocking humor, nihilism, and emotional detachment. Zero Two also freely talked about how much she hated their society. However, after seeing Hiro's determination to pilot with her, Zero Two noted that they were very similar and she invited him to partner up with her, despite having fought alone during the majority of her life and never leaning on others for support.\n \nIt is later seen that Zero Two was a very unruly, passionate, fierce-tempered, self-confident, smug, assertive, and carefree girl who hated to follow the rules set up by the adults. She was very outspoken and honest, and unlike the other Parasites, she did not care about Papa and held no respect for him and the other Sages, only seeing them as people who lied to her throughout her childhood. Her seemingly care-free rule-breaking helped break Hiro out of his crippling depression and blind adherence to rules, and the cheerful affection she showed him inspired some of the other Squad 13 Parasites to be more affectionate with each other. Zero Two's behavior was also quite childlike, as evidenced by when she wiped her hands on Zorome's uniform. Zero Two also demonstrated impressive agility, performing somersaults and flips then landing on her feet every time. During the Girls vs Boy feud, Zero Two tricked the girls into believing she would cooperate with them, after which she tricked the boys into walking in on the girls while they were bathing, then proceeding to steal both the boys' and the girls' clothes. While being chased by Hiro, she teased him and laughed while running throughout the house. By doing that, she felt just a little more like a human. While an exceptionally gifted parasite, Zero Two also had extremely odd quirks: being a sloppy eater who uses her hands, often licking people, such as herself, though she didn't like how she tasted; Hiro, who tastes like danger; Ichigo, who tastes sweet; and Ikuno, who tastes like a secret. She also often mused about how she wanted to go in the ocean, dousing her food in honey, and having no sense of personal space.\nIt was also implied that she knew more about the outside world than the other members of Squad 13. She also appeared to be more knowledgeable about different things than the others, as she knew what a \"kiss\" was, what came \"after kissing\" and the meaning behind \"love\". She also urged the Parasites to speak up for themselves and do what they think is right before they regret it and before \"it's too late\". Zero Two also clearly didn't mind whether she's wearing clothes or not, judging how she didn't even bat an eye about Hiro seeing her naked and instead picked on him for holding her panties.\nHowever, soon after, Zero Two became more obsessed than ever to become human and to reunite with her original darling. She became more melancholic and silent, barely speaking or showing any affection to Hiro, despite her behavior in previous episodes. When Hiro would ask her to talk to him about her problems because he wanted them to understand each other, Zero Two coldly rejected him and she stated that they could understand each other well enough by piloting Strelizia. Her obsession later caused her to become violent towards Squad 13, including Hiro the more he tried to calm her down. While fighting Klaxosaurs, Zero Two acted recklessly, disregarding Ichigo's orders and plans, and getting irritated by Hiro getting in her way. Zero Two became much more aggressive both to Hiro and while battling Klaxosaurs, chasing the Klaxosaurs until she was away from the group and then repeatedly stabbing a Klaxosaur corpse she had just killed, maddeningly saying she will kill more Klaxosaurs. When Zero Two started getting a little too obsessed with killing Klaxosaurs during a mission in which Hiro tried to rein her in. However, in the heat of the moment, she ended up choking him and said things that were heard by the others that heavily imply she was going to kill him like so many of her other co-pilots in the past.\n \nZero Two also seemed to only care about herself, so much so that even when Hiro was dying, it seemed like she couldn't be brought to care when Ichigo demanded she takes it easy on him. That having been said, she had deep insecurities about not being human. Though she hates it when other people bring up the fact she's not human and when people call her a monster, she can be very self-deprecating about it herself and even calls herself one. Additionally, her hatred for Klaxosaurs stems from the fear of becoming one herself. Her desire to avoid this, however, caused her to act more monstrous. This problem escalated when she developed a hatred towards mirrors, as she was seen crushing the hand mirror that Hiro had gifted her in frustration, and proceeded to smash every single mirror throughout the boarding house, possibly due to them reflecting her more monstrous appearance. It only gets worse later on, where she came to consider herself a monster not for what she was, but for the horrible things she had done. Zero Two did also not appreciate \"friendship\" and never took it seriously because she was convinced that Squad 13 would never accept her, so she didn't even bother trying to be nice to them or show consideration for their lives. Zero Two didn't display any concern for the lives of any pilot besides Hiro, because she thought of them the same she thinks of herself: they are all meant to live and die fighting Klaxosaurs. However, it is clearer in the following episodes that she really had come to care about the other Parasites in Squad 13 and felt guilty for betraying their trust but stubbornly willed herself to keep displaying no empathy for them and to outwardly insist that she never considered them true friends, just temporary allies.\nHowever, after she realized that Hiro was indeed her darling from her childhood, Zero Two felt extremely apologetic and distraught about her actions. With Ichigo fed up with Zero Two's antics, however, she forcefully disallowed her and Hiro to even visit. Ichigo even proposed to Nana that unless Zero Two were to be kicked out from Squad 13, they would not cooperate at the upcoming mission, much to Zero Two’s disbelief and frustration. Later, Goro was finally able to convince Ichigo to let Zero Two visit her darling. However, when the squad arrived at Hiro's hospital room, he was not there. Hiro’s sudden disappearance enraged Zero Two; she felt deceived and proceeded to beat up the members of Squad 13, mainly Ichigo. When Hiro came back and unintentionally called Zero Two \"a monster\", Zero Two finally broke down, leading to her deportation. Later when Hiro finally reunited with her, Zero Two was afraid of being touched and seen by him, because she considered herself a monster and didn't think she deserved forgiveness after what she had done. However, after Hiro fully forgave her, apologized for calling her a monster, and promised her that they would talk out their problems and always be together, they confessed their love for each other and became an official couple. After this incident and officially being accepted by Squad 13, Zero Two admitted that she finally understood what \"being human\" really meant; living together with other humans, helping each other while also being true to their feelings. Thanks to this discovery, Zero Two's personality reverted back to her former personality, becoming much more friendly, responsible, cheerful, and composed. She also accepted herself, as she could happily look at herself and her horns in the mirror. Despite that, she was concerned when Hiro turned into part-Klaxosaur like herself, stating that she wanted him to remain human. Zero Two was able to acknowledge her mistakes which is why she was determined to do everything right, especially in regards to her friends. She also felt guilty over her past actions and started having nightmares over the stamens she had consumed.\nZero Two regained her curious and carefree nature, doing things in her own pace and stating that she was interested in traveling the world like the Princess in her book. She also retained her playful personality as she was visibly seen to be sassy and energetic, not afraid to get what she wanted to without putting up a friendly fight. She began to exhibit a fascination with the extent of a human’s capabilities, as she remarked humans were wonderful at being able to leave a mark for the future via reproduction, something her body was incapable of doing. Furthermore, she became more open to her fellow comrades in Squad 13, openly socializing with them and enjoying their company, as she teaches them how to fish, encourages them to learn to cook for themselves, and helps plan Kokoro and Mitsuru’s wedding. She became very protective of Squad 13 and encouraged them to explore their true feelings and taught them concepts only available to the outside world. She also felt extreme anger towards those who interfere with the squad’s personal lives, as she was visibly dismayed at Papa and the others for destroying Squad 13's brief period of happiness and erased Kokoro and Mitsuru’s memories due to their decision to get married. \n \nHer relationship with Hiro became much better and Zero Two came to cherish and love him more than anything, to which she finally understood Hiro's words where he wanted them to understand each other. The two had shown unconditional love for one another and knew that their bond could overcome whatever obstacle fate threw at them. Zero Two was seen to be a very determined girl, as well as very devoted to Hiro, going great lengths for him on the cost of her own safety, and even mentioning that she didn't care about anything as long as he was with her. Zero Two also became closer to everyone in Squad 13, which is particularly seen how protective she became of them, when she became ecstatic upon seeing them coming to her aide during the fight against VIRM, and how worried she was when Ichigo and Goro fought off a VIRM soldier. As much as she loved Hiro and her ultimate dream in life was to be with him forever, she was burdened with the knowledge that him ingesting her blood from when they were children was gradually turning his body into that of a klaxosaur, and she casted all the blame for this on herself to the point she was willing to make whatever sacrifice was necessary to prevent him from losing his humanity. She decided to risk her life to protect the lives of Hiro and others by going off to space and fighting VIRM alone, but she also rationalized with Hiro that she deliberately separated herself from him because she couldn’t live with herself if he became a klaxosaur as long as he remained with her. Additionally, Zero Two became emotionally prepared for the strong possibility that she and Hiro would have to part ways in the grounds that they are different creatures and the dystopian society they lived in would never allow them to be together. However, when Hiro proved his resolve to stay with her no matter what so they can see the outside world together and create their own destiny, she gave in and accepted his vow to never let her go. When she and Hiro went off to space to fight VIRM's home planet, Zero Two was moved to tears by her friends' words in that they would always wait for them to return. Because of this, Zero Two’s perspective on humans changed drastically; she concluded humans are strong beings for their perseverance and ability to leave behind a mark for the future, and fight for what they believe was the right cause. Right before her demise, Zero Two and Hiro were completely willing to sacrifice themselves to save the Earth and so their friends and all the other people could live a good life. They state that even if they would die, the paths they had walked would never fade since their friends would take it even further.\nHistory\nZero Two was created by Dr. FRANXX out of the Klaxosaur Princess's DNA. Many specimens like Zero Two herself were born but failed to survive; making her the only successful human-klaxo sapiens hybrid. Dr. FRANXX also created clones using Zero Two's cells; the 9's, but they didn't inherit the Klaxosaur blood. Due to Zero Two being the only specimen with Klaxosaur blood to survive, she was decided to operate the Star Entity; a collective mass of Klaxosaurs which can only be operated by a Klaxo-sapien, on humanity's behalf. Because of her high Parasite potential and potential in general, she received the code number \"002\".\n \nZero Two did not receive the same regular training as other children in the Garden to become a Parasite, since she had been trapped in her room for as long as she could remember, which she described as being the entirety of her world. Occasionally, a woman would enter Zero Two's room to bring her food, and she thought that she was probably a stand-in for a mother. She would bring Zero Two food and pet her head. One day, she appeared for the last time with something that wasn't food; a picture book called \"The Beast and the Prince\". Zero Two tried to eat and break it at first, and her \"mother\" flipped open the page to which she was amazed by its bright colors and different shapes. Though it had words, she couldn't read them. Despite that, Zero Two described the book as her first \"pretty thing.\" Thanks to the picture book, Zero Two was sure the outside world surely had many more things to offer; though she added that she was half right and half wrong.\n \nOne day, Zero Two was taken along for experiments. In the testing room, Dr. FRANXX was amazed how she developed such a human form. With Zero Two tethered, a laser was centered on her palm and when it fired, she screamed in pain. Dr. FRANXX was amazed at how quickly her wound healed and how her skin regrew. After her testing, Zero Two was isolated in yet another room. In the room, she was seen struggling against an adult to get her picture book back, and she soon managed to take the book back and the woman gave up. After that, Zero Two was put through even more painful experiments due to her special abilities. Since Hiro had witnessed Zero Two's suffering several times by then, he made up his mind that he was unwilling to watch her suffer anymore. When Hiro came to rescue her, scaling one of the trees near her cell, Zero Two had just gone through testing and was curled up on the floor, taking the picture book in her bosom as a sense of comfort. Hiro shattered her window with a searchlight and although Zero Two was initially aggressive, she was moved by Hiro's tears and began crawling towards his outstretched hand. When they got out however, the branch broke and they fell to the ground, causing Hiro to lose consciousness.\nZero Two proceeded to carry Hiro through the snow and she was amazed by the outside world. She noticed a pair of mice and chased after them. When Hiro regained consciousness, he saw her about to eat one of them. When he tried to stop her, she bit his hand and he caressed her head to comfort her, which reminded her of her ‘mother’, and she let go. Hiro then realized that Zero Two couldn't understand him but he introduced himself anyway. Though he asked for her name, she couldn't answer, less speak, but Hiro saw that her code was \"002.\" He thought of a name, first thinking \"Oni\" and then \"Zero Two\", but he wasn't particularly fond of either of those names. However, when Zero Two began trying to say \"Zero Two\" continuously, to which Hiro thought that he should have thought of a better name but began to call her that himself. After that, the two continued and enjoyed their \"adventure\" together. Zero Two also noted that although she didn't understand his words, she knew his voice called to her, and she saw and learned new things with him, as well as walked with him. He also gave her some candy, to with Zero Two reacted fondly to. Now feeling comfortable with Hiro, Zero Two showed him her book, \"The Beast and the Prince\". As Hiro began reading, a group of adults appeared, looking for them. The two hid and Hiro promised to protect Zero Two.\nThe two continued to flee from the adults and eventually ended up sitting under a mistletoe, with Hiro continuing reading the book. Hiro noted how sad the story was due to the fact that the Beast Princess and Prince couldn't be together since both weren't human. This made Hiro relate to his current situation, giving Zero Two a sad smile to which she wryly smiled back at him. \n \n Soon after, Hiro said that they should get going, but Zero had scraped her knee and couldn't walk well. He searched for something to bandage it but was forced to lick her blood instead. With Hiro kneeling before her, Zero Two confused his pose with the prince in the page mentioning \"marriage\", proposing. As Zero Two questioned \"marriage\", Hiro explained what it was and said that they would marry once they escaped. He told her he wanted to be with her forever too and become her darling. She began crying tears of joy and hugged him close, now thinking that she could have something beautiful with him. However, they were interrupted and cornered by a group of adults. Though Hiro tried to protect her, he was shot and fell to the ground bleeding. As Zero Two tried to resist from being captured by the adults, she saw Hiro who had been shot and cried and shouted out for her \"darling\".\n \nAfter that, their memories were erased. However, Zero Two's memories couldn't be completely erased since the adults noted that there was some strong force protecting the memories she made with Hiro. In the aftermath, Zero Two did retain some vague memories from the meeting with Hiro but she forgot about the person she made the memories with. She was devastated by the fact that they couldn't be together due to the apparent fact that they weren't the same creatures with blood of different colors. To be sure she could become human and never forget about the memories with her \"darling\", she ate the picture book's pages and began speaking and acting likeas had learned from her meeting with Hiro. Every once in a while, she snuck back to the tree, hoping to find Hiro waiting for her there. At one point, when she got to the tree, she was surrounded by Klaxosaurs.\nSince Zero Two's meeting with Hiro did leave a huge impression on her, she swore since that day to become human since if she were like him, they could always be together. To make her even more determined, she was also convinced into thinking that she could become human by killing Klaxosaurs by Papa and the others.\nTwo years prior to the main storyline, Zero Two fought alongside the squad of Plantation 26 in a critical battle. She was reckless and showed no concern for others; causing the death of 090's partner.\nEpisode 01: Alone and Lonesome\nZero Two is seen on the carrier flight with Dr. FRANXX and Nana. She says she wants to take a bath and asks if there is an ocean at Plantation 13. Nana says there is no such thing and asks if she can just take a shower. Zero Two replies she is in the mood for swim. She then licks her wrist and says she hates how she tastes. Upon landing, Zero Two runs off from the others and mocks them with a smirk and throws away her hat.\nZero Two is later spotted by Hiro skinny dipping in a lake near Miltisteinn. She disappears under the water's surface, prompting Hiro to assume she is drowning and in need of rescue. Zero Two jumps out of the water with a live fish in her mouth. She spits out the fish and licks herself believing that she will taste \"salty\", to her disappointment. Zero Two, in the nude, begins to converse with Hiro and thanks him for jumping in to save her. She then tackles him into the water and licks his cheek, remarking that he tastes \"dangerous\" and she loves it. His \"taste\", coupled with the fact that he was not afraid of her horns prompts her to propose that he become her \"Darling\". Before Hiro can accept, Nana and 081 arrive to retrieve her. Hiro calls for her, ad asks her for her name. Dismissively, she questions if parasites even have names. She tells him her code is 002, and that everyone calls her \"Zero Two\".\nDuring the welcoming ceremony, a klaxosaur appears and attacks the new FRANXX, damaging the garage. Zero Two piloting Strelizia saves the Parasites, notably Goro and Ichigo, from a would-be particle beam. Strelizia and the klaxosaur battle, causing catastrophic damage to the outer wall of The Plantation. Strelizia is overcome and is flung into a section of The Plantation, crashing where Hiro had been viewing the battle.\n \nThe lifeless body of Zero Two's partner, 081, drops out of the derelict Strelizia. Zero Two emerges from the wreckage, bloodied, and tells Hiro she'll have to pilot the Strelizia alone as \"she always has\". Hiro reprimands her that if she pilots a FRANXX in her current state, she'll die. Zero Two claims she isn't afraid of death, and if she doesn't do it countless more people will die from the klaxosaur attack. Hiro declares that he will ride with her. Zero Two asks if he is ready to die which Hiro states \"he doesn't know but he may very well be if he cannot pilot a FRANXX\". Zero Two sees Hiro's tears and extends her hand to him, mirroring their initial meeting at the lake. She tells him of how it has been a long time since she's seen a human cry, and how it makes her heart race. Hiro takes her hand and she pulls him into the cockpit, declaring him her \"Darling\" and they kiss. The kiss reactivates the Strelizia and the Hiro-Zero Two pairing unlocks its \"Iron Maiden\" form to the amazement of Dr. FRANXX and everyone else.\nIron Maiden Strelizia overpowers the klaxosaur and destroys its core, effectively killing the mechanical beast. In the aftermath, repairs are being done to the damage of the klaxosaur attack, Zero Two carrying an unconscious Hiro alight from the now deactivated Iron Maiden Strelizia. Nana tells Squad 13 that Zero Two works directly under APE and possesses Klaxosaur blood. Ichigo Realizes Zero Two is the girl from the rumors Zorome was talking about, in which her partners die after three rides.\nZero Two gazes into the sunset and shoots Hiro a gleeful smile, saying, \"I found you, my Darling!\"\nEpisode 02: What it Means to Connect\n \nZero Two unexpectedly visits Miltisteinn to have breakfast with Hiro, but much to the bemusement of the other parasites. She completely covers her meal in honey and proceeds to eat it with her bare hands to the disgust of all the Parasites except Hiro. She is approached by Zorome in an attempt to \"hit on her\" while putting down Hiro. She begins to wipe her honeyed hand on his uniform, mortifying Zorome. Zero Two takes the pitcher of honey and starts sitting with Hiro and begins pouring honey all over his breakfast as well. When asked by Hiro as to whether or not he actually was able to activate and pilot Strelizia with her, she reassures him, stating that he was \"amazing\" and calls him \"darling\", much to the shock of the other Parasites (and to Ichigo's chagrin in particular).\nNana enters the room and informs them that Zero Two is on \"standby\" awaiting further orders from HQ. She also commands her to go back to her own table before Zero Two leaves with her. On the elevator, Nana criticizes her for running off. Zero Two antagonizes Nana by stating that she merely wanted to have breakfast with her darling. Nana orders her to avoid the parasites, as they are nowhere ready for Zero Two’s league. They arrive at the city and Zero Two remarks how she feels like she suffocated there.\nLater in the hangar, Zero Two is confronted by Ichigo. Ichigo thanks Zero Two for saving their lives but warns her to stay away from Hiro so as not to get his hopes up and hurt him, declaring that she is not part of \"their\" squad. Zero Two approaches her and asks Ichigo what she is to her darling. Ichigo states that she is the leader of the squad. Zero Two begins to sniff her and lick her cheek astonishing Ichigo. Zero Two says she tastes \"sweet\" and that she likes her taste before gleefully leaving.\nDuring the discussion for Hiro's parasite promotion test, Zero Two volunteers to be his partner, him being her darling. Zero Two's proposal is met with harsh resistance by Ichigo, stating that she is not part of the squad and that if the test is merely to measure Hiro's aptitude it should work with her; having Zero Two participate would be unnecessary. Nana informs Zero Two that HQ hasn't authorized the use of the Strelizia so Hiro will have to perform with one of his squadmates. Zero Two concedes, stating that her injuries haven't completely healed yet. She allows Ichigo to have Hiro, telling her to go for it \"this one time\" and to make sure to take care of \"her\" darling.\n \nAfter Ichigo's subsequent failure to properly pilot with Hiro, Zero Two is shown flipping her hair in the wind and triumphantly eating her lollipop while leaving the training grounds.\nEpisode 03: Fighting Puppet\n \nZero Two is first shown waiting for Hiro to finish his solo training. After he finishes, he finds her asleep in an atrium. Once she wakes up, she takes him around the facility. However, due to Hiro's status, he has limited access to certain areas, whereas Zero Two has an S-Class ID which implies unrestricted access. Thinking quickly, Zero Two takes Hiro's hand and they \"waltz\" through the doors, tricking the system.\nUpon gaining access, Zero Two leads Hiro to the Inner City of Plantation 13. While Hiro is awestruck by the view, Zero Two overlooks the city melancholically. Hiro shoots her a grateful look, and she asks him why he's staring at her. Hiro replies that he's trying to think of a name for her. Zero Two says she is fine with just Zero Two, even though Hiro thinks it must be boring being called by her code number. She then jumps the rail and begins to walk out onto the ledge. She expresses her depressive view of the city, its inhabitants and life. Zero Two then asks Hiro to run away with her, offering to get him out of the plantation. Before Hiro can answer, Zero Two pretends to fall but actually somersaults back to the safety of the balcony. She lightly jokes that she was kidding.\nZero Two appears next when the underground mission against the Conrad-class klaxosaur went awry. While the team celebrates their apparent victory, Zero Two shows up in a dark corner remarking that it isn't over. All of a sudden a swarm of similar klaxosaurs and a giant version of the initial one begin to ambush the FRANXXs. As the situation grows increasingly dire, Zero Two consistently prods Nana into letting her ride with Hiro in order to save them. Nana persistently denies her, till Hiro submits the Zero Two ride with Mitsuru, the only available \"official\" stamen, in order to save the squad. Zero Two is greatly disappointed in Hiro, giving him the silent treatment as she begrudgingly embarks partnered with Mitsuru.\nThe pair then race to rescue the squad. Initially, Mitsuru pilots the Sterlizia on par with Hiro, proposing that Zero Two take him on as her \"official partner\". Zero Two puts him to the test and goes \"all out\", prompting Nana to initiate the retrieval of Strelizia. A bloodied deactivated Strelizia emerges in the aftermath. Zero Two emerges from the robot and gives Hiro a light wave and smile. Mitsuru does not emerge from the FRANXX. He is shown to have passed out in the cockpit, bloodied and broken, on the brink of death. Zero Two says Mitsuru is not fit to be her darling, only Hiro is.\nEpisode 04: Flap Flap\n \nIn the aftermath of Mitsuru's near-death experience, Zero Two is told to return to the frontlines by Nana on Papa's orders and the Strelizia is grounded, much to Zero Two's dismay. She remarks all the parasites are nothing but an annoyance and will die sooner or later anyway. Nana counters they are still her fellow parasite comrades, which Zero Two scoffs. Hachi states she is special, which offends Zero Two because she assumes he means about her not being human, but he elaborates he meant her abilities.\nZero Two looks at Strelizia in the docking lounge as the plantation goes into mobile mode. Nearby, Hiro sees her and hides. However, Zero Two realizes he is there but she simply walks away. Afterwards, she finds Hiro in the bathroom as he takes a bath and she walks into the bathtub, cornering him against the wall. She asks him to run away with her and leave his \"weakling\" comrades. Her mood dampens by Hiro's visible fear of her as he stares at her horns and gulps. She asks him if he's like everyone else; if he thinks \"she's a monster\". Before he can reply, the alarm goes off.\nA giant centipede-like razor klaxosaur attacks the carrier sent to acquire Zero Two. Plantation 13's Parasites are deployed to combat it, only to be ambushed seemingly by another klaxosaur. Zero Two and Hiro change into their suits and rush into the situation room when Nana tells her that it won't change her decision, that the Strelizia is not authorized to \"fly\". Zero Two asks why is there an assault ship here, much to Hiro’s surprise.\nAt this point, armed security personnel arrive to collect Zero Two, as Papa has ordered her to return with Strelizia to the front lines by any means necessary. Zero Two gives a long goodbye to Hiro remarking about how she \"felt like things could work out too\" and that she wanted to be with him. In lieu of a kiss, Zero Two pokes his forehead with her horns and departs with the soldiers.\nWhile being escorted by the guards to the carrier, Hiro catches up to her, however unable to reach her due to restriction system. Hiro begins to shout out to her and apologize for his prior hesitation in the bath. Hiro explains that his fear was not of her inhumanity, but a lack of his own resolve. Hiro confesses that he doesn't care about riding the FRANXX and that he just wants to ride with Zero Two, begging her not to go. Zero Two pauses in the face of his confession. She then does a backflip, disarming one guard and using his rifle to crack the glass barrier above Hiro. She performs an aerial flip, breaking through the glass to reach Hiro. Now reunited with a bashful Hiro, she coaxes him to reaffirm his confession, asking him, \"You wanna ride me, huh?\". Hiro affirms that he does and Zero Two asks him to say it one more time; he then shouts it out for her.\nZero Two takes Hiro in her arms and they assume their waltzed pose in order to pass the security restrictions and break through to the Strelizia. Once in the cockpit, Nana orders them over the comm to get out and that they do not have permission to launch. Zero Two declares she's going out with her darling and cuts Nana off mid-sentence. Hiro pauses, due to his anxiety of failing to pilot a FRANXX yet again. Zero Two reassures him that he can do it, later rephrasing it to \"they\" can do this. Now revitalized by Zero Two's encouragement, they pair-up and the Strelizia destroys the carrier and takes to the skies, en route to rescue the Parasites once again.\nRealizing the Klaxosaur is too long and big, the squad comes up with a strategy; by restraining it and opening it up, Strelizia will be able to go inside it and reach the core. The other FRANXX do this, with Delphinium and Chlorophytum opening its mouth whereas Genista and Argentea hold its body down. Strelizia enters through its mouth and gives Delphinium (Ichigo) a smirk, which catches Ichigo off guard momentarily. Strelizia travels inside the Klaxosaur and destroys the core as soon as Strelizia reaches the end of the Klaxosaur.\nEpisode 05: Your Thorn, My Badge\n \nZero Two is seen waiting for Hiro so that they can have breakfast together. She insists on sitting beside Hiro at Futoshi's expense, thereby forcing Futoshi to sit at the girl's table by Kokoro's invitation. While Ichigo gives the morning prayer, Zero Two is hard at work slathering her entire breakfast (and Hiro's) with honey. She then begins feeding Hiro to the disgust of Goro and the jealousy of Zorome. Futoshi and Kokoro imitate them while Ichigo silently ponders into her teacup.\nAfter breakfast, Hiro gives Zero Two a tour of The Birdcage and their life as parasites. Zero Two then divulges that she'll soon be living there too, her announcement causes displeasure among the Parasites, especially from Ichigo who immediately confronts Nana about this development. Ichigo accepts her stay as the will of Papa then personally sees Zero Two to her accommodations. Ichigo prepares Zero Two’s room in the attic, much to Zero Two’s disappointment that Ichigo won’t let her share a room with Hiro. Ichigo lays down the rules, making Zero two call her “bossy”.\nDuring the joint briefing between Plantations 13 and 26, Hachi informs them that Zero Two and the Strelizia will guard the main pipeline during the kissing. The plan is met with strong opposition by the leader of the Plantation 26 parasites. He recounts an operation from 2 years prior with Zero and his Parasites. He denounces Zero Two as \"reckless and shows no concern for others\". He even divulges that she is the reason his previous partner is dead. Zero Two utters \"Weaklings die, Big Deal\". 090 is about to attack Zero Two until Hiro intervenes and defends her honor, thus defusing the situation.\n \nLater that night, Goro spots Ichigo and Zero Two sneaking out at midnight. Apparently Ichigo pulled Zero Two aside to ensure she stay in line for the upcoming mission. Zero Two dismisses her for being bossy again and begins to leave. Ichigo grabs her wrist and begins to beg Zero Two not to push Hiro too hard. Ripping herself from Ichigo's grasp, Zero Two responds that \"darling (Hiro) said that he wanted to ride with her\". Ichigo continues to beg her not to put a heavy burden on Hiro. Zero Two questions Ichigo if she wants Hiro and reminds her that she tried to ride with him and that \"they\" didn't work. Ichigo exclaimed to leave her out of it; Zero Two tells her that she should stay out of it. Ichigo asks if she's trying to \"suck him dry\", Zero Two declares \"darling belongs to me\". An agitated Ichigo warns her that Hiro could die. Zero Two brushes it off saying that he could, and if he did then he wouldn't have amounted to much. Angered and frustrated, Ichigo calls her heartless and inhuman. She then slaps Zero Two hard so hard that it damages her headband, knocking it off. Zero Two becomes enraged, her eyes and horns start to glow a malevolent red. The red-eyed Zero Two, glaring at Ichigo, questions her on what it means to be \"human\". Frightened by the being before her, Ichigo runs back to the birdcage in tears and it starts to rain. Zero Two is calmed by the feeling of the rainfall.\n \nThe next morning, Hiro goes outside and approaches a soaked Zero Two by the lake. It is implied she spent the rest of the night out in the rain. Zero Two tells him that everything smells nice after it rains. Zero Two reminisces of the time they first met. Hiro thanks her, stating that the reason he's still there is because of her and that she gave him the chance to pilot a FRANXX. Zero Two unzips his uniform revealing a blue tumor. Zero Two asks him if it hurts and if he wants to walk away from being her partner. Hiro admits that it hurts, but confirms that he'll ride with her. Zero Two smiles and begins to joyfully laugh and dance, having found someone willing to give his life for her.\nEpisode 06: DARLING in the FRANXX\n \nOn the dawn of the mission, Hiro spots Zero Two exiting the pistil changing room. She glances back at him but doesn't approach as Ichigo is present. Hiro quickly ends his conversation with Ichigo and meets up with Zero Two. She asks him if he is ready and he affirms he is.\nDuring the defence of the kissing, Zero Two and Hiro and oversee the battle while guarding the main pipeline, much to her boredom. Zero Two remarks that the Plantation 13 parasites' tactics are all over the place and that they're barely hanging in there, as they are being overwhelmed by just 4 Conrad-class klaxosaurs, in contrast to the other squad's calculated and efficient method of combat. Hiro asks Zero Two why she fights klaxosaurs because it looks like she enjoys it. After a moment of silence, she replies that the reason is that she's a monster. Zero Two shoots the question back at an unsure Hiro, who shrugs and states it's to protect Papa and all the adults in the plantations. Zero Two remarks his answer is lame. Hiro proposes that if the squad needs their help they should move out, to which Zero Two agrees.\nZero Two and Hiro charge into battle and begins killing the klaxosaurs in bundles. Ichigo tells Strelizia (Zero Two) to go back but Zero Two ignores her. 090 also tells Zero Two to return to her position but, as Zero Two doesn’t reply, Hiro says they are only helping their teammates. Once the minor klaxosaurs have been wiped out due to the collective efforts of both squads (and mostly the Strelizia), Target Beta, initially a massive cube-klaxosaur with horns transforms into a humanoid form and begins its advance to the pipeline. Hiro's health deteriorates as a result of clearing the minor klaxosaurs, Zero Two checks in on him reminding him that Target Beta is a real threat. Once the parasites pin down Target Beta, the Strelizia flies into the air. Hiro aims to finish it in one-blow with a downward thrust as his final act. The attack was seemingly successful as Target Beta collapses. However, Target Beta punches Strelizia off and quickly reassembles itself once again, this time into a battering ram preparing to attack Strelizia. Then, Strelizia deactivates, showing Hiro has died at the cost of that last strike.\nThe Strelizia takes the full brunt of Target Beta's attack, sending it crashing into the main pipeline. With the link between Zero Two and Hiro now disconnected, Strelizia enters Stampede form, much to the horror of his squadmates. She attempts to retaliate, however futile and is embedded in the pipeline as Target Beta continually rams into it. Zero Two devolves into a primal state as she desperately tries to defend against the unending attack. Hiro miraculously revives, and the traces of the tumor rapidly disappear. She is calmed by Hiro with an embrace, declaring he's her partner and he won't leave her alone. The Strelizia returns to it's Iron Maiden Form and knocks down Target Beta, rekindling the hope and amazement of everyone (especially Dr. FRANXX). Squad 13 repeats the earlier maneuver but with an upward strike. The attack shoots Target Beta into the sky as wings of light appear and impale it, finally putting an end to the gargantuan.\nIn the aftermath, a fatigued Zero Two is carried by Hiro of out Strelizia this time. She hears Hiro tell her that he wants to be her wings and he'll be fine afterwards. Standing apart from the celebration, Zero Two watches them. She turns to the Strelizia contemplating that she has to kill more and more klaxosaurs.\nEpisode 07: Shooting Star Moratorium\nZero Two tells Dr. FRANXX that they didn't have to come all the way. Nana introduces Hiro to Dr. FRANXX, the creator of FRANXX. She begins to introduce a boy, but he stops her. He approaches Hiro and says that he's the first person to survive Zero Two. He says that he has an interest in them. Hachi tells the doctor that Strelizia and Code 002 are transferred into Plantation 13's purview. He waves at him and says that the geezers already told him. When Hachi announces that they're officially partners, Zero Two hugs Hiro.\nDr. FRANXX tells Hiro not to let him consume his emotions if he wants to always be her partner. Otherwise, he'll suffer.\n \nLater, after the successful kissing with Plantation 26, Squad 13 is given a special vacation. Zero Two, along with a majority of the other children, is excited to be at the ocean. She pulls Hiro to the water. She splashes him and they laugh together.\nHiro follows Zero Two into the water and the three boys begin watching them. She notes how nice it feels to swim in the ocean. Hiro seems embarrassed when he looks at her and she asks what's wrong. He says she looks good, but he can't look her in the eyes. She thanks him for all he did for her.\nZero Two seems to be about to kiss Hiro, but she instead licks his cheek. She teasingly asks what he was expecting. She says that a kiss is a declaration that the other person belongs to you and you should only kiss the person you love. She asks if he maybe kissed someone else. Before he can answer, Goro, Zorome, and Futoshi pull Hiro under the water, leaving her alone in the water.\n \nMitsuru tells the group that he found something strange and leads the group through a thin pass. Zero Two walks along at the back of the group through the pass and the forest path before being brought to what appears to be a city. Zorome comments that it's nothing like the cities that adults live in. Kokoro asks if people live there, and Mitsuru replies that he'd never heard of anyone living outside the plantations.\nIchigo comes to a bookstore where she sees a poster featuring a kissing couple. She thinks of her and Hiro's kiss and touches her lip. Zero Two suddenly says behind her that she did it with Hiro. Ichigo is startled and asks her what she means. She answers \"kiss\" and says that she probably isn't ready for it yet. Ichigo says that she has too. Zero Two asks with who and says that it should only be shared with someone special. She asks if that person was special to her. Before she can answer, Goro calls her and he and Hiro wave them over.\nThey walk back to the rest of the group and Miku says that she's exhausted. Kokoro agrees. Zorome wonders about the city and Ikuno says that they can be sure that it was part of civilization. Goro asks if people lived there in the past. Zero Two answers that they abandoned it and that humans used to live on the surface. She says that there are tons of places like that around the world.\nBack at the beach, food had been delivered. They all begin eating and Goro hands Zero Two a shish kabob. She tells Hiro that she's going to go swimming before running off to the sea.\nHiro asks why they think humanity abandoned the surface and wonders if humanity hadn't started extracting magma energy if the klaxosaurs wouldn't have shown up. Mitsuru asks if he's doubting Papa and the rest. He says that they moved into plantations in order to protect mankind. This pumps Zorome up, to Mitsuru's disdain, and Futoshi as well. Zorome asks if he agrees and when he shyly answers, he asks why he's acting so aloof when he's their teammate. Miku says that they have to put in both his and Naomi's share of the work. Kokoro says that she finds it reassuring that they're with them. Futoshi and Goro agree. Ichigo stands and officially welcomes him and Zero Two to the squad. He thanks them all.\nWhen Zorome finds a crab, Futoshi wants to eat it. Mitsuru is surprised that he still wants to eat, causing the others to laugh. Zero Two watches this from the water.\n \nThat night, while everyone but Hiro and Ichigo are asleep, Zero Two watches the shooting stars from a rock.\nEpisode 08: Boys × Girls\nAs the parasites are fighting a klaxosaur, it spews goo. It leaks into the cockpits and melts the girls' parasite suits. Though the boys begin spacing out, they don't tell the girls and they finish off the klaxosaur. Hiro finally tells Zero Two and the rest of the girls realize what's happened.\nThe girls cover themselves with a towel and glare at their partners. Besides Zero Two, who doesn't seem to mind. When Hiro tries to defuse the situation he says that Zero Two said it is better that parasites are a bit pervy, which she confirms. This annoys the girls further.\n \nAs a result, the girls split the house which Zero Two finds very strange but upon seeing Hiro she ignores the split and spends time close to him. As the boys blocked off the kitchen Zero Two walks in and Miku attempts to follow her, but the other girls pull her back. In the yard, she plays with a ball as Hiro says that everyone's gotten too stubborn and they need to do something. But she thinks the opposite and that they need to spice it up a bit.\nZero Two approaches the girls and licks Ikuno and saying she tastes a secret and begins to walk away, but is halted by Miku. In one of the girls' bedrooms, she was asked by Miku whose side she's on. She says that they're just playing around, but Ichigo says they're serious. Hearing that, Zero Two decides to play along.\n \nShe changes the girl's only bath sign to allow boys and when they enter naked, the girls are already bathing. Then, Zero Two runs out with their clothes and Hiro chases her, asking how she could do that to them. She says because they are fighting and leads him on a chase throughout the house. They meet on the roof where Hiro begins laughing after she throws their clothes in the air, laughing and calling Hiro a pervert. Hiro starts laughing and asks why she did it. She says she wanted to take part in a human fight and asks him if she looks human to him now before falling from the roof. As Hiro runs to try to help her, she reflexes into safely landing to the ground and gives Hiro a smile as they look at each other.\nAnd yet, she and the others are scolded by Nana and Hachi after they get dressed. In the girl's room, Zero Two is giddy at how naughty and rebellious the incident was. The girls want an explanation. Zero Two tells them if they half-ass things, they'll end up adults. She says to say what they want because they'll all die sooner or later before leaving.\nZero Two is among the parasites when they find Miku. When they wonder what the room is, Zero Two says that it's probably one of the rooms the former Squad 13 used. Zorome questions what happened and Zero Two says they were obviously wiped out.\nLater on, Zorome and Miku are seen bickering before they enter their FRANXX. Hiro says that he wants to get to know Zero Two better. She tells him to grab on and never let go of her.\nEpisode 09: Triangle Bomb\nAt the beginning of the episode, the members of Squad 13, with the exception of Zero Two, receive presents from Papa. When she sees Hiro's requested present is a book, Zero Two's attention is riveted, and she asks if it is a picture book. When he replies in the negative, Zero Two is shown to have a rather disappointed face.\nLater that morning, Hiro presents her with an item that had once belonged to his former (and likely deceased) partner Naomi: A silver-finished hand mirror. He explains that he noticed Papa had given her nothing, and so as a result decided to make sure she also has a gift. Zero Two reacts by putting her arms around Hiro, thanking him for thinking of her.\n \nAs Squad 13 is sent on a mission against an airborne Gutenberg-class klaxosaur, Goro ejects Ichigo out of Delphinium to prevent her from perhaps being killed by the enemy's self-inflicted explosions. When the squad later returns to their sortie, Zero Two assists Ichigo in rescuing Goro by carrying her in Strelizia's hand, before slipping Squad 13's leader into the klaxosaur through its exhaust vent.\nEpisode 10: The City of Eternity\nShe and Squad 13 return to the plantation after a battle. As Hiro exits Strelizia, he notices she doesn’t get out and looks gloomy. He asks if something is wrong and she says no. Nana calls the parasites down because she has some news for them.\nNana informs the parasites that Papa has decided to award them medals for their achievements, meaning they will be allowed into the city. While the parasites are excited, Zero Two is indifferent and starts walking away. Nana stops her to tell her that it’s perfect timing to arrange Zero Two to undergo testing. Zero Two retorts she hates those tests as they make her feel loopy afterwards and she says she is fine before leaving.\n \nDuring the ceremony, the mayor thanks Zero Two but she ignores him. The squad is allowed to venture trough the city. The others marvel at the city but Zero Two doesn’t care, as she tells Hiro how “lifeless” the city is.\nEpisode 11: Partner Shuffle\nShe accompanies Squad 13 to a meeting, where Nana and Hachi report the squad’s killing count has greatly increased but Chlorophytum‘s para-capacity has been dropping. The squad later guards a drilling facility.\nDue to Mitsuru and Ikuno’s incompatibility, Nana recommends a ‘partner shuffle’. Hiro tries to discuss this with Zero Two but she gives him the silent treatment. He asks her to talk to him so he can understand her more but she puts his hand over his mouth. She says they can understand each other just fine while piloting Strelizia and otherwise is an annoyance before she walks away.\nDuring a battle against a Gutenberg klaxosaur, Zero Two ignores commands from Ichigo and starts attacking the klaxosaur. Hiro tries to hold her back and she gets angry at him for this. He pleads for her to calm down. When Genista is briefly knocked down, Strelizia provides back up until Kokoro and Mitsuru reconnect and help Strelizia kill the klaxosaur. Zero Two later tells Hiro not to worry about the others because the two of them will be together forever and hugs him from behind.\nEpisode 12: The Garden Where It All Began\nZero Two and Squad 13 returns to the Garden to undergo tests. She is anxious and scours throughout the library, looking for a picture book. She begins biting her nails and Hiro asks her what is wrong. She corners him against a wall and asks him to kiss her, and leans into him. However, she holds back when he notices her canines and coldly turns away.\nAt the lab, Hachi tells Zero Two that she will undergo thorough tests but she asks for a pass. Nana says they can keep putting it off. The squad is greeted by the 9’s and Alpha asks her if she came for maintenance but she ignores him. She later fights against a group of soldiers who try to take her into the lab. One tranquilizes her and they hold her down.\nA klaxosaur appears near the Garden and the squad is sent to sortie. Zero Two completely ignores orders and brutally kills it. She keeps stabbing the klaxosaur and repeatedly screams for it to die, shocking Hiro and the others. The next day, Zero Two begins destroying every mirror in Miltisteinn and the mirror Hiro have her as a gift. The squad later goes against another klaxosaur but when Zero Two again starts to lose control, Hiro tries restraining her. She fights back, screaming he is merely her ‘fodder’ and she is going to become human so she can meet with her darling from before. Their minds intersect and she begins strangling Hiro, who starts to see her memories.\nEpisode 13: The Beast and the Prince\nHiro connects deeply with the consciousness of Zero Two and catches a glimpse of memories that she retained but he forgot from their childhood. Hiro sees how Zero Two endured torturous experiments from Dr. FRANXX and received a picture book called The Beast and the Prince, which was her one source of comfort, from a caretaker. Zero Two and Hiro caught their first glimpse of each other when she was being dragged into the lab, where she experienced painful experiments if a laser blowing a hole through her hand. A caretaker tries to take her book from her but Zero Two fought back until the woman gave up.\nAfter suffering from electroshock treatment, Hiro helped her escape by breaking the window in her room and Zero Two notes that was her first time experiencing the outside world and the environment confused her, as it was different. She tried eating a mouse and impulsively bit Hiro’s hand when he tried to stop her but he soon realized she didn’t understand what he was saying. He tried thinking of a name for her; his first choice was ‘Oni’ but then thought of Zero Two, although he said it wasn’t good either. She tried pronouncing ‘Zero Two’ but couldn’t because of her speech impairment. Hiro then suggested they go somewhere far away.\nZero Two narrates she didn’t understand his words but knew his voice called to her, she saw things with him and walked with him, and all the moments they shared were fun. She was given a piece of candy by Hiro which delighted her. Feeling comfortable around him she showed him the picture book before they were forced to hide from some guards who were tracking them.\nThe two later sat in front of a tree while Hiro read the book, which he noted was sad because the beast and prince couldn’t get married. Zero Two was curious about what ‘marry’ meant, and he explained it was when two people who loved each other make a vow to be together forever. However, he thought it would mean the two would have to be human. She smiled at him and Hiro suggested they keep walking but noticed she had a cut in her knee. He was surprised to see blue blood from her wound and licked it. She compared his knee position to a proposal based on the wedding page and asked Hiro if this is marriage. He said once they get out of here because he wanted to be with her forever too and become her darling. She began crying and hugged Hiro to what Zero Two now believed those were tears of joy. The two realized they were sitting in front of a mistletoe tree but were then found by a group of soldiers, who knocked Hiro unconscious and grabbed Zero Two.\nSince then, she has vowed to become human no matter what because she always believed she could do anything with him. After a collision with Delphinium and hearing Ichigo's words. Zero Two agrees but stops herself when Hiro mutters she was the girl with the picture book from before. As she looks back at him with tears in her eyes.\nEpisode 14: Punishment and Confession\nZero Two and Hiro realize they knew each other as children. She catches him before he collapses and asks if he's her darling from her childhood and is horrified thinking of what she had done. Ichigo suddenly interrupts them and throws her off of him and into Goro. He asks if she's alright as Ichigo tries to revive Hiro. When they return to the docking facility, Hiro is taken for treatment. Zero Two realizes what Hiro meant when he said he wanted to understand her better.\n \nHachi announced they must neutralize every klaxosaur inhabiting Gran Crevasse. Nana says that it is a joint operation with the 9's and FRANXX squad from each plantation. He says that Squad 13 is scheduled to be part of the sixth wave. Nana says it will be their most difficult mission and Ichigo raises her hand. She asks that Zero Two is removed from Squad 13 as of that mission and, if not, Squad 13 will not participate in the operation. Nana says that she was set to return to the 9's as of the mission anyway. Zero Two protests, but the parasites stop her from seeing him.\nWhen Hiro gets up, he is stopped by Miku. Zero Two is also guarded and prevented from leaving her room. She tells him that Zero Two is returning to the 9's the next night.\nZero Two remembers what Ichigo said and thinks that she knew she could never be a human. She breaks out of her room as Ichigo returns and roughly throws Goro against a window. However, she was scolded by Ichigo and asks if she wants to lie to him again. She says she's wrong and just wants to talk to him.\nGoro tells Ichigo to let her see him and Kokoro agrees, stating that it's sad to see them apart. Goro says that she can meet him, but they're all going to be there. When they enter the room, it's empty. Hiro had used the knife to make a rope out the curtains. He then tied the knife to it and climbed upstairs, escaping containment. Zero Two becomes enraged and says that they tricked her. Hiro unknowingly goes to Zero Two's room.\nHe asks through the door if she knew about their past. He opens the door to find the room destroyed. He returns to the hospital to find all his teammates unconscious and her attacking Ichigo. Zero Two, with a devious grin, invites Hiro to \"talk lots and lots\". Hiro scolds her for being such a monster. She realizes the damage she'd done to him.\n \nZero Two leaves the plantation as the other parasites watch her leave silently, she passes by Hiro without saying anything.\n9'α greets Zero Two and presents her with the stamens that Dr. FRANXX brought for her. Zero Two's ship takes off.\nEpisode 15: The Bird that Shares Wings\nHer face is deathly pale, her eyes blood red and her horns long enough to touch the ceiling. Hiro tries to connect, but he gets no response. He holds her horns and asks to be taken to her seeing her memories.\nShe cannot remember things but begins to when she recognizes familiar actions. She licks her wounds in a similar way. Seeing her book, Zero Two begins eating it. She learns the word \"boku,\" and Zero Two, and \"darling.\" She remembers him getting attacked and begins crying.\nZero Two's horns break and Hiro hugs her. She pushes him away and tells him not to look at her because of how she used him. He says that doesn’t matter anymore. She cries out that she called him fodder and how can he ever forgive her. He cries that he called her a monster and hugs her, saying they are even. She says she is a monster. But Hiro says no and they need to talk things out, as their future is ahead of them and they have the chance to see the world when they didn’t back then. Hiro kisses her as they both begin to give way to their emotions. Through their tears of joy, Strelitzia emerges, more powerful than ever and with an inverted color scheme. She then completely annihilates the Super-Lehmann-class Klaxosaur threatening Plantation 13, and the two confess their love for each other while doing so. After killing the klaxosaur, the 9’s open the doors of the Gran Crevasse and the smoke and dust Clear in the sky. Strelizia taxes at the blue sky, with Hiro and Zero Two narrating Zero Two’s debut narrative of the Jian.\n \nInside the mountain klaxosaur, they find that its core is a collective mass of cores. A large hand suddenly shoots up from the ground. 9'α laughs and says that it reacted quickly. It crushed the plantation, leaving behind a pile of debris. Squad 13 (and Mistillteinn, for that matter) was lucky enough to still be standing as they stood between the hand's digit.\nEpisode 16: Days of Our Lives\nA month passes and the squad is on standby for their next mission. In her room, Zero Two happily files her horns as she looks at herself using Naomi's mirror.\n \nZero Two summons everyone else as it's time for breakfast by hitting a frying pan with a ladle. Futoshi covers his ears and Kokoro tells Miku that she is on messenger duty. Zero Two finds Hiro and Mitsuru inspecting the water of a lake and tells them breakfast is ready. While everyone preps for breakfast, Ikuno enters and offers to help, but Ichigo says that it's fine and asks if her fever went down. Zero Two places her forehead on Ikuno and says that she's 36.7 degrees (a normal body temperature) but tells her not to push herself.\nThey pray for Papa before they eat, though Zero Two eats anyway. She lists off the chores and Miku, smiling, notes that she's meticulous. Ichigo also smiles and agrees.\nHiro and Zero Two walk together. Hiro says that Goro must have gotten child fever last week. Zero Two curiously looks at a plant. He explains that they're sakura buds including that they're a really pretty color, like her hair. She giggles and says she wants to see them. He asks how she felt about their lives and she says they're having fun and would like to live like that forever. He scooches closer to her and is about to hold her hand, but she suddenly remembers that she was supposed to go bathing with the other pistils, telling him not to peek.\nThe girls bathe in the river. Miku asks if they have seen Mitsuru's hair as she washes Zero Two's hair. Ikuno says that he looks pretty good. Zero Two sees a fish and tries to get it, but Miku stops her. Miku says that her hair's a pretty color, and she says that Hiro said so too. As Miku pours water on her head and asks if they always talk about corny stuff. She tackles her pushing her into the water. When she says that she'll wash hers, she notices that she has grey hair. Miku wonders what is wrong but Zero Two playfully tackles her again.\nThe parasites meet in their living room and Ichigo says that they have five sources they can use for drinking water. Mitsuru says that only two of them are only usable with filtering. Ikuno asks if they can repair the circulation system themselves. Hiro says that Mistilteinn doesn't have the equipment. Futoshi says that their access to the elevator is restricted too. Zorome asks why they don't send a letter to Papa and ask him to fix it. Goro says that he doesn't think there'd be a point. The parasites sadly reflect on their vulnerability, so Zero Two says that they should cook their own food. The others agreed\nIchigo welcomes Hiro, Goro, and Zero Two back from fishing. Zorome and the rest are impressed with the 11 fish that she caught. Goro caught 9 and Hiro, awkwardly smiled and scratched his head, saying he didn't catch any. Zero Two says she'll teach him later. The others want to try fishing as well.\nGoro asks Ichigo how she is, and she says that the mood really changed. She happily watches as Zero Two tells the rest how to fish. Ichigo says that Hiro was right about her being a normal girl. She says she wants what's best for her and Hiro.\nThat night, Kokoro and Miku sleep together. Zero Two draws pictures in her room of the book they read together. When Hiro says that it's a sad story, she says that it was her first \"pretty thing.\" She met him and wanted to have something beautiful with him. She realizes now what it means to be human and they embrace.\nAs she lays out her drawings for her picture book, she is about to draw on a piece of paper until she hears a klaxosaur scream from the Gran Crevasse.\nEpisode 17: Eden\nIkuno holds a mirror for Zero Two as she files her horns. She asks if it hurts and she says not a bit at all. When she finishes, she tells Miku. She presents a flower headband and places it on her head. Zero Two asks what it looks like and Miku says perfect and that Hiro will love it. Zorome suddenly runs up and says there's a problem.\nThe Nines later arrived at Mistillteinn on Papa's order. 9'α and Zero Two had a private chat in the woods. Smiling, 9'α asks how long she's going to play human since she'll never be the same as them. Though they're unique, they're imperfect unlike she and the other nines. She tells him not to call her \"Iota\" but \"Zero Two.\" He asks if she's throwing away the Special Forces code name that Papa gave her. She says that her darling gave it to her and it's important. He begins laughing at her as she walks away. He wishes her luck, again calling her \"Iota.\"\nZero Two looks at the flame of a candle in her room when Hiro calls out to her. He asks about her flower headband. She says that Miku made it for her. She shyly tells him not to stare but says it's okay after he compliments her.\nZero Two pushes his bangs back to reveal small blue horns poking through his forehead. She says that they'd grown bigger. She thinks that they must be because he rode with her or because he drank her blood. She sadly says that she drastically altered his destiny. He leans in and places his horns against hers. They kiss and rest their foreheads against each other. Blushing, Hiro says that it makes him happy to be more similar to her.\nShe tells him that she ate her old picture book when they were trying to erase her memories. She says that she started wanting to become human because she wanted to see him again and was told that she could do that by killing klaxosaurs, and yet realizes she shouldn't have believed them. Hiro asks if Papa and the rest told her, but she doesn't answer.\nShe asks that he show her the picture he drew. He refuses, so she playfully snatches it from him. She finds that he crudely drew a picture of a king. She begins laughing and he covers his face in embarrassment. She says that it's approved and she loves it as she holds it against her chest.\nThe next day, she sees that 9'α had been poking around and conflict arose as interrogates Kokoro on the childbirth book. A harsh exchange of words soon followed, with Ikuno slapping 9'α. Afterwards upon hearing Kokoro's words Zero Two was amazed by humans because they were to leave a mark which was something she couldn't do and as well as decide their own fates. She later shows Hiro her drawing of a bride.\nEpisode 18: When the Sakura Blooms\nHiro explains to the parasites that he wants to have a wedding. As they don't know what it is, Hiro explains that it was a ceremony where two people would make a vow together. Miku asks who will get married. Hiro says Kokoro and Mitsuru. Kokoro says that Hiro told them about it and it sounded wonderful. Mitsuru says they decided to do it before leaving. Goro, Miku, and Zorome voice their support. Though they stop to check on Futoshi, he exclaims that he wants to play the priest so he can be right beside Kokoro and Mitsuru to congratulate them. Kokoro thanks him.\n \nZero Two shows Kokoro a drawing of a wedding dress. Kokoro asks what material they can use to make it. Miku and Ichigo collect curtains to do so. Ichigo looks around the abandoned room that the couple slept in and notices a camera. Mitsuru and Goro make rings for the wedding and Mitsuru explains what they're for. When Goro says that Kokoro will love it, Mitsuru blushes and says he hopes so.\nThe parasites paint the side of the house. Ichigo brings Ikuno out and they all pose for a picture.\nZero Two looks at her mirror and headband. She is about to draw something but stops and looks at the drawings for her book. She hears screaming and a black hole appears in the ground. Countless stamens, such as 081, climb out of the hole and pull at her. The large hand is about to strike her, but she is woken up by Hiro.\nHiro asks if she's okay and she shakes in his chest. She smiles and says she dozed off. Hiro says her books almost complete, and she smiles and says she'll show it to him when she's done.\nZero Two and Hiro walk through the sakura. Zero Two wears a formal pistil outfit that Kokoro lent her and Hiro compliments her. She asks if he remembers their promise to marry and he says he does. They spin around in the petals.\nAs the others wait outside, Mitsuru paces at the bottom of the stairs. Kokoro comes down in her wedding dress. Mitsuru looks at her but becomes embarrassed and looks away. She takes his hand and says they'll find happiness together. Ikuno runs down the stairs and gives them each flowers and then opens the doors.\nZorome asks if they ring the bells now and Miku says yes. The parasites ring their bells as Mitsuru and Kokoro walk together as well as throwing petals. Futoshi cries.\nHachi watches the wedding from the control room but an APE assault ship appears. Alpha greets him from the monitor and Hachi asks who authorized them. Alpha answers that Papa did. Hachi asks if they are going to force them into the parasite camp's re-indoctrination program when Squad 13 is exempt from it. Alpha says just two of them. Alpha tells him to just sit there and watch, like usual.\nFutoshi tells the couple to exchange rings. After they do, Futoshi tells them to kiss. Before they can, they are interrupted by APE SP who tell them to freeze. When Zorome questions them, he is hit with a gun. Futoshi stands in front of them and tells them to run. They do, but are stopped by the nines. Alpha tells them that Papa said they were dangerous and need to be re-indoctrinated.\nZero Two leaps forward to protect them. Alpha asks if she's still playing human and it’s getting embarrassing. She calls him the embarrassment and tries to attack him, but he jumps away. The other nines begin attacking her as well. They hold her down and Alpha tells her that she mustn't defy Papa. SP takes the couple and tear them from each other. Hachi comes down the steps and watches.\nThe parasites sit sadly around the yard. Hiro thinks that it's like the Garden and they're not allowed any happiness. As they pack, Hiro wonders where they were taken and if they'll come back. The cargo ship comes and picks them up.\nAt the Bird Nest, Ikuno says the parasites are being summoned in order. Miku says that it reminds her of Garden. The stamen talk about how it's been weeks since their last mission. Ichigo gets a message and they go to the door.\nKokoro and Mitsuru walk through. Though they still have their rings, they don't remember the wedding or each other. Zero Two tells Hiro that their memories have been altered, just like what happened to them. Hachi watches them as well.\nEpisode 19: Inhumanity\nHiro walks up and Ichigo asks about Zero Two. He says she just needs some final tune-ups. He tells the group that he's thinking of directly asking Papa to return them to normal.\nLooking at his robotic hand, Hiro asks that Misturu and Kokoro's memories be returned. Papa refuses and says that they removed the unnecessary information and there is no way to return them. The rest of the parasites are distressed and the Vice Chairman says that what they're doing is a severe breach of protocol and would normally be punished, but they'll let it off with a mere mention on their record. He says to return to their waiting quarters. Futoshi demands that they apologize. Zorome asks how many klaxosaurs they have to kill before they can become adults. They don't answer and Zorome asks what they're living for. Hiro says that they took away Zero Two and his precious memories as well as Kokoro and Mitsuru's. He says they can't see him as their Papa and to set them free once the battle is over. Papa agrees, as long as they fulfill their duties in the next mission. Then they hang up. Dr. FRANXX tells them to show whether they can become real humans. Hiro says he saw him in Zero Two's memories and that he can't forgive him before walking out.\n \nZero Two sits outside. He stares at her horns and she calls him a pervert. He smiles and tells her that they made their decision. He holds out his hand and they walk away. The doctor watches them walk away holding hands.\nEpisode 20: A New World\n \nGorilla says that they don't need to worry and Baboon says that that's why they modified it for so long. Another says that they're implanting Strelizia in Star Entity‘s core. Papa says to Zero Two that it is for that purpose that they raised her. She is unimpressed, but Hiro grabs her hand and asks what happens after that. He says that the future will belong to humanity if they defeat the klaxosaurs. He says they won't call him \"Papa\" anymore and they'll control their own destiny.\nAs squad 13 eats together, Futoshi tells Goro that both Kokoro and Mitsuru took off their rings. Goro is surprised he noticed and begins to ask if he's not over her, but stops and apologizes. Kokoro suddenly spills her water and runs to the bathroom to throw up.\nOn D-Day, at Bird Nest, Vice Chairman says that APE has always desired peace and prosperity for mankind. Marmoset tells them to offer all of themselves. Papa says they will finally prevail. 9'α watches the squad and becomes annoyed when he sees Zero Two yawn.\nAfter the assembly, the 9's mock squad 13. Zero Two steps forward and says they're all stronger than them since they have their eyes on the future. This angers Alpha and he says that Papa only treats them differently because they're his tools before they all walk away. The squad is thankful to Zero Two but are interrupted by a siren.\nAn announcer says that a klaxosaur pack is headed towards Gran Crevasse. The parasites all head out. Kokoro rubs her finger and Mitsuru says they were partners, so they should be able to connect.\nAt the Gran Crevasse ruins, the FRANXX attack the klaxosaur. When Mitsuru compliments Kokoro, he has a pain in his head when saying her name. Genista struggles and Kokoro gets the same pain when saying \"Mitsuru.\"\n \nHiro, Zero Two, Dr. FRANXX, and Hachi go down an elevator with Strelizia. Hiro and Zero Two discuss their plans and Zero Two says she doesn't care as long as they're together. She is about to say something about the last page of the book but stops herself. They kiss as they promise to be together forever.\nThey reach the bottom of Gran Crevasse. Zero Two hears something coming and they leave. One of the snake klaxosaur breaks through the wall and 001 says she won't allow them to do what they wish with their child. Dr. FRANXX asks if she's there to take back Star Entity, but he says she can't since she's the last surviving klaxo sapiens. He says he'll operate it with her since he always dreamed of it since they met. She suddenly pins him down and says she needs no partner, but she will use the one he's offered.\nStrelizia tries to open a gate, but can't. 001 catches up and pulls Zero Two out, saying that she's a duplicate that does not realize she is being used by the invaders. She says she isn't fit to pilot their child before throwing her out. She kisses Hiro and says he must not be an ordinary human before closing the door. She says she will devour him and opens the door.\nAt Cosmos, Gorilla says that the worst has come to pass and the work on 002 will be in vain. Marmoset says that if she connects to Star Entity, they'll be defeated. The Vice Chairman says they've already taken measures.\nHachi and Dr. FRANXX see that she connected to Strelizia, and Dr. FRANXX falls into Hachi. He says he wasn't expecting her to link with a human and thinks she will devour once again.\nHiro asks how she can pilot Strelizia. She says it was originally one of their brethren. Her horns begin glowing and she sends a message to the pilots. Dr. FRANXX and Hachi hear as well. Dr. FRANXX says that he found that the klaxosaur split into two forms. One returned to the earth and became energy. Baboon says that the seal is an affront. Gorilla says that the magma energy is part of the planet's resources that saved humans from ruin. 001 says they're selfish and asks if they now want to steal her child. She says she will not allow it and that the child is a crystallization of their bonds.\nAlpha tells her not to talk down to Papa. Dr. FRANXX finishes that the other form consumed that energy and evolved physically and stopped mingling with one another and lost their intelligence. Hachi asks what they are, and he says weapons built by the klaxo sapiens. They are composed of one male and one female klaxo sapiens. The female's soul connected to the weapon, and the male's soul took root in the core, the cockpit. Hachi says that it's similar to the FRANXX. Dr. FRANXX says they're an application of the klaxosaur system. Klaxosaurs that can be piloted by humans genetically modified to be similar. The parasites realize they'd been kept in the dark.\n001 tells her child to awaken since they're nearly there. She begins the implanting process. Papa says that he was hoping it wouldn't come to this, but they have no choice. Vice Chairman says they wanted to take it and Hringhorni to space as soldiers. Papa says that, if they can't have it, then it can go down along with the planet and they will return to their original roles.\nKlaxosaur begin popping out from the ground and shooting into space. They shoot spaceships in the sky. Star Entity wakes up and Dr. FRANXX says it's beautiful. 001 says that the humans made her ugly, but it's okay. She says a long time ago,when they were attacked by invaders from the expanse of space, they fought and drove them off and then holed up in the earth to prepare. They shoot at a VIRM fleet. They shoot back and 001 says that she won't let them touch their planet. It shoots back and destroys it. Papa says it's futile and she asks what VIRM did to their child. The chairman and vice chairman's masks fall and the vice -hairman says that Star Entity is a mass of life that could disturb the universe's peace. Papa says that if the klaxosaur princess took over the implanting process, they programmed it to explode. They say that the planet will explode and leave nothing behind. Papa says that they'll take them to eternal paradise.\n \nZero Two continues to walk forward and says she'll keep her promise to Hiro.\nEpisode 21: For You, My Love\nVice Chairman announces that it is VIRM's will for Star Entity, which is a mass of life that could disturb the universe's peace. Papa says that if the klaxosaur princess took over the implanting process, they programmed it to explode. The other members of the council are confused and Papa explains that they have assimilated several lifeforms from all over the universe and helped them break free of the shells of their bodies. Vice Chairman says that the time has come for humans to embrace their evolution. They say that there exists a form of pleasure that is gentle and perpetual that they will experience. The three fall to the ground.\nHiro curses as 001 struggles. He connects to her consciousness. He asks if she's been alone since humanity existed. Zero Two walks along looking for Hiro. The other parasites watch as VIRM kills other parasites. They wonder who they should be fighting.\nDr. FRANXX says that the detonation stalled once Hiro connected, the explosion is triggered by stampede mode. Zero Two says that he bought them some time before collapsing.\nThe parasites wonder what they should do and worry about what the announcement said. They agree to return to Gran Crevasse to see for themselves.\n001 says that VIRM got her and that it's no use. Hiro asks about VIRM and how long she'd been alive. 001 says that it has been more than sixty million years. They inhabited Earth as an advanced civilization. One day, VIRM arrived. They were a group mind with no physical bodies, and they wanted them to cast aside their bodies and join. During the war, they forged themselves into immortal weapons and evolved into Klaxosaurs. By the time they fought off VIRM, fighting and warfare were all that remained of their civilization and they lost their ability to procreate. The enemy they fought off was VIRM's vanguard. To prepare for their return, they went underground and the weak turned themselves into energy, and the strong combined to evolve into even stronger weapons.\nZero Two wakes up and says that 001 called her a fake. Dr. FRANXX says that 001 is the sole survivor of the klaxo sapiens, and she is her clone. She was created to operate Star Entity on behalf of the human race. He says that she was the only success. He created the 9's using her cells too, but they didn't inherit the Klaxosaur blood. She says that she's going to save Hiro and she doesn't care about the rest. Dr. FRANXX says he'll go as well.\nAs Squad 13 continues, they run into the 9's. They command them to return and continue to follow Papa's orders. They kill more klaxosaur, but are attacked and killed by VIRM.\nThe FRANXX break through and they go to help the two. Ikuno and Futoshi clear a path. Ikuno's turns grey. They let Zero Two go alone with Ichigo and Goro.\n001 and Hiro continue to struggle. He relates to their want to fight but feels that he wasn't really living when he only wanted to fight.\n \nHringhorni begins flying. Alpha asks Papa to say something. Dr. FRANXX and Zero Two continue as they stay to fight VIRM. Dr. FRANXX sacrifices his arm to the door, as it contains 001's cells. Though he wanted them to turn him into a klaxosaur. The snake allows zero Two to ride. She asks him if he took her to Plantation 13 to reunite her with Hiro. He says he wasn't expecting them to rekindle what they had and it was just a whim. Smiling, she thanks him for creating her and helping her meet Hiro. After she goes, he wonders how she became so human.\nAs they break through the wall, the snake klaxosaur dies. She opens the door to Strelizia and tries to revive Hiro. She finds out that he's covered in blood and that they'd run out of time. Her horns break free and her skin turns red and she kisses him. 001 gives the rest of her strength to them. She stakes the planet on them.\nThe two reunite under a tree after keeping their promise. They kiss and the bomb disintegrates. It breaks their program and begins attacking VIRM. Dr. FRANXX finds her beautiful before a rock kills him. VIRM takes their lance and withdraws saying that they will bring back their army.\nPanting, Hiro smiles and says to Zero Two that they did it. She doesn't respond, and her face is lifeless as her horn crumbles.\nEpisode 22: Stargazers\nHiro takes care of Zero Two while she is in a catatonic state and is confused when mysterious injuries begin showing up on her body. Hiro finds the last page of her story blank and he realizes she deliberately left it blank because she foresaw they would part ways one day. She starts wondering around from her room and goes outside, looking at the sky. Hiro vows to be with her and, when his horns make contact with her, he realizes her mind is with Strelizia and she is actually fighting VIRM in Mars’ orbit system in space.\nHiro decides to go to the battlefield and save Zero Two even though Squad 13, specifically Goro, tell him he will die. Hiro says if Zero Two can’t smile at him, he would rather be dead. Before leaving, Hiro cuddles with Zero Two as they sleep side by side.\nEpisode 23: DARLING in the FRANXX\nZero Two stands outside and looking up at the sky while Kokoro and Mitsuru watch her. She starts walking aimlessly and trying to reach for the sky when new injuries begin appearing on her body. Kokoro becomes alarmed and makes it her responsibility to protect her. Even when a heavy thunderstorm rolls by, Kokoro refuses to leave Zero Two’s side. Concerned for Kokoro’s safety, as she is pregnant, Mitsuru decides to stay with them both.\nIn space, Hiro is able to connect with Zero Two’s consciousness and finds that her mind is filled with pages from her story. Hiro recalls his promise to be with her forever and wants her to devour him. Zero Two says they can’t be together because he needs to be human.\nZero Two says she is fine being alone but Hiro approaches her and offers his hand to her. She takes his hand and they embrace, with him vowing to be with her always. On Earth, her body turns into a statue, whereas in space, Zero Two‘s mind via Strelizia evolves into Strelizia True Apus and she annihilates a horde of VIRM fleets. Then, a Warp Gate opens. She explains to Squad 13 that the klaxo sapiens built the satellites to open it a long time ago. She and Hiro decide to enter it together because only they can go through. Squad 13 protests this and Zero Two explains they decided this in order to end the war. When asked if they will return, neither give an answer. Nevertheless, everyone says they believe Hiro and Zero Two will come back because their squad isn’t the same without them and they will all build a home together, moving Zero Two to tears. She and Hiro take a Klaxosaur Bomb and then enter the warp gate.\nEpisode 24: Never Let Me Go\nAfter 70 days of traveling, Hiro notes he hasn’t had the need to eat or sleep and wonders if he is becoming a full klaxosaur. Zero Two asks if he is afraid but he says no because he feels like he is becoming part of her. They come across a swarm of VIRM and proceed to wipe them out. Hiro says he doesn’t recognize the stars because they are so far away from Earth. Zero Two suggests they create their own constellation before they encounter more VIRM and destroy them.\n783 days since the gate passage, Hiro falls asleep and Zero Two notes that it is unusual and worries he is getting weak from pushing himself. He says he had a dream in which their friends were living good lives and another dream in which the two of them meet in a distant future but he believes it is hope for them. Zero Two replies, no matter what destiny they face, they will be together forever. They finally reach the VIRM home planet and are confronted by Papa and the Vice Chairman. VIRM soldiers attack them and Hiro is knocked out and loses his connection with Zero Two, who is impaled by Hringhorni. Papa and the Vice Chairman says this is due to the pair’s incompatibility of Hiro being human and Zero Two a klaxosaur. Zero Two calls out for her friends to save Hiro. Squad 13 surmises Zero Two’s body can serve as a link to her and Hiro in space. They hold hands and send their thoughts to them, which gradually reaches them. Hiro regains consciousness when he hears Mitsuru and Kokoro say they had a daughter and named her Ai because it means ‘love ’, a word they were never taught but learned from Hiro and Zero Two. She credits Hiro for starting the series of events that made everyone’s lives like this. Hiro says it’s not something to be proud of because all he did was cause trouble to them. Zero Two replies it was because of his will to live and encourages him to join her so they rewrite the story. They kiss and reconnect. Reverting back to the Strelizia Iron Maiden form, Hiro and Zero Two take control of Hringhorni and destroy the fleets before they force the klaxosaur bomb into the planet and thrust Strelizia into the bomb to detonate it. Knowing they will vanish when it detonates, they profess their love to each other. The bomb explodes and all the souls kept in the planet are liberated, though Papa and the Vice Chairman survive and vow to return at the peak of evolution.\nOn Earth, everyone sees the blast and realizes Hiro and Zero Two won but sacrificed themselves, which saddens them. Zero Two’s body then cracks into dust and a single plant is left. Over the next eight years, the memory of Hiro and Zero Two remains on the minds of their friends. Ichigo finishes Zero Two’s story book and all the children are taught to read it in their memory. Squad 13 reunites at a cherry tree that grew from Zero Two’s ashes and they thank Hiro and Zero Two for the lessons they learned from the two and for giving them a chance to live normal lives.\n \nA thousand years later, a young boy who resembles Hiro meets a young girl who resembles Zero Two. The young girl trips down on the roots and the young boy picks her up. Then the girl asks of the boy's name and he introduces himself. It is revealed they are the reincarnations of Hiro and Zero Two, and a new story of romance begins.\nRelationships\n\nHiro\n \nZero Two was enthralled by Hiro immediately after seeing him. They first meet when she was skinny dipping in Cerasus' lake. Being pleased with his taste and him not being afraid of her horns, she proposes that he become her \"darling\". Though they are briefly separated, they reunite after her partner dies and Hiro acts as his replacement. Their relationship becomes stronger with them both finding someone with whom they can successfully pilot with; being even able to pilot Strelizia in its iron maiden form.\nAs they spend more time together, Zero Two acts more flirtatious and teasingly towards Hiro, causing him to become bashful. Many of the things that she does seem foreign to the other parasites, such as sitting on Hiro's lap at the boys' table and feeding him. Their relationship is briefly strained after hearing of her past and seeing Mitsuru near death after riding with her, as Hiro becomes somewhat wary of her. He later realizes and confesses that he never really cared about riding the FRANXX, but wanted to ride with her.\nAfter riding again with her, Hiro develops a tumor on his chest. Though Hiro could die, he feels that being useful to the others is more important than his life and thanks her for giving him the chance to pilot the FRANXX. Zero Two reaffirms that she is his partner and sheherone. Zero Two then unzips his uniform revealing a pulsating blue klaxosaur tumor growing out of Hiro's chest. She reminds him that none of her partners have ridden with her more than 3 times. She asks him if it hurts, and relates that the pain must be unbearable, however she states \"it looks beautiful\". Zero Two poses Hiro that if he wants \"off this ride\" now's his chance. Unyielding, He declares \"I'll ride with you!\". Zero Two becomes overjoyed and begins laughing and dancing by the lake.\nDuring the next battle, Strelizia flies into battle to help the other parasites. In the midst of combat, Hiro's tumor intensifies causing his engorged veins to show through his battle suit and spread to face. This causes their performance to slump and lag, prompting Zero Two to rile him up, this proves effective as Hiro pulls himself together and continues the fight.\nOnce all the Conrad-klaxosaurs have been annihilated, Squad 13 shifts priority to Target Beta which has taken a humanoid-form. Squad 13 immobilizes the titan while Hiro flies the Strelizia into the sky. He begins to pour what energy he has left into a downward thrust in hopes of killing it. The attack seems successful causing Target Beta to collapse. Hiro appears to have died causing the Strelizia to deactivate and go into Stampede.\nIn his death-like state, Hiro is greeted by Naomi. He subsequently sees Zero Two. Wondering if she came to say goodbye to him, He reaches out to her. However, Zero Two sadly turns away mirroring the beginning of the episode. Hiro wakes up and sees Zero Two desperately trying to fight of Target Beta. He desperately tries to tell Zero Two not to fight alone, in doing so, she'll cause her own death. Hiro then recalls that Zero Two is a monster and that she's been all alone. Zero Two can't \"fly\" by herself after all. Zero Two lets out a groan in pain then a newly revived Hiro grabs her from behind and calms her down. Zero Two eyes return from red to cyan and ask if it's really him. Hiro reminds her that he is her partner and that he'll never leave her alone. The Strelizia's Iron Maiden form is then restored.\nHiro and Zero Two's relationship continues due to him surviving after his third time piloting with her. While at the beach on Squad 13's day off, Zero Two teases Hiro thinking she would kiss him again. When Zero Two had stolen the other Parasites clothing during a \"gender conflict\" among the squad, Zero Two playfully taunted Hiro, telling him to catch her, or saying he has to do better, laughing as he chased her around the house. On the day the Parasites received presents, Hiro, feeling bad that everyone else got presents, gifted Zero Two with a hand mirror that was left behind by Naomi, with Zero Two thanking Hiro with a surprise hug.\nStarting at episode 11, Hiro and Zero Two's relationship starts to dip, with Hiro asking Zero Two to open up to him if anything was weighing on her mind, however, she brushes his request off, calling it a pain. During the fight with the Klaxosaur collective, Zero Two expressed anger when Hiro had stopped her from attacking it, even though he also saved them from getting possibly crushed under its foot.\nEpisode 12 is where their suffering relationship begins to show, during the fight with Klaxosaurs, Hiro repeatedly bickers with Zero Two, saying they need to cooperate with the others, but his pleas fall upon deaf ears, And Zero Two annoyed that Hiro is also \"getting in her way\".\nLater, at the lake in Mistilteinn that same episode, Hiro finds Zero Two biting her fingers, expressing concern, and asking what she means by \"wanting to become human\". In an effort to make her snap out of her state, Hiro desperately confesses his feelings for her, she, however, brushes it off and pushes him to the ground, thinking he means it in a different manner, then stating that she will teach Hiro what comes after kissing, unbuttoning her uniform. When this did not work, Zero Two, in her off state, claims this isn't enough, telling Hiro to kill more Klaxosaurs to turn her human, calling him her Fodder.\nDuring the episode's climax, as Zero Two maddeningly fights klaxosaurs, Hiro pleas that what she is doing will not satisfy her wish, fed up with Hiro, Zero Two commands that he should be quietly devoured like the fodder he is, taking complete control of Strelizia, causing it to enter its Stampede Mode. Zero Two begins to strangle Hiro, telling him to give her all of his life. Then stating that she will become human so she can meet her \"Darling from back then\" which, unbeknownst to her, was actually Hiro all along.\nAt this moment, it’s revealed Hiro and Zero Two had already met each other before as children. Hiro helped her escape from a parasite experimentation laboratory after witnessing APE's cruel experimentations on her. While they were on the run, Hiro named her Zero Two, helped her learn many things and molded her personality. He eventually promised he'd marry her and become her Darling, making Zero Two cry out of joy and hug him. Unfortunately, APE officers managed to catch them and wipe their memories away. After recovering their once lost memories through syncing in Strelizia, Zero Two and Hiro stare at each other with tears in their eyes, realizing they have finally found their lost love.\nUnfortunately, after Zero Two beats each and every Squad 13 member, Hiro calls Zero Two a Monster. Deeming this as a punishment for what she did to Hiro, Zero Two leaves his side.\nHowever, having refused to give up on Zero Two. Hiro recklessly goes to the battlefield while using Training unit. After his Training unit is destroyed, Hiro temporarily uses Delphinium to forcefully enter Strelizia Stampede. There, Zero Two was consoled and even kissed by Hiro. Finally realizing that Hiro will be always at her side no matter what, Zero Two reciprocates Hiro feelings towards her.\nHiro speculates that he was able to pilot with Zero Two over three times due to him licking Zero Two's bleeding knee, allowing Hiro to adapt his body to Zero Two's Klaxosaur aspect.\nThey spend their nights having fun together by drawing pictures for Zero Two's picture book. They also talked together more and become openly affectionate with each other, including kissing and holding hands. Before Kokoro and Mitsuru’s wedding, Hiro and Zero Two talked about how beautiful the cherry blossom trees are and reaffirmed their promise to each other, spinning and laughing together.\nHowever, after finding out Papa erased Kokoro and Mitsuru’s memories as punishment, Hiro openly rebelled against Papa for doing such a thing and demanded Squad 13's release from duty if they win the final battle against the klaxosaurs. During this, Zero Two holds his hand in support. Before going into battle, they share a tender moment and express their desire to be together forever.\nDuring the battle with VIRM, Hiro is forced to link with the klaxosaur princess who severely wounds Zero Two in the process. Zero Two, despite her injuries, pursues the Strelizia to save Hiro and, when she finally reaches him, she fears he is dead and tearfully pleads for him to live. She kisses him and he is revived, and their connection is restored in time to stop the VIRM from causing more destruction and force them to retreat. However, Hiro finds Zero Two unresponsive and her horns cracking.\nHiro tends to her and he learns that her mind is connected to Strelizia and she is actually fighting the VIRM in space. Despite it being a suicide mission, Hiro resolves to rescue her and depart with his squad mates to space.\nHiro is able to board Strelizia and mentally meets with Zero Two, whose mind is filled with images of her storybook. She says they can’t be together because she is not human and she is fine with being alone. Hiro disagrees and offers her his hand, vowing to never leave her. They reconcile and reconnect, causing Strelizia to evolve into the Strelizia True Apus. They then decide to travel through a warp gate in order to eliminate the VIRM and put an end to the war for good.\nAfter leaving their solar system, Zero Two says they started their \"honeymoon\" wandering through space. In the final battle, they are nearly defeated when their connection is cut off but the prayers of their friends allow them to reconnect and they are able to destroy the VIRM home planet and liberate all the souls the VIRM collected. However, they end up sacrificing their lives to complete their mission. Before dying, they profess their love to each other and vow to meet again as long as their souls exist.\nA thousand years pass and one day, a boy resembling Hiro sits at a cherry blossom tree when a girl resembling Zero Two falls in front of him. He helps her up and they introduce themselves, revealing they are Hiro and Zero Two's reincarnations.\nIchigo\n \nZero Two finds Ichigo bossy, even annoying. However, she does acknowledge the tension between them stemming from Ichigo's unrequited love towards Hiro and takes visible pleasure in taunting her about their closeness. Ichigo is grateful that Zero Two saved her life and those of her squad, however, she also harbors resentment towards Zero Two due to her attitude and relationship with Hiro. This results in altercations between the two whenever they come face to face. Over the course of the series, Ichigo becomes saddened, which progresses toward depression due to her desire to be with Hiro combined with the fact that they are incompatible and Zero Two's attachment to him. Despite this, Ichigo welcomes her to the team after their battle together and even confronts 9α that she prefer battling together with Zero Two rather than with Nines. When Zero Two helps Ichigo rescue Goro, she is happy when Ichigo says that she trusts her, and admits that she doesn't dislike helping her out. Zero Two has also said that she likes Ichigo's taste after licking her cheek, much to Ichigo's discomfort.\nEventually, Ichigo becomes fed up to Zero Two and hated her very existence, mainly due to her jealousy that Hiro always had his view to Zero Two and not her. In episode 14, Ichigo won't allow Zero Two and Hiro to meet with each other and proposed to Nana that unless Zero Two is kicked out from Squad 13, they won't participate in the next mission. Later, Ichigo is beaten by Zero Two due to Hiro's absence when she, after discussing with Goro, reluctantly allows Zero Two to visit. After Zero Two gets deported for her actions, Ichigo tells a bewildered Hiro that this is for the best.\nIchigo, finally realize Hiro unwavering feelings for Zero Two, deliver Hiro to Zero Two using Delphinium. Afterwards, their friendship starts anew.\nIchigo helps Zero Two rush to rescue Hiro after the klaxosaur princess links with him. In the next episode, after Hiro decides to go to space to rescue Zero Two, Ichigo is worried he will die but she and the rest of the squad decide to help him because the squad isn’t the same without Zero Two.\nDuring the mission to rescue Zero Two from VIRM, Ichigo is happy to see Zero Two is alive but she opposes Zero Two and Hiro’s decision to leave and fight the VIRM alone. However, Ichigo changes her mind and orders them, as Squad leader, to come back.\nIchigo constantly worries about Zero Two and Hiro while they fight in space. When she learns they sacrificed themselves to destroy the VIRM planet, she is saddened but resolves that everyone will continue rebuilding the planet and society the two will have a home to come to when they decide to return. Ichigo finish’s Zero Two’s book and encourages the new generation to read it so they will know about the two. She later credits the two for teaching everyone so many lessons on life.\nGoro\n \nGoro once commented that she wastes her \"good looks\" with her vicious eating habits. He seems to have a form of animosity towards Zero Two (mainly stemming from her dynamic with Ichigo) and his fear of her possibly causing Hiro's death.\nGoro admires the relationship that Hiro and Zero Two share and secretly contemplates if he can share that with Ichigo. When they go to the beach, Goro passes a skewer to Zero Two. After initially shocked, she accepts and silently analyzes it.\nGoro is the only one who treats Zero Two as an ally besides Hiro. In Episode 14, Goro convinces Ichigo to let Zero Two meet with Hiro, only to find Hiro gone missing. Although Goro tried to reason with Zero Two about this, Zero Two won't listen as she feels deceived by them. Despite all the turmoil that occurred as a result of this fall out, Goro didn’t hold any ill will towards Zero Two.\nAlthough he continued to treat her as a comrade, he was still hesitant to watch Hiro made dangerous choices involving her. As, after she is left comatose for mentally connecting with Strelizia to fight the VIRM in space alone, Hiro was willing to risk his life to save her. Goro called him selfish for going off to die while everyone was struggling to survive. However, Goro changed his mind, as he admitted he was the one being selfish and also wanted to save Zero Two.\nAfter Hiro and Zero Two sacrifice themselves to destroy the VIRM, Goro mourned the death of his two friends but is grateful for everything he learned from them.\nMiku\n \nMiku initially feels uncomfortable with Zero Two because of her personality and horns. She later thinks that Zero Two and Hiro make a good couple which makes Ichigo uneasy. Zero Two (Strelizia) and Mitsuru rescue Miku (Argentea) and Zorome after their mission underground goes awry. The timely arrival and entrance of Strelizia allows them to escape while Strelizia goes on a massacre. When they go to the beach together, Miku and Kokoro express their excitement that Hiro and Zero Two are now officially part of Squad 13. Miku tells Hiro that he and Zero Two better put in Naomi's share of the work. Miku and Zero Two become close enough to the point that Zero Two feels comfortable with Miku washing her hair, and Miku made a flower crown for Zero Two as a present.\nZorome\n \nZero Two doesn't think much of Zorome. Zorome on the other hand, exhibits a form of envy towards Zero Two and Hiro. Zorome is very verbal about this, taking a toll on Miku. It may be inferred that Zorome would like to ride with Zero Two or get the same treatment she gives Hiro. Zorome also doesn't like it when she obviously ignores him and rejects him.\nZero Two rescues him, Goro (Delphinium), and Futoshi (Genista) during their mission into the underground that went wrong. Zorome is in awe of Zero Two's daring rescue and is visually relieved. Zorome is jealous of Zero Two and Hiro acting like a couple and wishes he had a girl like that. He wants to know what Zero Two means by \"kiss\" and \"loving a person\".\nKokoro\n \nKokoro finds her a \"strange person and wonders if she likes sweets\". Kokoro is very quiet and reserved, but is fond of Zero Two and finds her presence reassuring. Zero Two rescues her, Ichigo (Delphinium), and Miku (Argentea) during their mission into the underground. After the retrieval of the deactivated Strelizia, she is visibly worried when she sees Zero Two emerge from the FRANXX but not Mitsuru, who was at a near-death state in the cockpit. She emulates Zero Two when feeding Futoshi in the same manner Zero Two feeds Hiro. Kokoro and Miku are excited to see that Zero Two and Hiro are now part of Squad 13. Kokoro expresses that it's reassuring since Zero Two has saved the squad in every mission. \nIt is from Zero Two that Kokoro learns the meaning of marriage and this contributes to her and Mitsuru’s decision to have a wedding. Zero Two dresses up in the standard squad uniform for the occasion. Kokoro later tends to Zero Two while the squad, minus Kokoro and Mitsuru, fight the VIRM. Kokoro and Mitsuru credit Zero Two for teaching them what love means and it inspired them to name their daughter Ai for ‘love’. When Zero Two and Hiro sacrificed themselves, Kokoro broke down in tears but was thankful to them for saving the planet.\nFutoshi\n \nIn \"Episode 1: Alone and Lonesome!\", Zero Two saves Futoshi and the other Parasites from the klaxosaur attack during the welcoming ceremony. After the battle, he looks on as she not only exits the Strelizia but that she is also carrying an unconscious Hiro out with her. He inferred that Hiro piloted the Strelizia\nUpon seeing her for the first time, Futoshi is amazed that Zero Two is \"nothing\" like the rumours, due to her flirtatious and gluttonous personality. Later, Zero Two takes Futoshi's seat at breakfast beside Hiro. Forcing him to sit with Kokoro at the girls table. This turns out to benefit Futoshi as well as Kokoro feeds him, mimicking the relationship of Zero Two and Hiro. Futoshi is glad that Hiro and Zero Two are now officially a part of Squad 13. He acknowledges that Zero Two always saves them and they wouldn't be there without them.\nIkuno\n \nIkuno is quick to note that Zero Two is a klaxosaur hybrid. Ikuno also chagrins the fact she has a single digit code. Ikuno is visibly hurt that Mitsuru would rather ride with Zero Two after their failure to launch the Chlorophytum. She is later seen sadly watching Mitsuru blame her for the failure and proposing that Zero Two take him on as her official partner. \nIkuno largely kept her distance from Zero Two and only interacted with her on the battlefield. \nIkuno starts to accept Zero Two after Zero Two was concerned with Ikuno for having a fever the previous day. Ikuno was also willing to over exert herself in order to help Zero Two rescue Hiro from the Klaxosaur Princess. After Zero Two and Hiro’s sacrifice, Ikuno sadly wondered if everyone’s prayers reached them in time.\nMitsuru\n \nMitsuru largely thought nothing of Zero Two at first and noted the rumors that she was capable of piloting a FRANXX alone. He later volunteers to be her temporary partner when he fails to activate Chlorophytum with Ikuno. The result leaves him severally injured and traumatized. He becomes fearful of her, seeing her as a demon, and stating anyone that willingly wanted to pilot with her was insane. It is not known what actually happened to him, but from his perspective, she tried to 'devour his body, blood, and soul'. And while she was doing it, she was smiling. Mitsuru is the only one visually displeased with the official welcoming of Hiro and Zero Two into Squad 13.\nGradually, he begins to tolerate her presence in the squad, especially after she saves him and Ikuno from a klaxosaur when the squad fails time kill it. After she reconciled with the Squad, he seems to have fully accepted her as a comrade, as he is shown to be near her and having conversations with her. Zero Two tells him and Kokoro what getting married means, making them decide to have a wedding, which she attends. He also chooses to stay by her and Kokoro’s side while Zero Two is catatonic. \nMitsuru says he and Kokoro chose to name their daughter Ai because it means ‘love’ and he wanted her to inherit the bond Zero Two shared with Hiro. He later mourns their deaths.\nNana\n \nNana is Zero Two's handler from HQ and Papa. She transmits orders to Zero Two and whether or not she has the proper authorizations. She and Zero Two have a passive-aggressive (or just aggressive) relationship, however, they are particularly chummy on occasion. They share a degree of respect for each other as they make concessions that others do not enjoy. Zero Two is known to ignore or directly disobey orders from Nana when she sees fit to do so.\nZero Two asks Nana whether there's an ocean in Plantation 13, to which Nana asks why she can't take a simple shower. Zero Two licks herself, expressing she hates how she \"tastes\". Later after disembarking into Plantation 13, Zero Two disappears unknown to Nana's knowledge. Zero Two is then shown mocking Nana as she plays with her cap then tossing it aside.\nLater, Nana reprimands Zero Two for running off and orders her not to mix with the Parasites. After the klaxosaur attack, Nana informs the Parasites of Zero Two's background and reputation.\nNana commands Zero Two to sit at the table she's \"supposed\" to be sitting at, instead of mixing with the Parasites. Later in the elevator, Nana tells Zero Two not to mess with the parasites as she is \"Too much for them to handle\". During the discussion of Hiro's parasite promotion, Nana vetoes Zero Two's proposal informing her that HQ hasn't authorized the use of Strelizia.\nWhile Nana is coordinating the seemingly successful mission in the super pipe, Zero Two suddenly appears in the room and begins to mock them that it's not over yet. Zero Two was right as a swarm of Conrad-class klaxosaurs emerge from the shadows of the underground and begin to overwhelm the FranXXs. As the situation becomes dire, Zero Two continues to jest Nana into letting her pilot the Strelizia with Hiro, but Nana does not bend. Zero Two and Nana begin to butt heads, before the tension escalates any further Mitsuru intervenes and volunteers to pilot the Strelizia, being the only available \"official\" stamen. Nana asks Zero Two whether she could ride with Mitsuru. Zero Two persists that she will only ride with Hiro. She then looks over to Hiro to coax his affirmation, but Hiro tells Zero Two to ride with Mitsuru. He states that he'd rather have his teammates saved than be able to pilot a FranXX. Nana then coordinates the deployment of Strelizia.\nLater, Zero Two (Strelizia) decides to go on a rampage rather than comply with Nana's order to withdraw. Nana then deploys a team to \"retrieve\" the Strelizia and her Stamen. After the retrieval, Nana grimly looks at the sight of Zero Two as she exits Strelizia without her stamen. After all the chaos is settled via Zero Two and Hiro’s reconciliation, Nana is relieved.\nHowever, Nana is removed from being the squad’s caretaker but returns a month later. She supports the squad’s decision to travel to space to rescue Zero Two and, two years later, she mourns Zero Two and Hiro’s deaths.\nDr. FRANXX\nDr. FRANXX created Zero Two and subjected her to torturous experiments when she was a child. This included locking and chaining her up in her room, and he even erased her memories of Hiro after she ran away with him from the Garden. He was amazed by her healing abilities and how quickly she developed a human form despite having Klaxosaur blood. He treated her as nothing more than a specimen and a weapon, but after she became a pistil, he gave her more freedom and tolerated her rebellious attitude.\nZero Two’s feelings for the doctor are ambiguous; she seems to hold a degree of indifference towards him for the pain and torture he put her through. Yet, she seems to respect him and can be amicable with him, likely because he gives her free reign on what she wants to do. Dr. FRANXX is more inclined than the other APE officials to keep Zero Two with Squad 13, as she and Hiro are found to be compatible with Strelizia and it is hinted that he hoped to reunite the two after erasing their memories.\nWhen Hiro survives his third ride, Dr. FRANXX approves of him becoming Zero Two’s official partner, though he remains wary that she still may consume his humanity.\nAs Zero Two rushes to rescue Hiro from 001, Dr. FRANXX helps her in order to atone for his sins. Before going, Zero Two asks him if he brought her to Plantation 13 to reunite her with Hiro. He says he didn’t expect the two to rekindle what they had before but it was just a whim on his part. As proof of forgiveness, Zero Two thanks him for creating her, as she was able to meet Hiro.\n9's\nThe 9’s are Zero Two’s genetic clones. However, she does not get along with any them, especially 9'α. Because of her incompatibility with the 9’s, Zero Two was removed from the unit and began fighting on her own.\nTheir relationship is shown to be very negative; 9’a often mocks her and doesn’t hesitate to turn anyone against her. Whereas, Zero Two doesn’t hesitate to threaten him in retaliation. 9’a is also embarrassed by Zero Two’s attempts to appear more human, as he openly refers to her as a monster.\nThe 9’s, after everyone is abandoned and betrayed by Papa, decide to make atonement for their actions by helping Squad 13 rescue Zero Two in space as she fights VIRM. 9’a in particular demonstrates his desire to atone by sacrificing himself to save Hiro and his last words were for Hiro to give his regards to Zero Two.\nEtymology\nZero Two's nickname in Japanese (ゼロツー, Zero Tsū) is the katakanization of the English numbers of her code.\nHer codename can also be read as \"oni\" from some of the numeral's readings from her real name \"Code:002\" (pronounced zero-zero-ni): \"o\" from \"0\" which can be written as \"○\" in kanji and ni from 2 (二, ni).\nHer old codename is 9'℩ (ナインイオタ), which is the 9th letter in the Greek alphabet.\nGallery\nZero Two/Image Gallery\nAppearances\nDARLING in the FRANXX appearances\nEpisode 01\nEpisode 02\nEpisode 03\nEpisode 04\nEpisode 05\nEpisode 06\nEpisode 07\n08\n09\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\nQuotes\n“The Jian, also known as the bird that shares wings, possesses one wing. Unless a male and female pair lean on each other and act as one, they’re incapable of flight. They’re imperfect, incomplete creatures. But, for some reason, their way of living, struck me as profoundly beautiful. It was beautiful, I felt.”—Zero Two\n“I'm always alone too, thanks to these horns.”—Zero Two\n“If you don't belong here, just build a place where you do. If you don’t have Avery a partner, just find another one. If you can’t get find one, just take one by force.”—Zero Two to Hiro\n“I think I’ve taken a liking to you. How would you like to become my darling?”—Zero Two to Hiro\n“I like the look on your eyes, it makes my heart race. Now come to me. Let me get a taste of you. You are now... my darling!”—Zero Two to Hiro\n“Found you, my darling.”—Zero Two to Hiro\n“Here, this is nice and sweet!”—Zero Two pouring honey over Hiro's breakfast\n“I'll let you have him this one time. Go for it!”—Zero Two to Ichigo\n“Once we die, we'll only be a statistic. It won't matter what we're called.”—Zero Two\n“Just look at this lifeless city. There are no skies or oceans here. It's a one-way street to nowhere. A dead-end life.”—Zero Two when she is overlooking the inner city\n“Darling, wanna run away with me? I can get you out of here.”—Zero Two to Hiro\n“Do you think I’m a monster too?”—Zero Two to Hiro\n“How can I leave after hearing that?”—Zero Two when she's about to escape\n“Nobody's ever said such embarrassing things to me before!”—Zero Two after running away together with Hiro\n“You wanna ride me, huh?”—Zero Two to Hiro after his confession\n“Of course, you can do this. WE can do this!”—Zero Two reaffirming Hiro he can pilot a FranXX it as long as it's \"them\".\n“Weaklings die, big deal.”—Zero Two\n“Sure, he could. But that'd mean he didn't amount to much.”—Zero Two concerning the possibility Hiro dies\n“What is \"human\" to you people?”—Zero Two after Ichigo slaps her and vilifies her for not being \"human\"\n“Your partner is me and me alone.”—Zero Two responding to Hiro thanking her for giving him the opportunity to pilot a FRANXX\n“What'll it be, if you want off this ride, now's your chance.”—Zero Two asking Hiro if he's still willing to ride with her even if it means leads to his death\n“Swimming in the ocean feels so good! And it does taste salty”—Zero Two's first experience with the ocean\n“You're my wings, right? If I'm with you, I can fly anywhere I want... We'll always be together right?”—Zero Two embracing Hiro in the ocean\n“A kiss is something you share with your special someone, is the one you kissed special to you?”—Zero Two explaining \"the kiss\" to Ichigo\n“Kill more and more of those monsters and make me human. You're only my fodder, after all!”—Zero Two talking to a desperate Hiro.\n“Give me all your life. I'm going to become a human. So I can meet my darling from back then.”—Zero Two strangling Hiro while rampaging\n“The leaving something behind part. My body can't do that. It's wonderful. You're all wonderful. You have the ability to decide your futures with your own hearts.”—Zero Two talking about her thoughts on reproduction\nTrivia\nThe alternate reading for Zero Two's code, 002, is Oni. In Japanese, Oni (鬼) means \"demon,\" a reference to the pair of horns on her head. Hiro was about to name her Oni, but he didn't go with the idea, probably because he knew what oni means.\nHer old codename is Nine Iota. \"Iota\" is the 9th letter in the Greek alphabet. The kanji for 9 is 九 and can be read as \"kyuu\" or \"ku\". A different kanji for \"ku\" is 苦, meaning \"pain\", \"anguish\", \"suffering\", \"hardship.\" The combination of \"Ku\" and \"Oni\" would also make it \"Kuoni,\" which means \"brave\" in Old High German.\nHer theme is \"Vanquish\" (also known as Strelizia Awakening) by Tachibana Asami. Its lyrics are the perfect summary of her thoughts and feelings in Episode 12 and 13.\nZero Two has a sweet tooth, which is seen because:\nShe's constantly sucking on lollipops.\nShe loves candy, cakes, and other sweets.\nShe loves honey and eats honey with almost everything.\nZero Two appears to be a good artist, and even made a perfect recreation of the images from her picture book.\n \n Zero Two is ambidextrous and has been shown using either her left hand or her right.\nZero Two wished to see the ocean and would also like to taste it; her wish is fulfilled in Episode 07: Shooting Star Moratorium. She finally swims in the ocean and licks herself, satisfied it finally tastes salty.\nZero Two is fascinated by rain.\nZero Two's horns do not have nerve endings similar to nails. Several times Zero Two can be seen modifying them with a filer.\nAccording to Tia Ballard, as suggested by the director (Clifford Chapin), she attempted to voice Zero Two with a lollipop in her mouth in the scenes when Zero Two had one in her mouth. However, it made a crunching noise against her teeth when she tried to speak and she opted to use her finger instead.\nZero Two seems to have taste-related abilities; for example, she guessed the personality of three people in Squad 13, and despite the erasure of her childhood memories, she managed to remember them by licking herself.\nReferences\n↑ 1.0 1.1 Episode 13\n↑ 2.0 2.1 2.2 2.3 2.4 2.5 2.6 Episode 01\n↑ 3.0 3.1 Episode 08\n↑ 4.0 4.1 4.2 4.3 Episode 07\n↑ 5.0 5.1 5.2 Episode 12\n↑ Episode 14\n↑ Episode 16\n↑ Episode 23\n↑ 9.0 9.1 9.2 Episode 17\n↑ Episode 20\n↑ Episode 24\n↑ Episode 21\n↑ Episode 15\n↑ 14.0 14.1 Episode 02\n↑ 15.0 15.1 15.2 Episode 03\n↑ 16.0 16.1 16.2 16.3 Episode 04\n↑ 17.0 17.1 17.2 17.3 17.4 Episode 05\nDARLING in the FRANXX\nPILOTS\nSTAMEN\nHiro | Goro | Zorome | Futoshi | Mitsuru\nPISTIL\nZero Two | Ichigo | Miku | Kokoro | Ikuno\nOTHER\nNaomi | Old Woman | 081 | 090 | 245 | 9'α | 9'β | 9'γ | 9'δ | 9'ε | 9'ζ | VIRM\nAPE\nPapa | Vice Chairman | Gorilla | Marmoset | Lemur | Baboon | TarsierDr. FRANXX | Hachi | Nana\nFRANXX\nStrelizia | Delphinium | Argentea | Genista | Chlorophytum | Standard | 9 Model\nMEDIA\nEPISODES\n01 | 02 | 03 | 04 | 05 | 06 | 07 | 08 | 09 | 10 | 11 | 1213 | 14 | 15 | 16 | 17 | 18 | 19 | 20 | 21 | 22 | 23 | 24\nCHAPTERS\n01 | 02 | 03 | 04 | 05 | 06 | 07 | 08 | 09 | 10 | 11 | 12 | 13 | 14 | 15 | 16 | 17 | 18 | 19 | 20\nMUSIC\nKISS OF DEATH | Torikago | Manatsu no Setsuna | Beautiful WorldHitori | CÅGE | Vanquish | Escape | Darling\nWORLD\nLOCATIONS\nCerasus | Garden | Chrysanthemum | Gran Crevasse | Cosmos\nKEYWORD\nKlaxosaur | FRANXX"
}